*** crates/ax-cli/src/main.rs:100:13: delete match arm "--period" in parse_scan_args

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ delete match arm "--period" in parse_scan_args
@@ -92,25 +92,17 @@
     while let Some(arg) = it.next() {
         match arg.as_str() {
             "--baseline" => {
                 let v = it
                     .next()
                     .ok_or_else(|| AxError::Config("--baseline requires a path".into()))?;
                 parsed.baseline = Some(v.clone());
             }
-            "--period" => {
-                let v = it
-                    .next()
-                    .ok_or_else(|| AxError::Config("--period requires an integer".into()))?;
-                let n = v.parse::<usize>().map_err(|_| {
-                    AxError::Config(format!("--period must be an integer, got '{v}'"))
-                })?;
-                parsed.period = Some(n);
-            }
+             /* ~ changed by cargo-mutants ~ */
             "--cadence" => {
                 let v = it
                     .next()
                     .ok_or_else(|| AxError::Config("--cadence requires a column name".into()))?;
                 parsed.cadence = Some(v.clone());
             }
             _ => parsed.positional.push(arg.clone()),
         }

---- tests::parse_scan_args_errors_on_bad_flag_values stdout ----

thread 'tests::parse_scan_args_errors_on_bad_flag_values' (2045503) panicked at crates/ax-cli/src/main.rs:450:9:
assertion failed: parse_scan_args(&strings(&["--period"])).is_err()

---- tests::parse_scan_args_extracts_flags_and_positionals stdout ----

thread 'tests::parse_scan_args_extracts_flags_and_positionals' (2045504) panicked at crates/ax-cli/src/main.rs:434:9:
assertion `left == right` failed
  left: None
 right: Some(7)

failures:
    tests::parse_scan_args_errors_on_bad_flag_values
    tests::parse_scan_args_extracts_flags_and_positionals

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
