*** crates/ax-cli/src/main.rs:109:13: delete match arm "--cadence" in parse_scan_args

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ delete match arm "--cadence" in parse_scan_args
@@ -101,22 +101,17 @@
                 let v = it
                     .next()
                     .ok_or_else(|| AxError::Config("--period requires an integer".into()))?;
                 let n = v.parse::<usize>().map_err(|_| {
                     AxError::Config(format!("--period must be an integer, got '{v}'"))
                 })?;
                 parsed.period = Some(n);
             }
-            "--cadence" => {
-                let v = it
-                    .next()
-                    .ok_or_else(|| AxError::Config("--cadence requires a column name".into()))?;
-                parsed.cadence = Some(v.clone());
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => parsed.positional.push(arg.clone()),
         }
     }
     Ok(parsed)
 }
 
 /// Builds the detector config, applying any `--period` / `--cadence` overrides.
 fn config_for(args: &ScanArgs) -> DetectConfig {

---- tests::parse_scan_args_extracts_flags_and_positionals stdout ----

thread 'tests::parse_scan_args_extracts_flags_and_positionals' (2045836) panicked at crates/ax-cli/src/main.rs:438:9:
assertion `left == right` failed
  left: None
 right: Some("ts")

failures:
    tests::parse_scan_args_extracts_flags_and_positionals

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
