*** crates/ax-cli/src/main.rs:114:5: replace load_baseline -> Result<Option<RecordSet>, AxError> with Ok(None)

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace load_baseline -> Result<Option<RecordSet>, AxError> with Ok(None)
@@ -106,23 +106,17 @@
                 .map_err(|e| AxError::Io(format!("stdin: {e}")))?;
             Ok(("-".to_string(), buf))
         }
     }
 }
 
 /// Normalizes the optional baseline corpus from its path.
 fn load_baseline(path: &Option<String>) -> Result<Option<RecordSet>, AxError> {
-    match path {
-        Some(p) => {
-            let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
-            Ok(Some(ax_normalize::normalize(p, &bytes)?))
-        }
-        None => Ok(None),
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn cmd_scan(rest: &[String]) -> Result<ExitCode, AxError> {
     let (baseline_path, positional) = split_baseline(rest)?;
     let (source, bytes) = read_input(positional.first())?;
     let rs = ax_normalize::normalize(&source, &bytes)?;
     let baseline = load_baseline(&baseline_path)?;

---- scan_baseline_mode_detects_drift stdout ----

thread 'scan_baseline_mode_detects_drift' (1728133) panicked at crates/ax-cli/tests/cli.rs:150:5:
assertion `left == right` failed: stderr: 
  left: 0
 right: 1

failures:
    scan_baseline_mode_detects_drift

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
