*** crates/ax-cli/src/main.rs:123:5: replace config_for -> DetectConfig with Default::default()

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace config_for -> DetectConfig with Default::default()
@@ -115,21 +115,17 @@
             _ => parsed.positional.push(arg.clone()),
         }
     }
     Ok(parsed)
 }
 
 /// Builds the detector config, applying any `--period` / `--cadence` overrides.
 fn config_for(args: &ScanArgs) -> DetectConfig {
-    DetectConfig {
-        ctx_period: args.period.unwrap_or(0),
-        cadence_column: args.cadence.clone(),
-        ..DetectConfig::default()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
     match path {
         Some(p) if p != "-" => {
             let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
             Ok((p.clone(), bytes))

---- tests::config_for_applies_period_override stdout ----

thread 'tests::config_for_applies_period_override' (2046084) panicked at crates/ax-cli/src/main.rs:464:9:
assertion `left == right` failed
  left: 0
 right: 24

failures:
    tests::config_for_applies_period_override

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
