*** crates/ax-cli/src/main.rs:125:9: delete field cadence_column from struct DetectConfig expression in config_for

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ delete field cadence_column from struct DetectConfig expression in config_for
@@ -117,17 +117,17 @@
     }
     Ok(parsed)
 }
 
 /// Builds the detector config, applying any `--period` / `--cadence` overrides.
 fn config_for(args: &ScanArgs) -> DetectConfig {
     DetectConfig {
         ctx_period: args.period.unwrap_or(0),
-        cadence_column: args.cadence.clone(),
+         /* ~ changed by cargo-mutants ~ */
         ..DetectConfig::default()
     }
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
     match path {
         Some(p) if p != "-" => {

---- tests::config_for_applies_period_override stdout ----

thread 'tests::config_for_applies_period_override' (2046657) panicked at crates/ax-cli/src/main.rs:477:9:
assertion `left == right` failed
  left: None
 right: Some("ts")

failures:
    tests::config_for_applies_period_override

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
