*** crates/ax-cli/src/main.rs:148:5: replace resolve_handle -> Result<serde_json::Value, AxError> with Ok(Default::default())

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace resolve_handle -> Result<serde_json::Value, AxError> with Ok(Default::default())
@@ -140,53 +140,17 @@
     });
     println!("{}", serde_json::to_string(&out).expect("explain serializes"));
     Ok(ExitCode::Clean)
 }
 
 /// Resolves a handle to a compact evidence object, or fails cleanly if it does
 /// not address anything in this corpus (honest absence, never a fabricated hit).
 fn resolve_handle(rs: &RecordSet, handle: &Handle) -> Result<serde_json::Value, AxError> {
-    let unresolved = || AxError::UnresolvedHandle(handle.canonical());
-    match handle {
-        Handle::Column { name } | Handle::Dist { column: name } => {
-            let col = rs.column(name).ok_or_else(unresolved)?;
-            Ok(serde_json::json!({
-                "kind": "column",
-                "column": col.name,
-                "type": col.ty,
-                "len": col.len(),
-                "nulls": col.null_count(),
-            }))
-        }
-        Handle::Cell { column, row } => {
-            let col = rs.column(column).ok_or_else(unresolved)?;
-            let value: &Value = col.cells.get(*row).ok_or_else(unresolved)?;
-            Ok(serde_json::json!({
-                "kind": "cell",
-                "column": col.name,
-                "row": row,
-                "value": value,
-                "column_type": col.ty,
-            }))
-        }
-        Handle::Range { column, start, end } => {
-            let col = rs.column(column).ok_or_else(unresolved)?;
-            if *start >= *end || *end > col.len() {
-                return Err(unresolved());
-            }
-            Ok(serde_json::json!({
-                "kind": "range",
-                "column": col.name,
-                "start": start,
-                "end": end,
-                "values": &col.cells[*start..*end],
-            }))
-        }
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use ax_core::Column;
 
     fn corpus() -> RecordSet {

---- tests::resolve_missing_column_is_unresolved stdout ----

thread 'tests::resolve_missing_column_is_unresolved' (1216445) panicked at crates/ax-cli/src/main.rs:189:9:
assertion failed: matches!(resolve_handle(&rs, &h), Err(AxError::UnresolvedHandle(_)))

---- tests::resolve_cell_ok stdout ----

thread 'tests::resolve_cell_ok' (1216444) panicked at crates/ax-cli/src/main.rs:172:9:
assertion `left == right` failed
  left: Null
 right: Object {"t": String("int"), "v": Number(2)}

---- tests::resolve_out_of_range_is_unresolved stdout ----

thread 'tests::resolve_out_of_range_is_unresolved' (1216446) panicked at crates/ax-cli/src/main.rs:179:9:
assertion failed: matches!(resolve_handle(&rs, &h), Err(AxError::UnresolvedHandle(_)))

failures:
    tests::resolve_cell_ok
    tests::resolve_missing_column_is_unresolved
    tests::resolve_out_of_range_is_unresolved

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
