*** crates/ax-cli/src/main.rs:185:20: replace == with != in cmd_scan

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace == with != in cmd_scan
@@ -177,17 +177,17 @@
         builder = builder.absent(a.detector, a.reason);
     }
     let env = builder.build();
 
     println!(
         "{}",
         serde_json::to_string(&env).expect("envelope serializes")
     );
-    Ok(if env.exit == ExitCode::Anomalies.code() {
+    Ok(if env.exit != /* ~ changed by cargo-mutants ~ */ ExitCode::Anomalies.code() {
         ExitCode::Anomalies
     } else {
         ExitCode::Clean
     })
 }
 
 fn cmd_explain(rest: &[String]) -> Result<ExitCode, AxError> {
     let args = parse_scan_args(rest)?;

---- scan_reads_from_a_file_path_not_stdin stdout ----

thread 'scan_reads_from_a_file_path_not_stdin' (2050213) panicked at crates/ax-cli/tests/cli.rs:96:5:
assertion `left == right` failed: must read the file, stderr: 
  left: 0
 right: 1

---- scan_without_baseline_marks_distributional_absent stdout ----

thread 'scan_without_baseline_marks_distributional_absent' (2050216) panicked at crates/ax-cli/tests/cli.rs:167:5:
assertion `left == right` failed
  left: 1
 right: 0

---- scan_clean_exits_zero_with_no_rows stdout ----

thread 'scan_clean_exits_zero_with_no_rows' (2050207) panicked at crates/ax-cli/tests/cli.rs:66:5:
assertion `left == right` failed: stderr: 
  left: 1
 right: 0

failures:
    scan_baseline_mode_detects_drift
    scan_clean_exits_zero_with_no_rows
    scan_dash_reads_stdin
    scan_outlier_exits_one_with_a_finding
    scan_reads_from_a_file_path_not_stdin
    scan_without_baseline_marks_distributional_absent

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
