*** crates/ax-cli/src/main.rs:26:5: replace main -> ProcExit with Default::default()

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace main -> ProcExit with Default::default()
@@ -18,24 +18,17 @@
 use ax_detect::{DetectConfig, Registry};
 use std::io::Read;
 use std::process::ExitCode as ProcExit;
 
 mod describe;
 mod schema;
 
 fn main() -> ProcExit {
-    let args: Vec<String> = std::env::args().skip(1).collect();
-    match run(&args) {
-        Ok(code) => ProcExit::from(code.code() as u8),
-        Err(e) => {
-            eprintln!("anomalyx: error: {e}");
-            ProcExit::from(ExitCode::Error.code() as u8)
-        }
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn run(args: &[String]) -> Result<ExitCode, AxError> {
     let Some((cmd, rest)) = args.split_first() else {
         eprintln!("{}", usage());
         return Ok(ExitCode::Error);
     };
     match cmd.as_str() {

*** result: Success
