*** crates/ax-cli/src/main.rs:272:21: replace >= with < in resolve_handle

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace >= with < in resolve_handle
@@ -264,17 +264,17 @@
                 "kind": "range",
                 "column": col.name,
                 "start": start,
                 "end": end,
                 "values": &col.cells[*start..*end],
             }))
         }
         Handle::Row { row } => {
-            if *row >= rs.rows() {
+            if *row < /* ~ changed by cargo-mutants ~ */ rs.rows() {
                 return Err(unresolved());
             }
             let cells: serde_json::Map<String, serde_json::Value> = rs
                 .columns
                 .iter()
                 .map(|c| {
                     (
                         c.name.clone(),

---- tests::resolve_row_ok_and_out_of_range stdout ----

thread 'tests::resolve_row_ok_and_out_of_range' (2052409) panicked at crates/ax-cli/src/main.rs:404:63:
called `Result::unwrap()` on an `Err` value: UnresolvedHandle("row:1")

failures:
    tests::resolve_row_ok_and_out_of_range

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
