*** crates/ax-cli/src/main.rs:77:5: replace read_input -> Result<(String, Vec<u8>), AxError> with Ok(("xyzzy".into(), vec![1]))

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace read_input -> Result<(String, Vec<u8>), AxError> with Ok(("xyzzy".into(), vec![1]))
@@ -69,29 +69,17 @@
      \x20 anomalyx scan [PATH]         Scan a file (or stdin) for anomalies\n\
      \x20 anomalyx explain <HANDLE> [PATH]   Resolve a finding handle to evidence\n\
      \n\
      EXIT: 0 clean · 1 anomalies found · 2 error"
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
-    match path {
-        Some(p) if p != "-" => {
-            let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
-            Ok((p.clone(), bytes))
-        }
-        _ => {
-            let mut buf = Vec::new();
-            std::io::stdin()
-                .read_to_end(&mut buf)
-                .map_err(|e| AxError::Io(format!("stdin: {e}")))?;
-            Ok(("-".to_string(), buf))
-        }
-    }
+    Ok(("xyzzy".into(), vec![1])) /* ~ changed by cargo-mutants ~ */
 }
 
 fn cmd_scan(rest: &[String]) -> Result<ExitCode, AxError> {
     let (source, bytes) = read_input(rest.first())?;
     let rs = ax_normalize::normalize(&source, &bytes)?;
     let cfg = DetectConfig::default();
     let registry = Registry::default_set();
     let report = registry.run(&rs, &cfg);

*** result: Success
