*** crates/ax-cli/src/main.rs:90:5: replace parse_scan_args -> Result<ScanArgs, AxError> with Ok(Default::default())

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace parse_scan_args -> Result<ScanArgs, AxError> with Ok(Default::default())
@@ -82,45 +82,17 @@
 struct ScanArgs {
     baseline: Option<String>,
     period: Option<usize>,
     cadence: Option<String>,
     positional: Vec<String>,
 }
 
 fn parse_scan_args(args: &[String]) -> Result<ScanArgs, AxError> {
-    let mut parsed = ScanArgs::default();
-    let mut it = args.iter();
-    while let Some(arg) = it.next() {
-        match arg.as_str() {
-            "--baseline" => {
-                let v = it
-                    .next()
-                    .ok_or_else(|| AxError::Config("--baseline requires a path".into()))?;
-                parsed.baseline = Some(v.clone());
-            }
-            "--period" => {
-                let v = it
-                    .next()
-                    .ok_or_else(|| AxError::Config("--period requires an integer".into()))?;
-                let n = v.parse::<usize>().map_err(|_| {
-                    AxError::Config(format!("--period must be an integer, got '{v}'"))
-                })?;
-                parsed.period = Some(n);
-            }
-            "--cadence" => {
-                let v = it
-                    .next()
-                    .ok_or_else(|| AxError::Config("--cadence requires a column name".into()))?;
-                parsed.cadence = Some(v.clone());
-            }
-            _ => parsed.positional.push(arg.clone()),
-        }
-    }
-    Ok(parsed)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Builds the detector config, applying any `--period` / `--cadence` overrides.
 fn config_for(args: &ScanArgs) -> DetectConfig {
     DetectConfig {
         ctx_period: args.period.unwrap_or(0),
         cadence_column: args.cadence.clone(),
         ..DetectConfig::default()

---- tests::parse_scan_args_errors_on_bad_flag_values stdout ----

thread 'tests::parse_scan_args_errors_on_bad_flag_values' (2044991) panicked at crates/ax-cli/src/main.rs:429:9:
assertion failed: parse_scan_args(&strings(&["--baseline"])).is_err()

---- tests::parse_scan_args_defaults_when_flags_absent stdout ----

thread 'tests::parse_scan_args_defaults_when_flags_absent' (2044990) panicked at crates/ax-cli/src/main.rs:424:9:
assertion `left == right` failed
  left: []
 right: ["cur.csv"]

---- tests::parse_scan_args_extracts_flags_and_positionals stdout ----

thread 'tests::parse_scan_args_extracts_flags_and_positionals' (2044992) panicked at crates/ax-cli/src/main.rs:413:9:
assertion `left == right` failed
  left: None
 right: Some("base.csv")

failures:
    tests::parse_scan_args_defaults_when_flags_absent
    tests::parse_scan_args_errors_on_bad_flag_values
    tests::parse_scan_args_extracts_flags_and_positionals

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
