*** crates/ax-cli/src/main.rs:94:13: delete match arm "--baseline" in parse_scan_args

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ delete match arm "--baseline" in parse_scan_args
@@ -86,22 +86,17 @@
     positional: Vec<String>,
 }
 
 fn parse_scan_args(args: &[String]) -> Result<ScanArgs, AxError> {
     let mut parsed = ScanArgs::default();
     let mut it = args.iter();
     while let Some(arg) = it.next() {
         match arg.as_str() {
-            "--baseline" => {
-                let v = it
-                    .next()
-                    .ok_or_else(|| AxError::Config("--baseline requires a path".into()))?;
-                parsed.baseline = Some(v.clone());
-            }
+             /* ~ changed by cargo-mutants ~ */
             "--period" => {
                 let v = it
                     .next()
                     .ok_or_else(|| AxError::Config("--period requires an integer".into()))?;
                 let n = v.parse::<usize>().map_err(|_| {
                     AxError::Config(format!("--period must be an integer, got '{v}'"))
                 })?;
                 parsed.period = Some(n);

---- tests::parse_scan_args_errors_on_bad_flag_values stdout ----

thread 'tests::parse_scan_args_errors_on_bad_flag_values' (2045254) panicked at crates/ax-cli/src/main.rs:452:9:
assertion failed: parse_scan_args(&strings(&["--baseline"])).is_err()

---- tests::parse_scan_args_extracts_flags_and_positionals stdout ----

thread 'tests::parse_scan_args_extracts_flags_and_positionals' (2045255) panicked at crates/ax-cli/src/main.rs:436:9:
assertion `left == right` failed
  left: None
 right: Some("base.csv")

failures:
    tests::parse_scan_args_errors_on_bad_flag_values
    tests::parse_scan_args_extracts_flags_and_positionals

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
