*** crates/ax-core/src/envelope.rs:182:64: replace == with != in EnvelopeBuilder::build

*** mutation diff:
--- crates/ax-core/src/envelope.rs
+++ replace == with != in EnvelopeBuilder::build
@@ -174,17 +174,17 @@
             ]);
         }
 
         let max_severity = self.findings.iter().map(|f| f.severity).max();
         let by_class = AnomalyClass::ALL
             .iter()
             .map(|&class| ClassCount {
                 class,
-                count: self.findings.iter().filter(|f| f.class == class).count(),
+                count: self.findings.iter().filter(|f| f.class != /* ~ changed by cargo-mutants ~ */ class).count(),
             })
             .collect();
         let summary = Summary {
             total: self.findings.len(),
             max_severity,
             by_class,
         };

---- envelope::tests::by_class_counts_only_matching_class stdout ----

thread 'envelope::tests::by_class_counts_only_matching_class' (1483840) panicked at crates/ax-core/src/envelope.rs:282:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    envelope::tests::by_class_counts_only_matching_class

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
