*** crates/ax-core/src/envelope.rs:31:9: replace ExitCode::code -> i32 with 1

*** mutation diff:
--- crates/ax-core/src/envelope.rs
+++ replace ExitCode::code -> i32 with 1
@@ -23,17 +23,17 @@
     /// Anomalies found.
     Anomalies = 1,
     /// The tool could not complete (bad input, unresolved handle, …).
     Error = 2,
 }
 
 impl ExitCode {
     pub fn code(self) -> i32 {
-        self as i32
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A detector that declined to run, with a machine-readable reason. Recorded so
 /// absence is *explicit* — an unavailable detector contributes nothing and says
 /// so, rather than implying the data looked fine.
 #[derive(Debug, Clone, Serialize)]
 pub struct Absence {

---- envelope::tests::exit_codes_are_committed stdout ----

thread 'envelope::tests::exit_codes_are_committed' (1483208) panicked at crates/ax-core/src/envelope.rs:252:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    envelope::tests::exit_codes_are_committed

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
