*** crates/ax-detect/src/coll.rs:113:12: delete ! in <impl Detector for CusumDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ delete ! in <impl Detector for CusumDetector>::detect
@@ -105,17 +105,17 @@
                     shift,
                     format!(
                         "{}: level shift at row {start} — mean {mean_l:.4} → {mean_r:.4}, standardized shift {shift:.3} > {:.3}",
                         col.name, cfg.coll_threshold
                     ),
                 ));
             }
         }
-        if !applicable {
+        if  /* ~ changed by cargo-mutants ~ */applicable {
             out.mark_absent(
                 self.id(),
                 format!(
                     "no numeric column with ≥ {} values and non-zero variance",
                     cfg.coll_min_n
                 ),
             );
         }

---- coll::tests::constant_column_is_absent stdout ----

thread 'coll::tests::constant_column_is_absent' (1872548) panicked at crates/ax-detect/src/coll.rs:237:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coll::tests::runs_at_exactly_min_n stdout ----

thread 'coll::tests::runs_at_exactly_min_n' (1872550) panicked at crates/ax-detect/src/coll.rs:215:9:
exactly min_n rows must be assessed

---- coll::tests::stationary_series_has_no_findings stdout ----

thread 'coll::tests::stationary_series_has_no_findings' (1872553) panicked at crates/ax-detect/src/coll.rs:223:9:
it ran; not absent

failures:
    coll::tests::constant_column_is_absent
    coll::tests::runs_at_exactly_min_n
    coll::tests::stationary_series_has_no_findings
    coll::tests::too_short_is_absent

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
