*** crates/ax-detect/src/coll.rs:30:11: replace += with -= in cusum_changepoint

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace += with -= in cusum_changepoint
@@ -22,17 +22,17 @@
 /// Index `m` (a split into `[0, m)` and `[m, n)`) that maximizes `|CUSUM|` over
 /// interior split points. Returns `0` if there is no interior split.
 pub fn cusum_changepoint(xs: &[f64], mean: f64) -> usize {
     let n = xs.len();
     let mut s = 0.0_f64;
     let mut best = -1.0_f64;
     let mut m = 0;
     for (k, &x) in xs.iter().enumerate() {
-        s += x - mean;
+        s -= /* ~ changed by cargo-mutants ~ */ x - mean;
         let split = k + 1;
         if split < n && s.abs() > best {
             best = s.abs();
             m = split;
         }
     }
     m
 }

*** result: Success
