*** crates/ax-detect/src/coll.rs:31:23: replace + with - in cusum_changepoint

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace + with - in cusum_changepoint
@@ -23,17 +23,17 @@
 /// interior split points. Returns `0` if there is no interior split.
 pub fn cusum_changepoint(xs: &[f64], mean: f64) -> usize {
     let n = xs.len();
     let mut s = 0.0_f64;
     let mut best = -1.0_f64;
     let mut m = 0;
     for (k, &x) in xs.iter().enumerate() {
         s += x - mean;
-        let split = k + 1;
+        let split = k - /* ~ changed by cargo-mutants ~ */ 1;
         if split < n && s.abs() > best {
             best = s.abs();
             m = split;
         }
     }
     m
 }

---- coll::tests::changepoint_breaks_ties_to_the_first_peak stdout ----

thread 'coll::tests::changepoint_breaks_ties_to_the_first_peak' (1849568) panicked at crates/ax-detect/src/coll.rs:31:21:
attempt to subtract with overflow

---- coll::tests::runs_at_exactly_min_n stdout ----

thread 'coll::tests::runs_at_exactly_min_n' (1849573) panicked at crates/ax-detect/src/coll.rs:31:21:
attempt to subtract with overflow

---- coll::tests::deterministic_across_runs stdout ----

thread 'coll::tests::deterministic_across_runs' (1849572) panicked at crates/ax-detect/src/coll.rs:31:21:
attempt to subtract with overflow

failures:
    coll::tests::changepoint_breaks_ties_to_the_first_peak
    coll::tests::changepoint_finds_the_shift_index
    coll::tests::changepoint_on_flat_series_is_first_interior_split
    coll::tests::deterministic_across_runs
    coll::tests::runs_at_exactly_min_n
    coll::tests::stationary_series_has_no_findings
    coll::tests::sustained_level_shift_is_flagged_as_a_range

test result: FAILED. 90 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
