*** crates/ax-detect/src/coll.rs:32:33: replace > with >= in cusum_changepoint

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace > with >= in cusum_changepoint
@@ -24,17 +24,17 @@
 pub fn cusum_changepoint(xs: &[f64], mean: f64) -> usize {
     let n = xs.len();
     let mut s = 0.0_f64;
     let mut best = -1.0_f64;
     let mut m = 0;
     for (k, &x) in xs.iter().enumerate() {
         s += x - mean;
         let split = k + 1;
-        if split < n && s.abs() > best {
+        if split < n && s.abs() >= /* ~ changed by cargo-mutants ~ */ best {
             best = s.abs();
             m = split;
         }
     }
     m
 }
 
 /// Standardized two-segment mean difference

---- coll::tests::changepoint_breaks_ties_to_the_first_peak stdout ----

thread 'coll::tests::changepoint_breaks_ties_to_the_first_peak' (1853440) panicked at crates/ax-detect/src/coll.rs:165:9:
assertion `left == right` failed
  left: 5
 right: 1

---- coll::tests::changepoint_on_flat_series_is_first_interior_split stdout ----

thread 'coll::tests::changepoint_on_flat_series_is_first_interior_split' (1853442) panicked at crates/ax-detect/src/coll.rs:158:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    coll::tests::changepoint_breaks_ties_to_the_first_peak
    coll::tests::changepoint_on_flat_series_is_first_interior_split

test result: FAILED. 95 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
