*** crates/ax-detect/src/coll.rs:45:13: replace - with + in standardized_shift

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace - with + in standardized_shift
@@ -37,17 +37,17 @@
     m
 }
 
 /// Standardized two-segment mean difference
 /// `|meanL − meanR| / (σ·√(1/nl + 1/nr))`. Extracted so the exact arithmetic is
 /// pinned by tests.
 pub fn standardized_shift(mean_l: f64, mean_r: f64, sigma: f64, nl: usize, nr: usize) -> f64 {
     let se = sigma * (1.0 / nl as f64 + 1.0 / nr as f64).sqrt();
-    (mean_l - mean_r).abs() / se
+    (mean_l + /* ~ changed by cargo-mutants ~ */ mean_r).abs() / se
 }
 
 /// Logistic confidence in the excess of the standardized shift over `threshold`
 /// (shift == threshold ⇒ 0.5), strictly increasing in the shift.
 fn shift_confidence(shift: f64, threshold: f64) -> f64 {
     1.0 / (1.0 + (-(shift - threshold)).exp())
 }

---- coll::tests::stationary_series_has_no_findings stdout ----

thread 'coll::tests::stationary_series_has_no_findings' (1859215) panicked at crates/ax-detect/src/coll.rs:222:9:
no shift, no collective anomaly

failures:
    coll::tests::stationary_series_has_no_findings

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
