*** crates/ax-detect/src/coll.rs:56:9: replace <impl Detector for CusumDetector>::id -> &'static str with ""

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace <impl Detector for CusumDetector>::id -> &'static str with ""
@@ -48,17 +48,17 @@
 /// Logistic confidence in the excess of the standardized shift over `threshold`
 /// (shift == threshold ⇒ 0.5), strictly increasing in the shift.
 fn shift_confidence(shift: f64, threshold: f64) -> f64 {
     1.0 / (1.0 + (-(shift - threshold)).exp())
 }
 
 impl Detector for CusumDetector {
     fn id(&self) -> &'static str {
-        "coll.cusum"
+        "" /* ~ changed by cargo-mutants ~ */
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Collective
     }
     fn detect(&self, ctx: &ScanContext, cfg: &DetectConfig, out: &mut Report) {
         let mut applicable = false;
         for col in &ctx.current.columns {
             if !col.ty.is_numeric() {

---- tests::registry_registers_the_default_detector_set stdout ----

thread 'tests::registry_registers_the_default_detector_set' (1864315) panicked at crates/ax-detect/src/lib.rs:183:9:
assertion `left == right` failed
  left: ["point.modz", "struct.schema", "dist.ks", "dist.psi", "dist.chi2", "mv.mahalanobis", "ctx.seasonal", ""]
 right: ["point.modz", "struct.schema", "dist.ks", "dist.psi", "dist.chi2", "mv.mahalanobis", "ctx.seasonal", "coll.cusum"]

failures:
    tests::registry_registers_the_default_detector_set

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
