*** crates/ax-detect/src/coll.rs:74:28: replace < with > in <impl Detector for CusumDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace < with > in <impl Detector for CusumDetector>::detect
@@ -66,17 +66,17 @@
             }
             // Finite values in row order, with their original row indices.
             let pairs: Vec<(usize, f64)> = col
                 .cells
                 .iter()
                 .enumerate()
                 .filter_map(|(row, cell)| cell.as_f64().filter(|v| v.is_finite()).map(|v| (row, v)))
                 .collect();
-            if pairs.len() < cfg.coll_min_n {
+            if pairs.len() > /* ~ changed by cargo-mutants ~ */ cfg.coll_min_n {
                 continue;
             }
             let xs: Vec<f64> = pairs.iter().map(|(_, v)| *v).collect();
             let n = xs.len();
             let mean = det::mean(&xs).unwrap_or(0.0);
             let sigma = match det::std_dev(&xs) {
                 Some(s) if s > 0.0 => s,
                 _ => continue, // constant column: no shift possible

---- coll::tests::stationary_series_has_no_findings stdout ----

thread 'coll::tests::stationary_series_has_no_findings' (1866309) panicked at crates/ax-detect/src/coll.rs:223:9:
it ran; not absent

---- coll::tests::sustained_level_shift_is_flagged_as_a_range stdout ----

thread 'coll::tests::sustained_level_shift_is_flagged_as_a_range' (1866310) panicked at crates/ax-detect/src/coll.rs:190:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coll::tests::too_short_is_absent stdout ----

thread 'coll::tests::too_short_is_absent' (1866311) panicked at crates/ax-detect/src/coll.rs:230:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::stationary_series_has_no_findings
    coll::tests::sustained_level_shift_is_flagged_as_a_range
    coll::tests::too_short_is_absent

test result: FAILED. 94 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
