*** crates/ax-detect/src/coll.rs:81:28: replace match guard s > 0.0 with true in <impl Detector for CusumDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace match guard s > 0.0 with true in <impl Detector for CusumDetector>::detect
@@ -73,17 +73,17 @@
                 .collect();
             if pairs.len() < cfg.coll_min_n {
                 continue;
             }
             let xs: Vec<f64> = pairs.iter().map(|(_, v)| *v).collect();
             let n = xs.len();
             let mean = det::mean(&xs).unwrap_or(0.0);
             let sigma = match det::std_dev(&xs) {
-                Some(s) if s > 0.0 => s,
+                Some(s) if true /* ~ changed by cargo-mutants ~ */ => s,
                 _ => continue, // constant column: no shift possible
             };
             applicable = true;
 
             let m = cusum_changepoint(&xs, mean);
             if m == 0 {
                 continue;
             }

---- coll::tests::constant_column_is_absent stdout ----

thread 'coll::tests::constant_column_is_absent' (1867122) panicked at crates/ax-detect/src/coll.rs:237:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::constant_column_is_absent

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
