*** crates/ax-detect/src/coll.rs:95:35: replace - with + in <impl Detector for CusumDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace - with + in <impl Detector for CusumDetector>::detect
@@ -87,17 +87,17 @@
             if m == 0 {
                 continue;
             }
             let mean_l = det::mean(&xs[..m]).unwrap_or(0.0);
             let mean_r = det::mean(&xs[m..]).unwrap_or(0.0);
             let shift = standardized_shift(mean_l, mean_r, sigma, m, n - m);
             if shift > cfg.coll_threshold {
                 let start = pairs[m].0;
-                let end = pairs[n - 1].0 + 1;
+                let end = pairs[n + /* ~ changed by cargo-mutants ~ */ 1].0 + 1;
                 out.push(Finding::new(
                     self.id(),
                     AnomalyClass::Collective,
                     Handle::Range {
                         column: col.name.clone(),
                         start,
                         end,
                     },

---- coll::tests::deterministic_across_runs stdout ----

thread 'coll::tests::deterministic_across_runs' (1871673) panicked at crates/ax-detect/src/coll.rs:95:32:
index out of bounds: the len is 40 but the index is 41

---- coll::tests::sustained_level_shift_is_flagged_as_a_range stdout ----

thread 'coll::tests::sustained_level_shift_is_flagged_as_a_range' (1871678) panicked at crates/ax-detect/src/coll.rs:95:32:
index out of bounds: the len is 40 but the index is 41

failures:
    coll::tests::deterministic_across_runs
    coll::tests::sustained_level_shift_is_flagged_as_a_range

test result: FAILED. 95 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
