*** crates/ax-detect/src/config.rs:33:9: replace DetectConfig::version -> String with "xyzzy".into()

*** mutation diff:
--- crates/ax-detect/src/config.rs
+++ replace DetectConfig::version -> String with "xyzzy".into()
@@ -25,20 +25,17 @@
         }
     }
 }
 
 impl DetectConfig {
     /// A stable, human-legible fingerprint of the settings that affect output.
     /// Deterministic: no wall-clock, no environment.
     pub fn version(&self) -> String {
-        format!(
-            "anomalyx-cfg/1;pt={:.4};ptn={}",
-            self.point_threshold, self.point_min_n
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- config::tests::version_is_stable_and_reflects_changes stdout ----

thread 'config::tests::version_is_stable_and_reflects_changes' (972060) panicked at crates/ax-detect/src/config.rs:49:9:
assertion `left != right` failed
  left: "xyzzy"
 right: "xyzzy"

failures:
    config::tests::version_is_stable_and_reflects_changes

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
