*** crates/ax-detect/src/ctx.rs:102:5: replace scan_all -> bool with true

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace scan_all -> bool with true
@@ -94,23 +94,17 @@
             );
         }
     }
 }
 
 /// Scans every numeric column, returning whether any phase anywhere was
 /// assessed (so the caller can report honest absence otherwise).
 fn scan_all(det: &SeasonalDetector, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) -> bool {
-    let mut assessed = false;
-    for col in &rs.columns {
-        if col.ty.is_numeric() {
-            assessed |= det.scan_column(col, cfg, out);
-        }
-    }
-    assessed
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use ax_core::Value;
 
     fn weekly(cfg_period: usize) -> DetectConfig {

---- ctx::tests::absent_when_no_phase_has_enough_data stdout ----

thread 'ctx::tests::absent_when_no_phase_has_enough_data' (1878311) panicked at crates/ax-detect/src/ctx.rs:174:9:
assertion `left == right` failed
  left: 0
 right: 1

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1878316) panicked at crates/ax-detect/src/ctx.rs:199:9:
assertion `left == right` failed
  left: 0
 right: 1

---- ctx::tests::value_anomalous_only_in_context_is_flagged stdout ----

thread 'ctx::tests::value_anomalous_only_in_context_is_flagged' (1878317) panicked at crates/ax-detect/src/ctx.rs:164:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    ctx::tests::absent_when_no_phase_has_enough_data
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged

test result: FAILED. 94 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
