*** crates/ax-detect/src/ctx.rs:102:5: replace scan_all -> bool with false

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace scan_all -> bool with false
@@ -94,23 +94,17 @@
             );
         }
     }
 }
 
 /// Scans every numeric column, returning whether any phase anywhere was
 /// assessed (so the caller can report honest absence otherwise).
 fn scan_all(det: &SeasonalDetector, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) -> bool {
-    let mut assessed = false;
-    for col in &rs.columns {
-        if col.ty.is_numeric() {
-            assessed |= det.scan_column(col, cfg, out);
-        }
-    }
-    assessed
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use ax_core::Value;
 
     fn weekly(cfg_period: usize) -> DetectConfig {

---- ctx::tests::period_two_is_assessed_not_absent stdout ----

thread 'ctx::tests::period_two_is_assessed_not_absent' (1878712) panicked at crates/ax-detect/src/ctx.rs:186:9:
period 2 must be assessed

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1878710) panicked at crates/ax-detect/src/ctx.rs:154:9:
it ran; not absent

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1878713) panicked at crates/ax-detect/src/ctx.rs:199:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::period_two_is_assessed_not_absent
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
