*** crates/ax-detect/src/ctx.rs:105:22: replace |= with &= in scan_all

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace |= with &= in scan_all
@@ -97,17 +97,17 @@
 }
 
 /// Scans every numeric column, returning whether any phase anywhere was
 /// assessed (so the caller can report honest absence otherwise).
 fn scan_all(det: &SeasonalDetector, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) -> bool {
     let mut assessed = false;
     for col in &rs.columns {
         if col.ty.is_numeric() {
-            assessed |= det.scan_column(col, cfg, out);
+            assessed &= /* ~ changed by cargo-mutants ~ */ det.scan_column(col, cfg, out);
         }
     }
     assessed
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1879115) panicked at crates/ax-detect/src/ctx.rs:160:9:
it ran; not absent

---- ctx::tests::period_two_is_assessed_not_absent stdout ----

thread 'ctx::tests::period_two_is_assessed_not_absent' (1879117) panicked at crates/ax-detect/src/ctx.rs:192:9:
period 2 must be assessed

failures:
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::period_two_is_assessed_not_absent

test result: FAILED. 95 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
