*** crates/ax-detect/src/ctx.rs:24:9: replace SeasonalDetector::scan_column -> bool with false

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace SeasonalDetector::scan_column -> bool with false
@@ -16,60 +16,17 @@
 
 #[derive(Debug, Default, Clone)]
 pub struct SeasonalDetector;
 
 impl SeasonalDetector {
     /// Scans one column's phases, returning whether any phase had enough data to
     /// be assessed.
     fn scan_column(&self, col: &Column, cfg: &DetectConfig, out: &mut Report) -> bool {
-        let p = cfg.ctx_period;
-        let mut assessed = false;
-        for phase in 0..p {
-            // Collect (row, value) for this phase, in row order.
-            let members: Vec<(usize, f64)> = col
-                .cells
-                .iter()
-                .enumerate()
-                .skip(phase)
-                .step_by(p)
-                .filter_map(|(row, cell)| {
-                    cell.as_f64().filter(|v| v.is_finite()).map(|v| (row, v))
-                })
-                .collect();
-            if members.len() < cfg.ctx_min_per_phase {
-                continue;
-            }
-            let values: Vec<f64> = members.iter().map(|(_, v)| *v).collect();
-            let Some((center, scale, k)) = robustz::center_scale(&values) else {
-                continue;
-            };
-            assessed = true;
-            for (row, v) in members {
-                let modz = robustz::score(v, center, scale, k);
-                if modz <= cfg.ctx_threshold {
-                    continue;
-                }
-                out.push(Finding::new(
-                    self.id(),
-                    AnomalyClass::Contextual,
-                    Handle::Cell {
-                        column: col.name.clone(),
-                        row,
-                    },
-                    robustz::confidence(modz, cfg.ctx_threshold),
-                    modz,
-                    format!(
-                        "{} = {v:.6} at row {row} (phase {phase}/{p}): modified z-score {modz:.3} within its seasonal subseries exceeds {:.3}",
-                        col.name, cfg.ctx_threshold
-                    ),
-                ));
-            }
-        }
-        assessed
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Detector for SeasonalDetector {
     fn id(&self) -> &'static str {
         "ctx.seasonal"
     }
     fn class(&self) -> AnomalyClass {

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1873361) panicked at crates/ax-detect/src/ctx.rs:117:9:
it ran; not absent

---- ctx::tests::period_two_is_assessed_not_absent stdout ----

thread 'ctx::tests::period_two_is_assessed_not_absent' (1873363) panicked at crates/ax-detect/src/ctx.rs:149:9:
period 2 must be assessed

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1873364) panicked at crates/ax-detect/src/ctx.rs:162:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::period_two_is_assessed_not_absent
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
