*** crates/ax-detect/src/ctx.rs:38:30: replace < with == in SeasonalDetector::scan_column

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace < with == in SeasonalDetector::scan_column
@@ -30,17 +30,17 @@
                 .iter()
                 .enumerate()
                 .skip(phase)
                 .step_by(p)
                 .filter_map(|(row, cell)| {
                     cell.as_f64().filter(|v| v.is_finite()).map(|v| (row, v))
                 })
                 .collect();
-            if members.len() < cfg.ctx_min_per_phase {
+            if members.len() == /* ~ changed by cargo-mutants ~ */ cfg.ctx_min_per_phase {
                 continue;
             }
             let values: Vec<f64> = members.iter().map(|(_, v)| *v).collect();
             let Some((center, scale, k)) = robustz::center_scale(&values) else {
                 continue;
             };
             assessed = true;
             for (row, v) in members {

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1873769) panicked at crates/ax-detect/src/ctx.rs:205:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    ctx::tests::phase_with_exactly_min_members_is_assessed

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
