*** crates/ax-detect/src/ctx.rs:38:30: replace < with > in SeasonalDetector::scan_column

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace < with > in SeasonalDetector::scan_column
@@ -30,17 +30,17 @@
                 .iter()
                 .enumerate()
                 .skip(phase)
                 .step_by(p)
                 .filter_map(|(row, cell)| {
                     cell.as_f64().filter(|v| v.is_finite()).map(|v| (row, v))
                 })
                 .collect();
-            if members.len() < cfg.ctx_min_per_phase {
+            if members.len() > /* ~ changed by cargo-mutants ~ */ cfg.ctx_min_per_phase {
                 continue;
             }
             let values: Vec<f64> = members.iter().map(|(_, v)| *v).collect();
             let Some((center, scale, k)) = robustz::center_scale(&values) else {
                 continue;
             };
             assessed = true;
             for (row, v) in members {

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1874178) panicked at crates/ax-detect/src/ctx.rs:160:9:
it ran; not absent

---- ctx::tests::period_two_is_assessed_not_absent stdout ----

thread 'ctx::tests::period_two_is_assessed_not_absent' (1874180) panicked at crates/ax-detect/src/ctx.rs:192:9:
period 2 must be assessed

---- ctx::tests::value_anomalous_only_in_context_is_flagged stdout ----

thread 'ctx::tests::value_anomalous_only_in_context_is_flagged' (1874182) panicked at crates/ax-detect/src/ctx.rs:170:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::period_two_is_assessed_not_absent
    ctx::tests::value_anomalous_only_in_context_is_flagged

test result: FAILED. 94 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
