*** crates/ax-detect/src/ctx.rs:48:25: replace <= with > in SeasonalDetector::scan_column

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace <= with > in SeasonalDetector::scan_column
@@ -40,17 +40,17 @@
             }
             let values: Vec<f64> = members.iter().map(|(_, v)| *v).collect();
             let Some((center, scale, k)) = robustz::center_scale(&values) else {
                 continue;
             };
             assessed = true;
             for (row, v) in members {
                 let modz = robustz::score(v, center, scale, k);
-                if modz <= cfg.ctx_threshold {
+                if modz > /* ~ changed by cargo-mutants ~ */ cfg.ctx_threshold {
                     continue;
                 }
                 out.push(Finding::new(
                     self.id(),
                     AnomalyClass::Contextual,
                     Handle::Cell {
                         column: col.name.clone(),
                         row,

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1874988) panicked at crates/ax-detect/src/ctx.rs:159:9:
tidy seasonal data has no contextual outlier

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1874991) panicked at crates/ax-detect/src/ctx.rs:205:9:
assertion `left == right` failed
  left: 27
 right: 1

---- ctx::tests::value_anomalous_only_in_context_is_flagged stdout ----

thread 'ctx::tests::value_anomalous_only_in_context_is_flagged' (1874992) panicked at crates/ax-detect/src/ctx.rs:170:9:
assertion `left == right` failed
  left: 34
 right: 1

failures:
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged

test result: FAILED. 94 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
