*** crates/ax-detect/src/ctx.rs:73:9: replace <impl Detector for SeasonalDetector>::id -> &'static str with ""

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace <impl Detector for SeasonalDetector>::id -> &'static str with ""
@@ -65,17 +65,17 @@
             }
         }
         assessed
     }
 }
 
 impl Detector for SeasonalDetector {
     fn id(&self) -> &'static str {
-        "ctx.seasonal"
+        "" /* ~ changed by cargo-mutants ~ */
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Contextual
     }
     fn detect(&self, ctx: &ScanContext, cfg: &DetectConfig, out: &mut Report) {
         if cfg.ctx_period < 2 {
             out.mark_absent(
                 self.id(),

---- ctx::tests::absent_without_a_period stdout ----

thread 'ctx::tests::absent_without_a_period' (1875394) panicked at crates/ax-detect/src/ctx.rs:153:9:
assertion `left == right` failed
  left: ""
 right: "ctx.seasonal"

---- tests::registry_registers_the_default_detector_set stdout ----

thread 'tests::registry_registers_the_default_detector_set' (1875474) panicked at crates/ax-detect/src/lib.rs:183:9:
assertion `left == right` failed
  left: ["point.modz", "struct.schema", "dist.ks", "dist.psi", "dist.chi2", "mv.mahalanobis", "", "coll.cusum"]
 right: ["point.modz", "struct.schema", "dist.ks", "dist.psi", "dist.chi2", "mv.mahalanobis", "ctx.seasonal", "coll.cusum"]

failures:
    ctx::tests::absent_without_a_period
    tests::registry_registers_the_default_detector_set

test result: FAILED. 95 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
