*** crates/ax-detect/src/ctx.rs:79:27: replace < with == in <impl Detector for SeasonalDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace < with == in <impl Detector for SeasonalDetector>::detect
@@ -71,17 +71,17 @@
 impl Detector for SeasonalDetector {
     fn id(&self) -> &'static str {
         "ctx.seasonal"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Contextual
     }
     fn detect(&self, ctx: &ScanContext, cfg: &DetectConfig, out: &mut Report) {
-        if cfg.ctx_period < 2 {
+        if cfg.ctx_period == /* ~ changed by cargo-mutants ~ */ 2 {
             out.mark_absent(
                 self.id(),
                 "contextual detection needs a declared period ≥ 2 (pass --period N)",
             );
             return;
         }
         let assessed = scan_all(self, ctx.current, cfg, out);
         if !assessed {

---- ctx::tests::period_two_is_assessed_not_absent stdout ----

thread 'ctx::tests::period_two_is_assessed_not_absent' (1876695) panicked at crates/ax-detect/src/ctx.rs:192:9:
period 2 must be assessed

failures:
    ctx::tests::period_two_is_assessed_not_absent

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
