*** crates/ax-detect/src/ctx.rs:79:27: replace < with > in <impl Detector for SeasonalDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace < with > in <impl Detector for SeasonalDetector>::detect
@@ -71,17 +71,17 @@
 impl Detector for SeasonalDetector {
     fn id(&self) -> &'static str {
         "ctx.seasonal"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Contextual
     }
     fn detect(&self, ctx: &ScanContext, cfg: &DetectConfig, out: &mut Report) {
-        if cfg.ctx_period < 2 {
+        if cfg.ctx_period > /* ~ changed by cargo-mutants ~ */ 2 {
             out.mark_absent(
                 self.id(),
                 "contextual detection needs a declared period ≥ 2 (pass --period N)",
             );
             return;
         }
         let assessed = scan_all(self, ctx.current, cfg, out);
         if !assessed {

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1877098) panicked at crates/ax-detect/src/ctx.rs:160:9:
it ran; not absent

---- ctx::tests::absent_when_no_phase_has_enough_data stdout ----

thread 'ctx::tests::absent_when_no_phase_has_enough_data' (1877096) panicked at crates/ax-detect/src/ctx.rs:181:9:
assertion failed: report.absent[0].reason.contains("phase")

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1877101) panicked at crates/ax-detect/src/ctx.rs:205:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    ctx::tests::absent_when_no_phase_has_enough_data
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
