*** crates/ax-detect/src/ctx.rs:79:9: replace <impl Detector for SeasonalDetector>::detect with ()

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ replace <impl Detector for SeasonalDetector>::detect with ()
@@ -71,33 +71,17 @@
 impl Detector for SeasonalDetector {
     fn id(&self) -> &'static str {
         "ctx.seasonal"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Contextual
     }
     fn detect(&self, ctx: &ScanContext, cfg: &DetectConfig, out: &mut Report) {
-        if cfg.ctx_period < 2 {
-            out.mark_absent(
-                self.id(),
-                "contextual detection needs a declared period ≥ 2 (pass --period N)",
-            );
-            return;
-        }
-        let assessed = scan_all(self, ctx.current, cfg, out);
-        if !assessed {
-            out.mark_absent(
-                self.id(),
-                format!(
-                    "no numeric column has ≥ {} values in any phase of period {}",
-                    cfg.ctx_min_per_phase, cfg.ctx_period
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Scans every numeric column, returning whether any phase anywhere was
 /// assessed (so the caller can report honest absence otherwise).
 fn scan_all(det: &SeasonalDetector, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) -> bool {
     let mut assessed = false;
     for col in &rs.columns {

---- ctx::tests::absent_when_no_phase_has_enough_data stdout ----

thread 'ctx::tests::absent_when_no_phase_has_enough_data' (1876278) panicked at crates/ax-detect/src/ctx.rs:164:9:
assertion `left == right` failed
  left: 0
 right: 1

---- ctx::tests::absent_without_a_period stdout ----

thread 'ctx::tests::absent_without_a_period' (1876279) panicked at crates/ax-detect/src/ctx.rs:136:9:
assertion `left == right` failed
  left: 0
 right: 1

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1876283) panicked at crates/ax-detect/src/ctx.rs:189:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    ctx::tests::absent_when_no_phase_has_enough_data
    ctx::tests::absent_without_a_period
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
