*** crates/ax-detect/src/ctx.rs:87:12: delete ! in <impl Detector for SeasonalDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/ctx.rs
+++ delete ! in <impl Detector for SeasonalDetector>::detect
@@ -79,17 +79,17 @@
         if cfg.ctx_period < 2 {
             out.mark_absent(
                 self.id(),
                 "contextual detection needs a declared period ≥ 2 (pass --period N)",
             );
             return;
         }
         let assessed = scan_all(self, ctx.current, cfg, out);
-        if !assessed {
+        if  /* ~ changed by cargo-mutants ~ */assessed {
             out.mark_absent(
                 self.id(),
                 format!(
                     "no numeric column has ≥ {} values in any phase of period {}",
                     cfg.ctx_min_per_phase, cfg.ctx_period
                 ),
             );
         }

---- ctx::tests::absent_when_no_phase_has_enough_data stdout ----

thread 'ctx::tests::absent_when_no_phase_has_enough_data' (1877906) panicked at crates/ax-detect/src/ctx.rs:180:9:
assertion `left == right` failed
  left: 0
 right: 1

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1877908) panicked at crates/ax-detect/src/ctx.rs:160:9:
it ran; not absent

---- ctx::tests::period_two_is_assessed_not_absent stdout ----

thread 'ctx::tests::period_two_is_assessed_not_absent' (1877910) panicked at crates/ax-detect/src/ctx.rs:192:9:
period 2 must be assessed

failures:
    ctx::tests::absent_when_no_phase_has_enough_data
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::period_two_is_assessed_not_absent

test result: FAILED. 94 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
