*** crates/ax-detect/src/point.rs:110:5: replace numeric_cell -> Option<f64> with Some(1.0)

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace numeric_cell -> Option<f64> with Some(1.0)
@@ -102,17 +102,17 @@
             );
         }
     }
 }
 
 /// Finite numeric projection of a single cell (mirrors [`Value::as_f64`] but
 /// drops non-finite values so they never become findings).
 fn numeric_cell(v: &Value) -> Option<f64> {
-    v.as_f64().filter(|x| x.is_finite())
+    Some(1.0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The (absolute) standardized deviation of `x` from `center` at the given
 /// `scale`, multiplied by the consistency constant `k`. Extracted so the exact
 /// arithmetic can be pinned by tests, not just its sign.
 fn modified_score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
     (k * (x - center) / scale).abs()
 }

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (976884) panicked at crates/ax-detect/src/point.rs:229:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (976887) panicked at crates/ax-detect/src/point.rs:166:9:
assertion `left == right` failed
  left: 0
 right: 1

---- point::tests::robust_path_catches_what_sigma_path_misses stdout ----

thread 'point::tests::robust_path_catches_what_sigma_path_misses' (976889) panicked at crates/ax-detect/src/point.rs:240:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses
    point::tests::shift_invariant

test result: FAILED. 11 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
