*** crates/ax-detect/src/point.rs:117:5: replace modified_score -> f64 with -1.0

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace modified_score -> f64 with -1.0
@@ -109,17 +109,17 @@
 fn numeric_cell(v: &Value) -> Option<f64> {
     v.as_f64().filter(|x| x.is_finite())
 }
 
 /// The (absolute) standardized deviation of `x` from `center` at the given
 /// `scale`, multiplied by the consistency constant `k`. Extracted so the exact
 /// arithmetic can be pinned by tests, not just its sign.
 fn modified_score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
-    (k * (x - center) / scale).abs()
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`.
 ///
 /// Logistic in the *excess* deviation `modz − threshold`: at the threshold the
 /// confidence is 0.5 and it rises monotonically toward 1.0. Strictly increasing
 /// in `modz`, which the property tests rely on.
 fn confidence_from_modz(modz: f64, threshold: f64) -> f64 {

---- point::tests::modified_score_exact_arithmetic stdout ----

thread 'point::tests::modified_score_exact_arithmetic' (977699) panicked at crates/ax-detect/src/point.rs:210:9:
assertion `left == right` failed
  left: -1.0
 right: 2.5

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (977698) panicked at crates/ax-detect/src/point.rs:229:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

---- point::tests::robust_path_catches_what_sigma_path_misses stdout ----

thread 'point::tests::robust_path_catches_what_sigma_path_misses' (977703) panicked at crates/ax-detect/src/point.rs:240:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::exactly_min_n_values_is_assessed
    point::tests::modified_score_exact_arithmetic
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses

test result: FAILED. 11 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
