*** crates/ax-detect/src/point.rs:126:23: replace - with / in confidence_from_modz

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace - with / in confidence_from_modz
@@ -118,17 +118,17 @@
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`.
 ///
 /// Logistic in the *excess* deviation `modz − threshold`: at the threshold the
 /// confidence is 0.5 and it rises monotonically toward 1.0. Strictly increasing
 /// in `modz`, which the property tests rely on.
 fn confidence_from_modz(modz: f64, threshold: f64) -> f64 {
-    let excess = modz - threshold;
+    let excess = modz / /* ~ changed by cargo-mutants ~ */ threshold;
     1.0 / (1.0 + (-excess).exp())
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use proptest::prelude::*;

---- point::tests::confidence_is_half_at_threshold stdout ----

thread 'point::tests::confidence_is_half_at_threshold' (980001) panicked at crates/ax-detect/src/point.rs:220:9:
assertion `left == right` failed
  left: 0.7310585786300049
 right: 0.5

failures:
    point::tests::confidence_is_half_at_threshold

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
