*** crates/ax-detect/src/point.rs:126:5: replace confidence_from_modz -> f64 with 0.0

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace confidence_from_modz -> f64 with 0.0
@@ -118,18 +118,17 @@
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`.
 ///
 /// Logistic in the *excess* deviation `modz − threshold`: at the threshold the
 /// confidence is 0.5 and it rises monotonically toward 1.0. Strictly increasing
 /// in `modz`, which the property tests rely on.
 fn confidence_from_modz(modz: f64, threshold: f64) -> f64 {
-    let excess = modz - threshold;
-    1.0 / (1.0 + (-excess).exp())
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use proptest::prelude::*;
 
     fn col(name: &str, xs: &[f64]) -> Column {

---- point::tests::confidence_is_strictly_monotonic stdout ----

thread 'point::tests::confidence_is_strictly_monotonic' (979194) panicked at crates/ax-detect/src/point.rs:252:9:
assertion failed: c1 < c2 && c2 < c3

---- point::tests::confidence_is_half_at_threshold stdout ----

thread 'point::tests::confidence_is_half_at_threshold' (979193) panicked at crates/ax-detect/src/point.rs:219:9:
assertion `left == right` failed
  left: 0.0
 right: 0.5

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (979200) panicked at crates/ax-detect/src/point.rs:170:9:
assertion failed: report.findings[0].confidence > 0.5

failures:
    point::tests::confidence_is_half_at_threshold
    point::tests::confidence_is_strictly_monotonic
    point::tests::obvious_outlier_is_flagged

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
