*** crates/ax-detect/src/point.rs:127:19: delete - in confidence_from_modz

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ delete - in confidence_from_modz
@@ -119,17 +119,17 @@
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`.
 ///
 /// Logistic in the *excess* deviation `modz − threshold`: at the threshold the
 /// confidence is 0.5 and it rises monotonically toward 1.0. Strictly increasing
 /// in `modz`, which the property tests rely on.
 fn confidence_from_modz(modz: f64, threshold: f64) -> f64 {
     let excess = modz - threshold;
-    1.0 / (1.0 + (-excess).exp())
+    1.0 / (1.0 + ( /* ~ changed by cargo-mutants ~ */excess).exp())
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use proptest::prelude::*;
 
     fn col(name: &str, xs: &[f64]) -> Column {

---- point::tests::confidence_is_strictly_monotonic stdout ----

thread 'point::tests::confidence_is_strictly_monotonic' (981024) panicked at crates/ax-detect/src/point.rs:253:9:
assertion failed: c1 < c2 && c2 < c3

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (981030) panicked at crates/ax-detect/src/point.rs:171:9:
assertion failed: report.findings[0].confidence > 0.5

failures:
    point::tests::confidence_is_strictly_monotonic
    point::tests::obvious_outlier_is_flagged

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
