*** crates/ax-detect/src/point.rs:29:9: replace <impl Detector for PointDetector>::id -> &'static str with ""

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace <impl Detector for PointDetector>::id -> &'static str with ""
@@ -21,17 +21,17 @@
 /// comparable to a standard z-score for normal data.
 const MODZ_K: f64 = 0.6745;
 
 #[derive(Debug, Default, Clone)]
 pub struct PointDetector;
 
 impl Detector for PointDetector {
     fn id(&self) -> &'static str {
-        "point.modz"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Point
     }
 
     fn detect(&self, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) {
         let mut applicable = 0usize;

---- point::tests::non_numeric_corpus_marks_absent stdout ----

thread 'point::tests::non_numeric_corpus_marks_absent' (972336) panicked at crates/ax-detect/src/point.rs:196:9:
assertion `left == right` failed
  left: ""
 right: "point.modz"

---- tests::registry_runs_registered_detectors stdout ----

thread 'tests::registry_runs_registered_detectors' (972343) panicked at crates/ax-detect/src/lib.rs:116:9:
assertion `left == right` failed
  left: [""]
 right: ["point.modz"]

failures:
    point::tests::non_numeric_corpus_marks_absent
    tests::registry_runs_registered_detectors

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
