*** crates/ax-detect/src/point.rs:37:9: replace <impl Detector for PointDetector>::detect with ()

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace <impl Detector for PointDetector>::detect with ()
@@ -29,37 +29,17 @@
         "point.modz"
     }
 
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Point
     }
 
     fn detect(&self, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) {
-        let mut applicable = 0usize;
-        for col in &rs.columns {
-            if !col.ty.is_numeric() {
-                continue;
-            }
-            let xs = col.numeric();
-            if xs.len() < cfg.point_min_n {
-                continue;
-            }
-            applicable += 1;
-            self.scan_column(col, &xs, cfg, out);
-        }
-        if applicable == 0 {
-            out.mark_absent(
-                self.id(),
-                format!(
-                    "no numeric column with at least {} finite values",
-                    cfg.point_min_n
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl PointDetector {
     fn scan_column(&self, col: &Column, xs: &[f64], cfg: &DetectConfig, out: &mut Report) {
         let Some(center) = det::median(xs) else { return };
         let mad = det::mad(xs).unwrap_or(0.0);

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (972748) panicked at crates/ax-detect/src/point.rs:209:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

---- point::tests::non_numeric_corpus_marks_absent stdout ----

thread 'point::tests::non_numeric_corpus_marks_absent' (972750) panicked at crates/ax-detect/src/point.rs:175:9:
assertion `left == right` failed
  left: 0
 right: 1

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (972751) panicked at crates/ax-detect/src/point.rs:146:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::exactly_min_n_values_is_assessed
    point::tests::non_numeric_corpus_marks_absent
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses
    point::tests::too_few_values_marks_absent

test result: FAILED. 10 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
