*** crates/ax-detect/src/point.rs:39:16: delete ! in <impl Detector for PointDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ delete ! in <impl Detector for PointDetector>::detect
@@ -31,17 +31,17 @@
 
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Point
     }
 
     fn detect(&self, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) {
         let mut applicable = 0usize;
         for col in &rs.columns {
-            if !col.ty.is_numeric() {
+            if  /* ~ changed by cargo-mutants ~ */col.ty.is_numeric() {
                 continue;
             }
             let xs = col.numeric();
             if xs.len() < cfg.point_min_n {
                 continue;
             }
             applicable += 1;
             self.scan_column(col, &xs, cfg, out);

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (972949) panicked at crates/ax-detect/src/point.rs:179:9:
assertion failed: report.absent.is_empty()

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (972951) panicked at crates/ax-detect/src/point.rs:229:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (972954) panicked at crates/ax-detect/src/point.rs:166:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::constant_column_has_no_findings
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses

test result: FAILED. 11 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
