*** crates/ax-detect/src/point.rs:43:25: replace < with > in <impl Detector for PointDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace < with > in <impl Detector for PointDetector>::detect
@@ -35,17 +35,17 @@
 
     fn detect(&self, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) {
         let mut applicable = 0usize;
         for col in &rs.columns {
             if !col.ty.is_numeric() {
                 continue;
             }
             let xs = col.numeric();
-            if xs.len() < cfg.point_min_n {
+            if xs.len() > /* ~ changed by cargo-mutants ~ */ cfg.point_min_n {
                 continue;
             }
             applicable += 1;
             self.scan_column(col, &xs, cfg, out);
         }
         if applicable == 0 {
             out.mark_absent(
                 self.id(),

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (973355) panicked at crates/ax-detect/src/point.rs:179:9:
assertion failed: report.absent.is_empty()

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (973360) panicked at crates/ax-detect/src/point.rs:166:9:
assertion `left == right` failed
  left: 0
 right: 1

---- point::tests::robust_path_catches_what_sigma_path_misses stdout ----

thread 'point::tests::robust_path_catches_what_sigma_path_misses' (973362) panicked at crates/ax-detect/src/point.rs:240:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::constant_column_has_no_findings
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses
    point::tests::too_few_values_marks_absent

test result: FAILED. 11 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
