*** crates/ax-detect/src/point.rs:43:25: replace < with <= in <impl Detector for PointDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace < with <= in <impl Detector for PointDetector>::detect
@@ -35,17 +35,17 @@
 
     fn detect(&self, rs: &RecordSet, cfg: &DetectConfig, out: &mut Report) {
         let mut applicable = 0usize;
         for col in &rs.columns {
             if !col.ty.is_numeric() {
                 continue;
             }
             let xs = col.numeric();
-            if xs.len() < cfg.point_min_n {
+            if xs.len() <= /* ~ changed by cargo-mutants ~ */ cfg.point_min_n {
                 continue;
             }
             applicable += 1;
             self.scan_column(col, &xs, cfg, out);
         }
         if applicable == 0 {
             out.mark_absent(
                 self.id(),

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (973564) panicked at crates/ax-detect/src/point.rs:229:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

failures:
    point::tests::exactly_min_n_values_is_assessed

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
