*** crates/ax-detect/src/point.rs:46:24: replace += with -= in <impl Detector for PointDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace += with -= in <impl Detector for PointDetector>::detect
@@ -38,17 +38,17 @@
         for col in &rs.columns {
             if !col.ty.is_numeric() {
                 continue;
             }
             let xs = col.numeric();
             if xs.len() < cfg.point_min_n {
                 continue;
             }
-            applicable += 1;
+            applicable -= /* ~ changed by cargo-mutants ~ */ 1;
             self.scan_column(col, &xs, cfg, out);
         }
         if applicable == 0 {
             out.mark_absent(
                 self.id(),
                 format!(
                     "no numeric column with at least {} finite values",
                     cfg.point_min_n

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (973771) panicked at crates/ax-detect/src/point.rs:46:13:
attempt to subtract with overflow

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (973774) panicked at crates/ax-detect/src/point.rs:46:13:
attempt to subtract with overflow

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (973769) panicked at crates/ax-detect/src/point.rs:46:13:
attempt to subtract with overflow

failures:
    point::tests::constant_column_has_no_findings
    point::tests::deterministic
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::permutation_invariant_values
    point::tests::robust_path_catches_what_sigma_path_misses
    point::tests::scale_invariant
    point::tests::shift_invariant

test result: FAILED. 7 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
