*** crates/ax-detect/src/point.rs:46:24: replace += with *= in <impl Detector for PointDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace += with *= in <impl Detector for PointDetector>::detect
@@ -38,17 +38,17 @@
         for col in &rs.columns {
             if !col.ty.is_numeric() {
                 continue;
             }
             let xs = col.numeric();
             if xs.len() < cfg.point_min_n {
                 continue;
             }
-            applicable += 1;
+            applicable *= /* ~ changed by cargo-mutants ~ */ 1;
             self.scan_column(col, &xs, cfg, out);
         }
         if applicable == 0 {
             out.mark_absent(
                 self.id(),
                 format!(
                     "no numeric column with at least {} finite values",
                     cfg.point_min_n

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (973972) panicked at crates/ax-detect/src/point.rs:179:9:
assertion failed: report.absent.is_empty()

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (973974) panicked at crates/ax-detect/src/point.rs:230:9:
8 values is enough to assess

failures:
    point::tests::constant_column_has_no_findings
    point::tests::exactly_min_n_values_is_assessed

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
