*** crates/ax-detect/src/point.rs:49:23: replace == with != in <impl Detector for PointDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace == with != in <impl Detector for PointDetector>::detect
@@ -41,17 +41,17 @@
             }
             let xs = col.numeric();
             if xs.len() < cfg.point_min_n {
                 continue;
             }
             applicable += 1;
             self.scan_column(col, &xs, cfg, out);
         }
-        if applicable == 0 {
+        if applicable != /* ~ changed by cargo-mutants ~ */ 0 {
             out.mark_absent(
                 self.id(),
                 format!(
                     "no numeric column with at least {} finite values",
                     cfg.point_min_n
                 ),
             );
         }

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (974175) panicked at crates/ax-detect/src/point.rs:179:9:
assertion failed: report.absent.is_empty()

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (974177) panicked at crates/ax-detect/src/point.rs:230:9:
8 values is enough to assess

---- point::tests::non_numeric_corpus_marks_absent stdout ----

thread 'point::tests::non_numeric_corpus_marks_absent' (974179) panicked at crates/ax-detect/src/point.rs:195:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::constant_column_has_no_findings
    point::tests::exactly_min_n_values_is_assessed
    point::tests::non_numeric_corpus_marks_absent
    point::tests::too_few_values_marks_absent

test result: FAILED. 11 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
