*** crates/ax-detect/src/point.rs:63:9: replace PointDetector::scan_column with ()

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace PointDetector::scan_column with ()
@@ -55,57 +55,17 @@
                 ),
             );
         }
     }
 }
 
 impl PointDetector {
     fn scan_column(&self, col: &Column, xs: &[f64], cfg: &DetectConfig, out: &mut Report) {
-        let Some(center) = det::median(xs) else { return };
-        let mad = det::mad(xs).unwrap_or(0.0);
-
-        // Choose a robust scale; fall back to σ when MAD collapses.
-        let (scale, k) = if mad > 0.0 {
-            (mad, MODZ_K)
-        } else {
-            match det::std_dev(xs) {
-                Some(sd) if sd > 0.0 => (sd, 1.0),
-                // Constant column: no point can deviate. Honest non-finding.
-                _ => return,
-            }
-        };
-
-        // Iterate the original cells so row indices in handles are correct.
-        for (row, cell) in col.cells.iter().enumerate() {
-            let Some(x) = numeric_cell(cell) else { continue };
-            let modz = modified_score(x, center, scale, k);
-            if modz <= cfg.point_threshold {
-                continue;
-            }
-            let confidence = confidence_from_modz(modz, cfg.point_threshold);
-            let reason = format!(
-                "{} = {:.6}: modified z-score {:.3} exceeds {:.3} (center={:.6}, scale={:.6})",
-                col.name, x, modz, cfg.point_threshold, center, scale
-            );
-            out.push(
-                Finding::new(
-                    self.id(),
-                    AnomalyClass::Point,
-                    Handle::Cell {
-                        column: col.name.clone(),
-                        row,
-                    },
-                    confidence,
-                    modz,
-                    reason,
-                )
-                .with_col_type(col.ty),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Finite numeric projection of a single cell (mirrors [`Value::as_f64`] but
 /// drops non-finite values so they never become findings).
 fn numeric_cell(v: &Value) -> Option<f64> {
     v.as_f64().filter(|x| x.is_finite())
 }

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (974369) panicked at crates/ax-detect/src/point.rs:189:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (974372) panicked at crates/ax-detect/src/point.rs:126:9:
assertion `left == right` failed
  left: 0
 right: 1

---- point::tests::robust_path_catches_what_sigma_path_misses stdout ----

thread 'point::tests::robust_path_catches_what_sigma_path_misses' (974374) panicked at crates/ax-detect/src/point.rs:200:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
