*** crates/ax-detect/src/point.rs:67:33: replace > with < in PointDetector::scan_column

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace > with < in PointDetector::scan_column
@@ -59,17 +59,17 @@
 }
 
 impl PointDetector {
     fn scan_column(&self, col: &Column, xs: &[f64], cfg: &DetectConfig, out: &mut Report) {
         let Some(center) = det::median(xs) else { return };
         let mad = det::mad(xs).unwrap_or(0.0);
 
         // Choose a robust scale; fall back to σ when MAD collapses.
-        let (scale, k) = if mad > 0.0 {
+        let (scale, k) = if mad < /* ~ changed by cargo-mutants ~ */ 0.0 {
             (mad, MODZ_K)
         } else {
             match det::std_dev(xs) {
                 Some(sd) if sd > 0.0 => (sd, 1.0),
                 // Constant column: no point can deviate. Honest non-finding.
                 _ => return,
             }
         };

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (974782) panicked at crates/ax-detect/src/point.rs:229:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

---- point::tests::robust_path_catches_what_sigma_path_misses stdout ----

thread 'point::tests::robust_path_catches_what_sigma_path_misses' (974787) panicked at crates/ax-detect/src/point.rs:240:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::exactly_min_n_values_is_assessed
    point::tests::robust_path_catches_what_sigma_path_misses

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
