*** crates/ax-detect/src/point.rs:67:33: replace > with >= in PointDetector::scan_column

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace > with >= in PointDetector::scan_column
@@ -59,17 +59,17 @@
 }
 
 impl PointDetector {
     fn scan_column(&self, col: &Column, xs: &[f64], cfg: &DetectConfig, out: &mut Report) {
         let Some(center) = det::median(xs) else { return };
         let mad = det::mad(xs).unwrap_or(0.0);
 
         // Choose a robust scale; fall back to σ when MAD collapses.
-        let (scale, k) = if mad > 0.0 {
+        let (scale, k) = if mad >= /* ~ changed by cargo-mutants ~ */ 0.0 {
             (mad, MODZ_K)
         } else {
             match det::std_dev(xs) {
                 Some(sd) if sd > 0.0 => (sd, 1.0),
                 // Constant column: no point can deviate. Honest non-finding.
                 _ => return,
             }
         };

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (974983) panicked at crates/ax-detect/src/point.rs:177:9:
assertion failed: report.is_clean()

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (974988) panicked at crates/ax-detect/src/point.rs:166:9:
assertion `left == right` failed
  left: 31
 right: 1

failures:
    point::tests::constant_column_has_no_findings
    point::tests::obvious_outlier_is_flagged

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
