*** crates/ax-detect/src/point.rs:71:29: replace match guard sd > 0.0 with false in PointDetector::scan_column

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace match guard sd > 0.0 with false in PointDetector::scan_column
@@ -63,17 +63,17 @@
         let Some(center) = det::median(xs) else { return };
         let mad = det::mad(xs).unwrap_or(0.0);
 
         // Choose a robust scale; fall back to σ when MAD collapses.
         let (scale, k) = if mad > 0.0 {
             (mad, MODZ_K)
         } else {
             match det::std_dev(xs) {
-                Some(sd) if sd > 0.0 => (sd, 1.0),
+                Some(sd) if false /* ~ changed by cargo-mutants ~ */ => (sd, 1.0),
                 // Constant column: no point can deviate. Honest non-finding.
                 _ => return,
             }
         };
 
         // Iterate the original cells so row indices in handles are correct.
         for (row, cell) in col.cells.iter().enumerate() {
             let Some(x) = numeric_cell(cell) else { continue };

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (975395) panicked at crates/ax-detect/src/point.rs:166:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    point::tests::obvious_outlier_is_flagged

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
