*** crates/ax-detect/src/point.rs:71:32: replace > with >= in PointDetector::scan_column

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace > with >= in PointDetector::scan_column
@@ -63,17 +63,17 @@
         let Some(center) = det::median(xs) else { return };
         let mad = det::mad(xs).unwrap_or(0.0);
 
         // Choose a robust scale; fall back to σ when MAD collapses.
         let (scale, k) = if mad > 0.0 {
             (mad, MODZ_K)
         } else {
             match det::std_dev(xs) {
-                Some(sd) if sd > 0.0 => (sd, 1.0),
+                Some(sd) if sd >= /* ~ changed by cargo-mutants ~ */ 0.0 => (sd, 1.0),
                 // Constant column: no point can deviate. Honest non-finding.
                 _ => return,
             }
         };
 
         // Iterate the original cells so row indices in handles are correct.
         for (row, cell) in col.cells.iter().enumerate() {
             let Some(x) = numeric_cell(cell) else { continue };

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (976073) panicked at crates/ax-detect/src/point.rs:177:9:
assertion failed: report.is_clean()

failures:
    point::tests::constant_column_has_no_findings

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
