*** crates/ax-detect/src/point.rs:81:21: replace <= with > in PointDetector::scan_column

*** mutation diff:
--- crates/ax-detect/src/point.rs
+++ replace <= with > in PointDetector::scan_column
@@ -73,17 +73,17 @@
                 _ => return,
             }
         };
 
         // Iterate the original cells so row indices in handles are correct.
         for (row, cell) in col.cells.iter().enumerate() {
             let Some(x) = numeric_cell(cell) else { continue };
             let modz = modified_score(x, center, scale, k);
-            if modz <= cfg.point_threshold {
+            if modz > /* ~ changed by cargo-mutants ~ */ cfg.point_threshold {
                 continue;
             }
             let confidence = confidence_from_modz(modz, cfg.point_threshold);
             let reason = format!(
                 "{} = {:.6}: modified z-score {:.3} exceeds {:.3} (center={:.6}, scale={:.6})",
                 col.name, x, modz, cfg.point_threshold, center, scale
             );
             out.push(

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (976278) panicked at crates/ax-detect/src/point.rs:229:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 7
 right: 1

---- point::tests::robust_path_catches_what_sigma_path_misses stdout ----

thread 'point::tests::robust_path_catches_what_sigma_path_misses' (976283) panicked at crates/ax-detect/src/point.rs:240:9:
assertion `left == right` failed
  left: 8
 right: 1

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (976281) panicked at crates/ax-detect/src/point.rs:166:9:
assertion `left == right` failed
  left: 30
 right: 1

failures:
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
