*** crates/ax-detect/src/robustz.rs:20:5: replace center_scale -> Option<(f64, f64, f64)> with Some((1.0, 0.0, 1.0))

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace center_scale -> Option<(f64, f64, f64)> with Some((1.0, 0.0, 1.0))
@@ -12,25 +12,17 @@
 /// Iglewicz–Hoaglin constant `1/Φ⁻¹(0.75)`, making the MAD-based score
 /// comparable to a standard z-score for normal data.
 pub const MODZ_K: f64 = 0.6745;
 
 /// Robust `(center, scale, k)` for a sample: median + MAD (with constant `k`),
 /// falling back to mean-relative σ (with `k = 1`) when MAD collapses. `None`
 /// for an empty sample or one with no spread at all.
 pub fn center_scale(xs: &[f64]) -> Option<(f64, f64, f64)> {
-    let center = det::median(xs)?;
-    let mad = det::mad(xs).unwrap_or(0.0);
-    if mad > 0.0 {
-        return Some((center, mad, MODZ_K));
-    }
-    match det::std_dev(xs) {
-        Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
-        _ => None,
-    }
+    Some((1.0, 0.0, 1.0)) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Absolute standardized deviation `|k·(x − center)/scale|`. Extracted so the
 /// exact arithmetic (not just its sign) is pinned by tests.
 pub fn score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
     (k * (x - center) / scale).abs()
 }

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1884170) panicked at crates/ax-detect/src/ctx.rs:159:9:
tidy seasonal data has no contextual outlier

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1884173) panicked at crates/ax-detect/src/ctx.rs:205:9:
assertion `left == right` failed
  left: 28
 right: 1

---- ctx::tests::value_anomalous_only_in_context_is_flagged stdout ----

thread 'ctx::tests::value_anomalous_only_in_context_is_flagged' (1884174) panicked at crates/ax-detect/src/ctx.rs:170:9:
assertion `left == right` failed
  left: 35
 right: 1

failures:
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged
    point::tests::constant_column_has_no_findings
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses
    robustz::tests::center_scale_prefers_mad_then_sigma_then_none
    tests::single_corpus_clean_numeric_has_no_point_findings

test result: FAILED. 88 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
