*** crates/ax-detect/src/robustz.rs:22:12: replace > with == in center_scale

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace > with == in center_scale
@@ -14,17 +14,17 @@
 pub const MODZ_K: f64 = 0.6745;
 
 /// Robust `(center, scale, k)` for a sample: median + MAD (with constant `k`),
 /// falling back to mean-relative σ (with `k = 1`) when MAD collapses. `None`
 /// for an empty sample or one with no spread at all.
 pub fn center_scale(xs: &[f64]) -> Option<(f64, f64, f64)> {
     let center = det::median(xs)?;
     let mad = det::mad(xs).unwrap_or(0.0);
-    if mad > 0.0 {
+    if mad == /* ~ changed by cargo-mutants ~ */ 0.0 {
         return Some((center, mad, MODZ_K));
     }
     match det::std_dev(xs) {
         Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
         _ => None,
     }
 }

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1891236) panicked at crates/ax-detect/src/ctx.rs:205:9:
assertion `left == right` failed
  left: 0
 right: 1

---- ctx::tests::value_anomalous_only_in_context_is_flagged stdout ----

thread 'ctx::tests::value_anomalous_only_in_context_is_flagged' (1891237) panicked at crates/ax-detect/src/ctx.rs:170:9:
assertion `left == right` failed
  left: 0
 right: 1

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (1891295) panicked at crates/ax-detect/src/point.rs:190:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

failures:
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged
    point::tests::constant_column_has_no_findings
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses
    robustz::tests::center_scale_prefers_mad_then_sigma_then_none

test result: FAILED. 90 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
