*** crates/ax-detect/src/robustz.rs:22:12: replace > with >= in center_scale

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace > with >= in center_scale
@@ -14,17 +14,17 @@
 pub const MODZ_K: f64 = 0.6745;
 
 /// Robust `(center, scale, k)` for a sample: median + MAD (with constant `k`),
 /// falling back to mean-relative σ (with `k = 1`) when MAD collapses. `None`
 /// for an empty sample or one with no spread at all.
 pub fn center_scale(xs: &[f64]) -> Option<(f64, f64, f64)> {
     let center = det::median(xs)?;
     let mad = det::mad(xs).unwrap_or(0.0);
-    if mad > 0.0 {
+    if mad >= /* ~ changed by cargo-mutants ~ */ 0.0 {
         return Some((center, mad, MODZ_K));
     }
     match det::std_dev(xs) {
         Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
         _ => None,
     }
 }

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (1892103) panicked at crates/ax-detect/src/point.rs:152:9:
assertion failed: report.is_clean()

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (1892107) panicked at crates/ax-detect/src/point.rs:141:9:
assertion `left == right` failed
  left: 31
 right: 1

---- robustz::tests::center_scale_prefers_mad_then_sigma_then_none stdout ----

thread 'robustz::tests::center_scale_prefers_mad_then_sigma_then_none' (1892113) panicked at crates/ax-detect/src/robustz.rs:72:9:
assertion `left == right` failed
  left: 0.6745
 right: 1.0

failures:
    point::tests::constant_column_has_no_findings
    point::tests::obvious_outlier_is_flagged
    robustz::tests::center_scale_prefers_mad_then_sigma_then_none

test result: FAILED. 94 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
