*** crates/ax-detect/src/robustz.rs:26:21: replace match guard sd > 0.0 with true in center_scale

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace match guard sd > 0.0 with true in center_scale
@@ -18,17 +18,17 @@
 /// for an empty sample or one with no spread at all.
 pub fn center_scale(xs: &[f64]) -> Option<(f64, f64, f64)> {
     let center = det::median(xs)?;
     let mad = det::mad(xs).unwrap_or(0.0);
     if mad > 0.0 {
         return Some((center, mad, MODZ_K));
     }
     match det::std_dev(xs) {
-        Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
+        Some(sd) if true /* ~ changed by cargo-mutants ~ */ => Some((center, sd, 1.0)),
         _ => None,
     }
 }
 
 /// Absolute standardized deviation `|k·(x − center)/scale|`. Extracted so the
 /// exact arithmetic (not just its sign) is pinned by tests.
 pub fn score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
     (k * (x - center) / scale).abs()

---- point::tests::constant_column_has_no_findings stdout ----

thread 'point::tests::constant_column_has_no_findings' (1892515) panicked at crates/ax-detect/src/point.rs:152:9:
assertion failed: report.is_clean()

---- robustz::tests::center_scale_prefers_mad_then_sigma_then_none stdout ----

thread 'robustz::tests::center_scale_prefers_mad_then_sigma_then_none' (1892525) panicked at crates/ax-detect/src/robustz.rs:75:9:
assertion `left == right` failed
  left: Some((7.0, 0.0, 1.0))
 right: None

failures:
    point::tests::constant_column_has_no_findings
    robustz::tests::center_scale_prefers_mad_then_sigma_then_none

test result: FAILED. 95 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
