*** crates/ax-detect/src/robustz.rs:34:13: replace - with / in score

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace - with / in score
@@ -26,17 +26,17 @@
         Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
         _ => None,
     }
 }
 
 /// Absolute standardized deviation `|k·(x − center)/scale|`. Extracted so the
 /// exact arithmetic (not just its sign) is pinned by tests.
 pub fn score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
-    (k * (x - center) / scale).abs()
+    (k * (x / /* ~ changed by cargo-mutants ~ */ center) / scale).abs()
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`: logistic in
 /// the excess `modz − threshold`, so `modz == threshold` gives 0.5 and it rises
 /// monotonically toward 1.0.
 pub fn confidence(modz: f64, threshold: f64) -> f64 {
     let excess = modz - threshold;
     1.0 / (1.0 + (-excess).exp())

---- point::tests::robust_path_catches_what_sigma_path_misses stdout ----

thread 'point::tests::robust_path_catches_what_sigma_path_misses' (1897883) panicked at crates/ax-detect/src/point.rs:210:9:
MAD-scaled score is large

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (1897881) panicked at crates/ax-detect/src/point.rs:141:9:
assertion `left == right` failed
  left: 0
 right: 1

---- robustz::tests::score_exact_arithmetic stdout ----

thread 'robustz::tests::score_exact_arithmetic' (1897889) panicked at crates/ax-detect/src/robustz.rs:51:9:
assertion `left == right` failed
  left: 0.5
 right: 2.5

failures:
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses
    point::tests::scale_invariant
    robustz::tests::score_exact_arithmetic

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
