*** crates/ax-detect/src/robustz.rs:34:23: replace / with * in score

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace / with * in score
@@ -26,17 +26,17 @@
         Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
         _ => None,
     }
 }
 
 /// Absolute standardized deviation `|k·(x − center)/scale|`. Extracted so the
 /// exact arithmetic (not just its sign) is pinned by tests.
 pub fn score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
-    (k * (x - center) / scale).abs()
+    (k * (x - center) * /* ~ changed by cargo-mutants ~ */ scale).abs()
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`: logistic in
 /// the excess `modz − threshold`, so `modz == threshold` gives 0.5 and it rises
 /// monotonically toward 1.0.
 pub fn confidence(modz: f64, threshold: f64) -> f64 {
     let excess = modz - threshold;
     1.0 / (1.0 + (-excess).exp())

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (1896251) panicked at crates/ax-detect/src/point.rs:190:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 4
 right: 1

---- point::tests::robust_path_catches_what_sigma_path_misses stdout ----

thread 'point::tests::robust_path_catches_what_sigma_path_misses' (1896255) panicked at crates/ax-detect/src/point.rs:205:9:
assertion `left == right` failed
  left: 6
 right: 1

---- robustz::tests::score_exact_arithmetic stdout ----

thread 'robustz::tests::score_exact_arithmetic' (1896261) panicked at crates/ax-detect/src/robustz.rs:51:9:
assertion `left == right` failed
  left: 10.0
 right: 2.5

failures:
    point::tests::exactly_min_n_values_is_assessed
    point::tests::robust_path_catches_what_sigma_path_misses
    point::tests::scale_invariant
    robustz::tests::score_exact_arithmetic

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
