*** crates/ax-detect/src/robustz.rs:34:5: replace score -> f64 with 1.0

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace score -> f64 with 1.0
@@ -26,17 +26,17 @@
         Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
         _ => None,
     }
 }
 
 /// Absolute standardized deviation `|k·(x − center)/scale|`. Extracted so the
 /// exact arithmetic (not just its sign) is pinned by tests.
 pub fn score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
-    (k * (x - center) / scale).abs()
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`: logistic in
 /// the excess `modz − threshold`, so `modz == threshold` gives 0.5 and it rises
 /// monotonically toward 1.0.
 pub fn confidence(modz: f64, threshold: f64) -> f64 {
     let excess = modz - threshold;
     1.0 / (1.0 + (-excess).exp())

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1894962) panicked at crates/ax-detect/src/ctx.rs:205:9:
assertion `left == right` failed
  left: 0
 right: 1

---- ctx::tests::value_anomalous_only_in_context_is_flagged stdout ----

thread 'ctx::tests::value_anomalous_only_in_context_is_flagged' (1894963) panicked at crates/ax-detect/src/ctx.rs:170:9:
assertion `left == right` failed
  left: 0
 right: 1

---- point::tests::exactly_min_n_values_is_assessed stdout ----

thread 'point::tests::exactly_min_n_values_is_assessed' (1895021) panicked at crates/ax-detect/src/point.rs:190:9:
assertion `left == right` failed: the 100.0 outlier must be flagged
  left: 0
 right: 1

failures:
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses
    robustz::tests::score_exact_arithmetic
    tests::registry_run_surfaces_point_finding

test result: FAILED. 90 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
