*** crates/ax-detect/src/robustz.rs:34:8: replace * with + in score

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace * with + in score
@@ -26,17 +26,17 @@
         Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
         _ => None,
     }
 }
 
 /// Absolute standardized deviation `|k·(x − center)/scale|`. Extracted so the
 /// exact arithmetic (not just its sign) is pinned by tests.
 pub fn score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
-    (k * (x - center) / scale).abs()
+    (k + /* ~ changed by cargo-mutants ~ */ (x - center) / scale).abs()
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`: logistic in
 /// the excess `modz − threshold`, so `modz == threshold` gives 0.5 and it rises
 /// monotonically toward 1.0.
 pub fn confidence(modz: f64, threshold: f64) -> f64 {
     let excess = modz - threshold;
     1.0 / (1.0 + (-excess).exp())

---- robustz::tests::score_exact_arithmetic stdout ----

thread 'robustz::tests::score_exact_arithmetic' (1896666) panicked at crates/ax-detect/src/robustz.rs:51:9:
assertion `left == right` failed
  left: 5.5
 right: 2.5

failures:
    robustz::tests::score_exact_arithmetic

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
