*** crates/ax-detect/src/robustz.rs:34:8: replace * with / in score

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace * with / in score
@@ -26,17 +26,17 @@
         Some(sd) if sd > 0.0 => Some((center, sd, 1.0)),
         _ => None,
     }
 }
 
 /// Absolute standardized deviation `|k·(x − center)/scale|`. Extracted so the
 /// exact arithmetic (not just its sign) is pinned by tests.
 pub fn score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
-    (k * (x - center) / scale).abs()
+    (k / /* ~ changed by cargo-mutants ~ */ (x - center) / scale).abs()
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`: logistic in
 /// the excess `modz − threshold`, so `modz == threshold` gives 0.5 and it rises
 /// monotonically toward 1.0.
 pub fn confidence(modz: f64, threshold: f64) -> f64 {
     let excess = modz - threshold;
     1.0 / (1.0 + (-excess).exp())

---- ctx::tests::clean_seasonal_series_has_no_findings stdout ----

thread 'ctx::tests::clean_seasonal_series_has_no_findings' (1896999) panicked at crates/ax-detect/src/ctx.rs:159:9:
tidy seasonal data has no contextual outlier

---- ctx::tests::phase_with_exactly_min_members_is_assessed stdout ----

thread 'ctx::tests::phase_with_exactly_min_members_is_assessed' (1897002) panicked at crates/ax-detect/src/ctx.rs:205:9:
assertion `left == right` failed
  left: 14
 right: 1

---- ctx::tests::value_anomalous_only_in_context_is_flagged stdout ----

thread 'ctx::tests::value_anomalous_only_in_context_is_flagged' (1897003) panicked at crates/ax-detect/src/ctx.rs:170:9:
assertion `left == right` failed
  left: 19
 right: 1

failures:
    ctx::tests::clean_seasonal_series_has_no_findings
    ctx::tests::phase_with_exactly_min_members_is_assessed
    ctx::tests::value_anomalous_only_in_context_is_flagged
    point::tests::exactly_min_n_values_is_assessed
    point::tests::obvious_outlier_is_flagged
    point::tests::robust_path_catches_what_sigma_path_misses
    robustz::tests::score_exact_arithmetic
    tests::single_corpus_clean_numeric_has_no_point_findings

test result: FAILED. 89 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
