*** crates/ax-detect/src/robustz.rs:41:5: replace confidence -> f64 with 0.0

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace confidence -> f64 with 0.0
@@ -33,18 +33,17 @@
 pub fn score(x: f64, center: f64, scale: f64, k: f64) -> f64 {
     (k * (x - center) / scale).abs()
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`: logistic in
 /// the excess `modz − threshold`, so `modz == threshold` gives 0.5 and it rises
 /// monotonically toward 1.0.
 pub fn confidence(modz: f64, threshold: f64) -> f64 {
-    let excess = modz - threshold;
-    1.0 / (1.0 + (-excess).exp())
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn score_exact_arithmetic() {

---- point::tests::obvious_outlier_is_flagged stdout ----

thread 'point::tests::obvious_outlier_is_flagged' (1898352) panicked at crates/ax-detect/src/point.rs:146:9:
assertion failed: report.findings[0].confidence > 0.5

---- robustz::tests::confidence_is_half_at_threshold_and_monotonic stdout ----

thread 'robustz::tests::confidence_is_half_at_threshold_and_monotonic' (1898359) panicked at crates/ax-detect/src/robustz.rs:57:9:
assertion `left == right` failed
  left: 0.0
 right: 0.5

failures:
    point::tests::obvious_outlier_is_flagged
    robustz::tests::confidence_is_half_at_threshold_and_monotonic

test result: FAILED. 95 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
