*** crates/ax-detect/src/robustz.rs:42:16: replace + with * in confidence

*** mutation diff:
--- crates/ax-detect/src/robustz.rs
+++ replace + with * in confidence
@@ -34,17 +34,17 @@
     (k * (x - center) / scale).abs()
 }
 
 /// Maps a modified z-score to a calibrated confidence in `[0, 1]`: logistic in
 /// the excess `modz − threshold`, so `modz == threshold` gives 0.5 and it rises
 /// monotonically toward 1.0.
 pub fn confidence(modz: f64, threshold: f64) -> f64 {
     let excess = modz - threshold;
-    1.0 / (1.0 + (-excess).exp())
+    1.0 / (1.0 * /* ~ changed by cargo-mutants ~ */ (-excess).exp())
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn score_exact_arithmetic() {

---- robustz::tests::confidence_is_half_at_threshold_and_monotonic stdout ----

thread 'robustz::tests::confidence_is_half_at_threshold_and_monotonic' (1901656) panicked at crates/ax-detect/src/robustz.rs:58:9:
assertion `left == right` failed
  left: 1.0
 right: 0.5

failures:
    robustz::tests::confidence_is_half_at_threshold_and_monotonic

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
