*** crates/ax-normalize/src/binary.rs:19:9: delete match arm Format::Parquet in read

*** mutation diff:
--- crates/ax-normalize/src/binary.rs
+++ delete match arm Format::Parquet in read
@@ -11,19 +11,17 @@
 use ax_core::{AxError, Column, Value};
 use polars::prelude::*;
 use std::io::Cursor;
 
 /// Reads a binary `fmt` into columns. Only [`Format::Parquet`] and
 /// [`Format::Arrow`] are handled; anything else is a programming error.
 pub fn read(fmt: Format, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
     let df = match fmt {
-        Format::Parquet => ParquetReader::new(Cursor::new(bytes.to_vec()))
-            .finish()
-            .map_err(|e| parse_err(fmt, e))?,
+         /* ~ changed by cargo-mutants ~ */
         Format::Arrow => IpcReader::new(Cursor::new(bytes.to_vec()))
             .finish()
             .map_err(|e| parse_err(fmt, e))?,
         _ => {
             return Err(AxError::UnknownFormat(format!(
                 "{} is not a binary format",
                 fmt.token()
             )))

---- binary::tests::corrupt_bytes_fail_cleanly stdout ----

thread 'binary::tests::corrupt_bytes_fail_cleanly' (1538565) panicked at crates/ax-normalize/src/binary.rs:184:9:
assertion failed: matches!(read(Format::Parquet, b"PAR1 not really parquet"),
    Err(AxError::Parse { .. }))

---- binary::tests::nulls_survive_the_roundtrip stdout ----

thread 'binary::tests::nulls_survive_the_roundtrip' (1538568) panicked at crates/ax-normalize/src/binary.rs:170:67:
called `Result::unwrap()` on an `Err` value: UnknownFormat("parquet is not a binary format")

---- binary::tests::parquet_roundtrips_to_recordset stdout ----

thread 'binary::tests::parquet_roundtrips_to_recordset' (1538569) panicked at crates/ax-normalize/src/binary.rs:144:67:
called `Result::unwrap()` on an `Err` value: UnknownFormat("parquet is not a binary format")

failures:
    binary::tests::corrupt_bytes_fail_cleanly
    binary::tests::nulls_survive_the_roundtrip
    binary::tests::parquet_roundtrips_to_recordset

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
