*** crates/ax-normalize/src/format.rs:37:9: replace Format::is_binary -> bool with false

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ replace Format::is_binary -> bool with false
@@ -29,17 +29,17 @@
             Format::Json => "json",
             Format::Parquet => "parquet",
             Format::Arrow => "arrow",
         }
     }
 
     /// Whether this format is binary columnar (read via the Polars backbone).
     pub fn is_binary(self) -> bool {
-        matches!(self, Format::Parquet | Format::Arrow)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Picks a format from a file extension, if recognized.
     pub fn from_extension(path: &str) -> Option<Format> {
         let ext = path.rsplit('.').next()?.to_ascii_lowercase();
         match ext.as_str() {
             "csv" => Some(Format::Csv),
             "tsv" | "tab" => Some(Format::Tsv),

---- format::tests::binary_classification stdout ----

thread 'format::tests::binary_classification' (1542220) panicked at crates/ax-normalize/src/format.rs:124:9:
assertion failed: Format::Parquet.is_binary()

failures:
    format::tests::binary_classification

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
