*** crates/ax-normalize/src/format.rs:42:9: replace Format::from_extension -> Option<Format> with None

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ replace Format::from_extension -> Option<Format> with None
@@ -34,26 +34,17 @@
 
     /// Whether this format is binary columnar (read via the Polars backbone).
     pub fn is_binary(self) -> bool {
         matches!(self, Format::Parquet | Format::Arrow)
     }
 
     /// Picks a format from a file extension, if recognized.
     pub fn from_extension(path: &str) -> Option<Format> {
-        let ext = path.rsplit('.').next()?.to_ascii_lowercase();
-        match ext.as_str() {
-            "csv" => Some(Format::Csv),
-            "tsv" | "tab" => Some(Format::Tsv),
-            "ndjson" | "jsonl" => Some(Format::Ndjson),
-            "json" => Some(Format::Json),
-            "parquet" | "pq" => Some(Format::Parquet),
-            "arrow" | "ipc" | "feather" => Some(Format::Arrow),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sniffs a format from leading content. Binary magic numbers are checked
     /// first (they are not valid UTF-8); then textual sniffing. `None` if
     /// nothing matches.
     pub fn sniff(bytes: &[u8]) -> Option<Format> {
         // Parquet files begin (and end) with the 4-byte magic "PAR1".
         if bytes.starts_with(b"PAR1") {

---- format::tests::extension_detection stdout ----

thread 'format::tests::extension_detection' (1542813) panicked at crates/ax-normalize/src/format.rs:135:9:
assertion `left == right` failed
  left: None
 right: Some(Csv)

---- format::tests::binary_extensions_and_magic stdout ----

thread 'format::tests::binary_extensions_and_magic' (1542812) panicked at crates/ax-normalize/src/format.rs:123:9:
assertion `left == right` failed
  left: None
 right: Some(Parquet)

---- format::tests::resolve_prefers_extension_then_sniff stdout ----

thread 'format::tests::resolve_prefers_extension_then_sniff' (1542815) panicked at crates/ax-normalize/src/format.rs:170:9:
assertion `left == right` failed
  left: Json
 right: Csv

failures:
    format::tests::binary_extensions_and_magic
    format::tests::extension_detection
    format::tests::resolve_prefers_extension_then_sniff

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
