*** crates/ax-normalize/src/format.rs:44:13: delete match arm "csv" in Format::from_extension

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm "csv" in Format::from_extension
@@ -36,17 +36,17 @@
     pub fn is_binary(self) -> bool {
         matches!(self, Format::Parquet | Format::Arrow)
     }
 
     /// Picks a format from a file extension, if recognized.
     pub fn from_extension(path: &str) -> Option<Format> {
         let ext = path.rsplit('.').next()?.to_ascii_lowercase();
         match ext.as_str() {
-            "csv" => Some(Format::Csv),
+             /* ~ changed by cargo-mutants ~ */
             "tsv" | "tab" => Some(Format::Tsv),
             "ndjson" | "jsonl" => Some(Format::Ndjson),
             "json" => Some(Format::Json),
             "parquet" | "pq" => Some(Format::Parquet),
             "arrow" | "ipc" | "feather" => Some(Format::Arrow),
             _ => None,
         }
     }

---- format::tests::resolve_prefers_extension_then_sniff stdout ----

thread 'format::tests::resolve_prefers_extension_then_sniff' (1543419) panicked at crates/ax-normalize/src/format.rs:179:9:
assertion `left == right` failed
  left: Json
 right: Csv

---- format::tests::extension_detection stdout ----

thread 'format::tests::extension_detection' (1543417) panicked at crates/ax-normalize/src/format.rs:144:9:
assertion `left == right` failed
  left: None
 right: Some(Csv)

failures:
    format::tests::extension_detection
    format::tests::resolve_prefers_extension_then_sniff

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
