*** crates/ax-normalize/src/format.rs:45:13: delete match arm "tsv" | "tab" in Format::from_extension

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm "tsv" | "tab" in Format::from_extension
@@ -37,17 +37,17 @@
         matches!(self, Format::Parquet | Format::Arrow)
     }
 
     /// Picks a format from a file extension, if recognized.
     pub fn from_extension(path: &str) -> Option<Format> {
         let ext = path.rsplit('.').next()?.to_ascii_lowercase();
         match ext.as_str() {
             "csv" => Some(Format::Csv),
-            "tsv" | "tab" => Some(Format::Tsv),
+             /* ~ changed by cargo-mutants ~ */
             "ndjson" | "jsonl" => Some(Format::Ndjson),
             "json" => Some(Format::Json),
             "parquet" | "pq" => Some(Format::Parquet),
             "arrow" | "ipc" | "feather" => Some(Format::Arrow),
             _ => None,
         }
     }

---- format::tests::extension_detection stdout ----

thread 'format::tests::extension_detection' (1544076) panicked at crates/ax-normalize/src/format.rs:145:9:
assertion `left == right` failed
  left: None
 right: Some(Tsv)

failures:
    format::tests::extension_detection

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
