*** crates/ax-normalize/src/format.rs:46:13: delete match arm "ndjson" | "jsonl" in Format::from_extension

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm "ndjson" | "jsonl" in Format::from_extension
@@ -38,17 +38,17 @@
     }
 
     /// Picks a format from a file extension, if recognized.
     pub fn from_extension(path: &str) -> Option<Format> {
         let ext = path.rsplit('.').next()?.to_ascii_lowercase();
         match ext.as_str() {
             "csv" => Some(Format::Csv),
             "tsv" | "tab" => Some(Format::Tsv),
-            "ndjson" | "jsonl" => Some(Format::Ndjson),
+             /* ~ changed by cargo-mutants ~ */
             "json" => Some(Format::Json),
             "parquet" | "pq" => Some(Format::Parquet),
             "arrow" | "ipc" | "feather" => Some(Format::Arrow),
             _ => None,
         }
     }
 
     /// Sniffs a format from leading content. Binary magic numbers are checked

---- format::tests::extension_detection stdout ----

thread 'format::tests::extension_detection' (1544668) panicked at crates/ax-normalize/src/format.rs:148:9:
assertion `left == right` failed
  left: None
 right: Some(Ndjson)

failures:
    format::tests::extension_detection

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
