*** crates/ax-normalize/src/format.rs:47:13: delete match arm "json" in Format::from_extension

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm "json" in Format::from_extension
@@ -39,17 +39,17 @@
 
     /// Picks a format from a file extension, if recognized.
     pub fn from_extension(path: &str) -> Option<Format> {
         let ext = path.rsplit('.').next()?.to_ascii_lowercase();
         match ext.as_str() {
             "csv" => Some(Format::Csv),
             "tsv" | "tab" => Some(Format::Tsv),
             "ndjson" | "jsonl" => Some(Format::Ndjson),
-            "json" => Some(Format::Json),
+             /* ~ changed by cargo-mutants ~ */
             "parquet" | "pq" => Some(Format::Parquet),
             "arrow" | "ipc" | "feather" => Some(Format::Arrow),
             _ => None,
         }
     }
 
     /// Sniffs a format from leading content. Binary magic numbers are checked
     /// first (they are not valid UTF-8); then textual sniffing. `None` if

---- format::tests::extension_detection stdout ----

thread 'format::tests::extension_detection' (1545260) panicked at crates/ax-normalize/src/format.rs:147:9:
assertion `left == right` failed
  left: None
 right: Some(Json)

failures:
    format::tests::extension_detection

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
