*** crates/ax-normalize/src/format.rs:48:13: delete match arm "parquet" | "pq" in Format::from_extension

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm "parquet" | "pq" in Format::from_extension
@@ -40,17 +40,17 @@
     /// Picks a format from a file extension, if recognized.
     pub fn from_extension(path: &str) -> Option<Format> {
         let ext = path.rsplit('.').next()?.to_ascii_lowercase();
         match ext.as_str() {
             "csv" => Some(Format::Csv),
             "tsv" | "tab" => Some(Format::Tsv),
             "ndjson" | "jsonl" => Some(Format::Ndjson),
             "json" => Some(Format::Json),
-            "parquet" | "pq" => Some(Format::Parquet),
+             /* ~ changed by cargo-mutants ~ */
             "arrow" | "ipc" | "feather" => Some(Format::Arrow),
             _ => None,
         }
     }
 
     /// Sniffs a format from leading content. Binary magic numbers are checked
     /// first (they are not valid UTF-8); then textual sniffing. `None` if
     /// nothing matches.

---- format::tests::binary_extensions_and_magic stdout ----

thread 'format::tests::binary_extensions_and_magic' (1545918) panicked at crates/ax-normalize/src/format.rs:132:9:
assertion `left == right` failed
  left: None
 right: Some(Parquet)

failures:
    format::tests::binary_extensions_and_magic

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
