*** crates/ax-normalize/src/format.rs:59:9: replace Format::sniff -> Option<Format> with None

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ replace Format::sniff -> Option<Format> with None
@@ -51,54 +51,17 @@
         }
     }
 
     /// Sniffs a format from leading content. Binary magic numbers are checked
     /// first (they are not valid UTF-8); then textual sniffing. `None` if
     /// nothing matches.
     pub fn sniff(bytes: &[u8]) -> Option<Format> {
         // Parquet files begin (and end) with the 4-byte magic "PAR1".
-        if bytes.starts_with(b"PAR1") {
-            return Some(Format::Parquet);
-        }
-        // Arrow IPC files begin with "ARROW1".
-        if bytes.starts_with(b"ARROW1") {
-            return Some(Format::Arrow);
-        }
-        let text = std::str::from_utf8(bytes).ok()?;
-        let trimmed = text.trim_start();
-        let first = trimmed.chars().next()?;
-        match first {
-            '[' => Some(Format::Json),
-            '{' => {
-                // One object → json; multiple object-lines → ndjson.
-                let object_lines = trimmed
-                    .lines()
-                    .filter(|l| !l.trim().is_empty())
-                    .take(3)
-                    .filter(|l| l.trim_start().starts_with('{'))
-                    .count();
-                if object_lines >= 2 {
-                    Some(Format::Ndjson)
-                } else {
-                    Some(Format::Json)
-                }
-            }
-            _ => {
-                // Tabular: prefer TSV if a tab appears before any comma on line 1.
-                let line = trimmed.lines().next()?;
-                // Indices of '\t' and ',' are positions of distinct characters,
-                // so they are never equal; `<` is the only meaningful test.
-                match (line.find('\t'), line.find(',')) {
-                    (Some(t), Some(c)) if t < c => Some(Format::Tsv),
-                    (Some(_), None) => Some(Format::Tsv),
-                    _ => Some(Format::Csv), // comma-first, or single comma-free column
-                }
-            }
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolves the format for `source`/`bytes`: extension first, then sniff.
     pub fn resolve(source: &str, bytes: &[u8]) -> Result<Format, AxError> {
         if let Some(f) = Format::from_extension(source) {
             return Ok(f);
         }
         Format::sniff(bytes).ok_or_else(|| AxError::UnknownFormat(source.to_string()))

---- format::tests::binary_extensions_and_magic stdout ----

thread 'format::tests::binary_extensions_and_magic' (1547093) panicked at crates/ax-normalize/src/format.rs:99:9:
assertion `left == right` failed
  left: None
 right: Some(Parquet)

---- format::tests::resolve_prefers_extension_then_sniff stdout ----

thread 'format::tests::resolve_prefers_extension_then_sniff' (1547096) panicked at crates/ax-normalize/src/format.rs:147:54:
called `Result::unwrap()` on an `Err` value: UnknownFormat("-")

---- format::tests::sniff_csv_vs_tsv stdout ----

thread 'format::tests::sniff_csv_vs_tsv' (1547097) panicked at crates/ax-normalize/src/format.rs:135:9:
assertion `left == right` failed
  left: None
 right: Some(Csv)

failures:
    format::tests::binary_extensions_and_magic
    format::tests::resolve_prefers_extension_then_sniff
    format::tests::sniff_csv_vs_tsv
    format::tests::sniff_json_vs_ndjson
    format::tests::sniff_uses_delimiter_order_when_both_present
    tests::ndjson_key_union_pads_missing

test result: FAILED. 17 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
