*** crates/ax-normalize/src/format.rs:70:13: delete match arm '[' in Format::sniff

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm '[' in Format::sniff
@@ -62,17 +62,17 @@
         // Arrow IPC files begin with "ARROW1".
         if bytes.starts_with(b"ARROW1") {
             return Some(Format::Arrow);
         }
         let text = std::str::from_utf8(bytes).ok()?;
         let trimmed = text.trim_start();
         let first = trimmed.chars().next()?;
         match first {
-            '[' => Some(Format::Json),
+             /* ~ changed by cargo-mutants ~ */
             '{' => {
                 // One object → json; multiple object-lines → ndjson.
                 let object_lines = trimmed
                     .lines()
                     .filter(|l| !l.trim().is_empty())
                     .take(3)
                     .filter(|l| l.trim_start().starts_with('{'))
                     .count();

---- format::tests::sniff_json_vs_ndjson stdout ----

thread 'format::tests::sniff_json_vs_ndjson' (1547703) panicked at crates/ax-normalize/src/format.rs:162:9:
assertion `left == right` failed
  left: Some(Csv)
 right: Some(Json)

failures:
    format::tests::sniff_json_vs_ndjson

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
