*** crates/ax-normalize/src/format.rs:71:13: delete match arm '{' in Format::sniff

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm '{' in Format::sniff
@@ -63,30 +63,17 @@
         if bytes.starts_with(b"ARROW1") {
             return Some(Format::Arrow);
         }
         let text = std::str::from_utf8(bytes).ok()?;
         let trimmed = text.trim_start();
         let first = trimmed.chars().next()?;
         match first {
             '[' => Some(Format::Json),
-            '{' => {
-                // One object → json; multiple object-lines → ndjson.
-                let object_lines = trimmed
-                    .lines()
-                    .filter(|l| !l.trim().is_empty())
-                    .take(3)
-                    .filter(|l| l.trim_start().starts_with('{'))
-                    .count();
-                if object_lines >= 2 {
-                    Some(Format::Ndjson)
-                } else {
-                    Some(Format::Json)
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 // Tabular: prefer TSV if a tab appears before any comma on line 1.
                 let line = trimmed.lines().next()?;
                 // Indices of '\t' and ',' are positions of distinct characters,
                 // so they are never equal; `<` is the only meaningful test.
                 match (line.find('\t'), line.find(',')) {
                     (Some(t), Some(c)) if t < c => Some(Format::Tsv),
                     (Some(_), None) => Some(Format::Tsv),

---- format::tests::sniff_json_vs_ndjson stdout ----

thread 'format::tests::sniff_json_vs_ndjson' (1548359) panicked at crates/ax-normalize/src/format.rs:150:9:
assertion `left == right` failed
  left: Some(Csv)
 right: Some(Ndjson)

---- tests::ndjson_key_union_pads_missing stdout ----

thread 'tests::ndjson_key_union_pads_missing' (1548366) panicked at crates/ax-normalize/src/lib.rs:221:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    format::tests::sniff_json_vs_ndjson
    tests::ndjson_key_union_pads_missing

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
