*** crates/ax-normalize/src/lib.rs:187:9: replace TableBuilder::finish -> Vec<Column> with vec![]

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace TableBuilder::finish -> Vec<Column> with vec![]
@@ -179,21 +179,17 @@
         for (name, &i) in &self.index {
             let cell = row.remove(name).unwrap_or(Value::Null);
             self.cols[i].push(cell);
         }
         self.rows += 1;
     }
 
     fn finish(self) -> Vec<Column> {
-        self.order
-            .into_iter()
-            .zip(self.cols)
-            .map(|(name, cells)| Column::new(name, cells))
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn parse_err(fmt: Format, e: impl std::fmt::Display) -> AxError {
     AxError::Parse {
         format: fmt.token().to_string(),
         message: e.to_string(),
     }

---- tests::json_scalar_goes_to_value_column stdout ----

thread 'tests::json_scalar_goes_to_value_column' (1537474) panicked at crates/ax-normalize/src/lib.rs:233:39:
called `Option::unwrap()` on a `None` value

---- tests::json_array_of_objects stdout ----

thread 'tests::json_array_of_objects' (1537473) panicked at crates/ax-normalize/src/lib.rs:226:9:
assertion `left == right` failed
  left: 0
 right: 3

---- tests::ndjson_key_union_pads_missing stdout ----

thread 'tests::ndjson_key_union_pads_missing' (1537475) panicked at crates/ax-normalize/src/lib.rs:217:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    tests::json_array_of_objects
    tests::json_scalar_goes_to_value_column
    tests::ndjson_key_union_pads_missing

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
