*** crates/ax-normalize/src/lib.rs:64:5: replace read_delimited -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace read_delimited -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -56,45 +56,17 @@
         Format::Parquet | Format::Arrow => read_binary(fmt, bytes)?,
     };
     Ok(RecordSet::new(source, fmt.token(), columns))
 }
 
 /// Reads CSV/TSV with a header row. Field count is normalized to the header
 /// width: short rows pad with [`Value::Null`], long rows truncate.
 fn read_delimited(bytes: &[u8], delim: u8, fmt: Format) -> Result<Vec<Column>, AxError> {
-    let mut rdr = csv::ReaderBuilder::new()
-        .delimiter(delim)
-        .flexible(true)
-        .has_headers(true)
-        .from_reader(bytes);
-
-    let headers = rdr
-        .headers()
-        .map_err(|e| parse_err(fmt, e))?
-        .iter()
-        .map(|h| h.to_string())
-        .collect::<Vec<_>>();
-
-    let mut cols: Vec<Vec<Value>> = vec![Vec::new(); headers.len()];
-    for rec in rdr.records() {
-        let rec = rec.map_err(|e| parse_err(fmt, e))?;
-        for (i, col) in cols.iter_mut().enumerate() {
-            match rec.get(i) {
-                Some(field) => col.push(infer::infer_scalar(field)),
-                None => col.push(Value::Null),
-            }
-        }
-    }
-
-    Ok(headers
-        .into_iter()
-        .zip(cols)
-        .map(|(name, cells)| Column::new(name, cells))
-        .collect())
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads newline-delimited JSON. Each non-empty line is one record; scalar or
 /// array lines are placed under a synthetic `value` column.
 fn read_ndjson(bytes: &[u8], fmt: Format) -> Result<Vec<Column>, AxError> {
     let text = std::str::from_utf8(bytes).map_err(|e| parse_err(fmt, e))?;
     let mut builder = TableBuilder::new();
     for (lineno, line) in text.lines().enumerate() {

---- tests::csv_roundtrip_types_and_nulls stdout ----

thread 'tests::csv_roundtrip_types_and_nulls' (1532489) panicked at crates/ax-normalize/src/lib.rs:182:9:
assertion `left == right` failed
  left: 0
 right: 2

---- tests::ragged_csv_pads_and_truncates stdout ----

thread 'tests::ragged_csv_pads_and_truncates' (1532493) panicked at crates/ax-normalize/src/lib.rs:220:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    tests::csv_roundtrip_types_and_nulls
    tests::ragged_csv_pads_and_truncates

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
