*** crates/ax-normalize/src/lib.rs:98:5: replace read_ndjson -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace read_ndjson -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -90,29 +90,17 @@
         .zip(cols)
         .map(|(name, cells)| Column::new(name, cells))
         .collect())
 }
 
 /// Reads newline-delimited JSON. Each non-empty line is one record; scalar or
 /// array lines are placed under a synthetic `value` column.
 fn read_ndjson(bytes: &[u8], fmt: Format) -> Result<Vec<Column>, AxError> {
-    let text = std::str::from_utf8(bytes).map_err(|e| parse_err(fmt, e))?;
-    let mut builder = TableBuilder::new();
-    for (lineno, line) in text.lines().enumerate() {
-        if line.trim().is_empty() {
-            continue;
-        }
-        let val: serde_json::Value = serde_json::from_str(line).map_err(|e| AxError::Parse {
-            format: fmt.token().to_string(),
-            message: format!("line {}: {e}", lineno + 1),
-        })?;
-        builder.push_value(val);
-    }
-    Ok(builder.finish())
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads a single JSON document: an array of records, a lone object (one row),
 /// or a scalar/array (one `value` cell).
 fn read_json(bytes: &[u8], fmt: Format) -> Result<Vec<Column>, AxError> {
     let val: serde_json::Value = serde_json::from_slice(bytes).map_err(|e| parse_err(fmt, e))?;
     let mut builder = TableBuilder::new();
     match val {

---- tests::ndjson_key_union_pads_missing stdout ----

thread 'tests::ndjson_key_union_pads_missing' (1533165) panicked at crates/ax-normalize/src/lib.rs:209:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    tests::ndjson_key_union_pads_missing

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
