*** crates/ax-validate/src/lib.rs:110:5: replace datasets -> Vec<Strd> with vec![]

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace datasets -> Vec<Strd> with vec![]
@@ -102,17 +102,17 @@
     ("NumAcc1", include_str!("../data/strd/NumAcc1.dat")),
     ("NumAcc2", include_str!("../data/strd/NumAcc2.dat")),
     ("NumAcc3", include_str!("../data/strd/NumAcc3.dat")),
     ("NumAcc4", include_str!("../data/strd/NumAcc4.dat")),
 ];
 
 /// Parses every embedded dataset.
 pub fn datasets() -> Vec<Strd> {
-    DATASETS.iter().map(|(n, t)| parse(n, t)).collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// NIST's "log relative error": the number of correct significant digits in
 /// `computed` relative to `certified`. Higher is better; an exact match is
 /// reported as `f64::INFINITY`. This is the standard StRD accuracy metric.
 pub fn correct_digits(computed: f64, certified: f64) -> f64 {
     if computed == certified {
         return f64::INFINITY;

---- compensated_reductions_beat_the_naive_formula stdout ----

thread 'compensated_reductions_beat_the_naive_formula' (1968394) panicked at crates/ax-validate/tests/nist_strd.rs:58:65:
called `Option::unwrap()` on a `None` value

---- numacc1_is_exact stdout ----

thread 'numacc1_is_exact' (1968395) panicked at crates/ax-validate/tests/nist_strd.rs:82:10:
called `Option::unwrap()` on a `None` value

failures:
    compensated_reductions_beat_the_naive_formula
    numacc1_is_exact

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
