*** crates/ax-validate/src/lib.rs:117:17: replace == with != in correct_digits

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace == with != in correct_digits
@@ -109,17 +109,17 @@
 pub fn datasets() -> Vec<Strd> {
     DATASETS.iter().map(|(n, t)| parse(n, t)).collect()
 }
 
 /// NIST's "log relative error": the number of correct significant digits in
 /// `computed` relative to `certified`. Higher is better; an exact match is
 /// reported as `f64::INFINITY`. This is the standard StRD accuracy metric.
 pub fn correct_digits(computed: f64, certified: f64) -> f64 {
-    if computed == certified {
+    if computed != /* ~ changed by cargo-mutants ~ */ certified {
         return f64::INFINITY;
     }
     let rel = if certified != 0.0 {
         ((computed - certified) / certified).abs()
     } else {
         computed.abs()
     };
     if rel == 0.0 {

---- tests::correct_digits_behaves stdout ----

thread 'tests::correct_digits_behaves' (1969636) panicked at crates/ax-validate/src/lib.rs:159:9:
assertion failed: (correct_digits(1.001, 1.0) - 3.0).abs() < 0.01

failures:
    tests::correct_digits_behaves

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
