*** crates/ax-validate/src/lib.rs:121:33: replace / with * in correct_digits

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace / with * in correct_digits
@@ -113,17 +113,17 @@
 /// NIST's "log relative error": the number of correct significant digits in
 /// `computed` relative to `certified`. Higher is better; an exact match is
 /// reported as `f64::INFINITY`. This is the standard StRD accuracy metric.
 pub fn correct_digits(computed: f64, certified: f64) -> f64 {
     if computed == certified {
         return f64::INFINITY;
     }
     let rel = if certified != 0.0 {
-        ((computed - certified) / certified).abs()
+        ((computed - certified) * /* ~ changed by cargo-mutants ~ */ certified).abs()
     } else {
         computed.abs()
     };
     if rel == 0.0 {
         f64::INFINITY
     } else {
         -rel.log10()
     }

---- compensated_reductions_beat_the_naive_formula stdout ----

thread 'compensated_reductions_beat_the_naive_formula' (1970513) panicked at crates/ax-validate/tests/nist_strd.rs:61:9:
NumAcc3: naive formula should be badly wrong, got 3.14 digits

---- certified_mean_matches_to_full_precision stdout ----

thread 'certified_mean_matches_to_full_precision' (1970511) panicked at crates/ax-validate/tests/nist_strd.rs:20:9:
Lottery: mean has only 9.75 correct digits (computed 518.9587155963303, certified 518.95871559633)

---- certified_std_dev_matches stdout ----

thread 'certified_std_dev_matches' (1970512) panicked at crates/ax-validate/tests/nist_strd.rs:43:13:
Lottery: well-conditioned std should reach ≥13 digits, got 10.78

failures:
    certified_mean_matches_to_full_precision
    certified_std_dev_matches
    compensated_reductions_beat_the_naive_formula

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
