*** crates/ax-validate/src/lib.rs:125:12: replace == with != in correct_digits

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace == with != in correct_digits
@@ -117,17 +117,17 @@
     if computed == certified {
         return f64::INFINITY;
     }
     let rel = if certified != 0.0 {
         ((computed - certified) / certified).abs()
     } else {
         computed.abs()
     };
-    if rel == 0.0 {
+    if rel != /* ~ changed by cargo-mutants ~ */ 0.0 {
         f64::INFINITY
     } else {
         -rel.log10()
     }
 }
 
 /// The textbook one-pass ("sum of squares") variance, kept here precisely to
 /// demonstrate what anomalyx deliberately does *not* do: on data with a large

---- tests::correct_digits_behaves stdout ----

thread 'tests::correct_digits_behaves' (1971384) panicked at crates/ax-validate/src/lib.rs:159:9:
assertion failed: (correct_digits(1.001, 1.0) - 3.0).abs() < 0.01

failures:
    tests::correct_digits_behaves

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
