*** crates/ax-validate/src/lib.rs:137:5: replace naive_one_pass_variance -> f64 with 1.0

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace naive_one_pass_variance -> f64 with 1.0
@@ -129,20 +129,17 @@
     }
 }
 
 /// The textbook one-pass ("sum of squares") variance, kept here precisely to
 /// demonstrate what anomalyx deliberately does *not* do: on data with a large
 /// mean and small spread it suffers catastrophic cancellation. Contrast with
 /// [`ax_core::det::variance`], which is two-pass and compensated.
 pub fn naive_one_pass_variance(xs: &[f64]) -> f64 {
-    let n = xs.len() as f64;
-    let sum: f64 = xs.iter().sum();
-    let sum_sq: f64 = xs.iter().map(|x| x * x).sum();
-    (sum_sq - sum * sum / n) / (n - 1.0)
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn every_dataset_parses_with_the_certified_count() {

*** result: Success
