*** crates/ax-validate/src/lib.rs:139:43: replace * with / in naive_one_pass_variance

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace * with / in naive_one_pass_variance
@@ -131,17 +131,17 @@
 
 /// The textbook one-pass ("sum of squares") variance, kept here precisely to
 /// demonstrate what anomalyx deliberately does *not* do: on data with a large
 /// mean and small spread it suffers catastrophic cancellation. Contrast with
 /// [`ax_core::det::variance`], which is two-pass and compensated.
 pub fn naive_one_pass_variance(xs: &[f64]) -> f64 {
     let n = xs.len() as f64;
     let sum: f64 = xs.iter().sum();
-    let sum_sq: f64 = xs.iter().map(|x| x * x).sum();
+    let sum_sq: f64 = xs.iter().map(|x| x / /* ~ changed by cargo-mutants ~ */ x).sum();
     (sum_sq - sum * sum / n) / (n - 1.0)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

*** result: Success
