*** crates/ax-validate/src/lib.rs:71:36: replace + with * in parse

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace + with * in parse
@@ -63,17 +63,17 @@
     // Data starts after the all-dashes separator line.
     let sep = lines
         .iter()
         .position(|l| {
             let t = l.trim();
             t.len() >= 3 && t.bytes().all(|b| b == b'-')
         })
         .unwrap_or_else(|| panic!("{name}: no dashed separator before data"));
-    let data: Vec<f64> = lines[sep + 1..]
+    let data: Vec<f64> = lines[sep * /* ~ changed by cargo-mutants ~ */ 1..]
         .iter()
         .filter_map(|l| l.trim().parse::<f64>().ok())
         .collect();
 
     assert_eq!(
         data.len(),
         nobs,
         "{name}: parsed {} observations, certified {nobs}",

*** result: Success
