*** crates/ax-cli/src/describe.rs:14:5: replace describe_json -> String with "xyzzy".into()

*** mutation diff:
--- crates/ax-cli/src/describe.rs
+++ replace describe_json -> String with "xyzzy".into()
@@ -6,45 +6,17 @@
 //! from the same registries `scan` uses, so the description can never drift from
 //! behavior.
 
 use ax_core::envelope::{ExitCode, FINDING_COLUMNS, PROTOCOL};
 use ax_core::AnomalyClass;
 use ax_detect::{DetectConfig, Registry};
 
 pub fn describe_json() -> String {
-    let cfg = DetectConfig::default();
-    let classes: Vec<&str> = AnomalyClass::ALL.iter().map(|c| c.token()).collect();
-    let detectors = Registry::default_set().ids();
-
-    let doc = serde_json::json!({
-        "protocol": PROTOCOL,
-        "tool": "anomalyx",
-        "summary": "Contract-first anomaly detection over arbitrary corpora.",
-        "commands": {
-            "describe": "Emit this protocol metadata.",
-            "schema": "Emit the JSON Schema of `scan` output.",
-            "scan": "Normalize input (file or stdin) and emit a tq1 anomaly envelope.",
-            "explain": "Resolve a finding handle to its underlying evidence."
-        },
-        "input_formats": ["csv", "tsv", "ndjson", "json"],
-        "planned_formats": ["parquet", "arrow"],
-        "anomaly_classes": classes,
-        "detectors": detectors,
-        "finding_columns": FINDING_COLUMNS,
-        "exit_codes": {
-            "clean": ExitCode::Clean.code(),
-            "anomalies": ExitCode::Anomalies.code(),
-            "error": ExitCode::Error.code()
-        },
-        "config": cfg,
-        "config_version": cfg.version(),
-        "determinism": "Same input + same config_version yields byte-identical output."
-    });
-    serde_json::to_string_pretty(&doc).expect("describe serializes")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn describe_is_valid_json_with_protocol() {

---- describe::tests::describe_is_valid_json_with_protocol stdout ----

thread 'describe::tests::describe_is_valid_json_with_protocol' (1494588) panicked at crates/ax-cli/src/describe.rs:23:75:
called `Result::unwrap()` on an `Err` value: Error("expected value", line: 1, column: 1)

failures:
    describe::tests::describe_is_valid_json_with_protocol

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
