*** crates/ax-cli/src/main.rs:132:30: replace == with != in cmd_explain

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace == with != in cmd_explain
@@ -124,17 +124,17 @@
     let evidence = resolve_handle(&rs, &handle)?;
 
     // Re-run detection and attach any findings that point at this handle.
     let cfg = DetectConfig::default();
     let report = Registry::default_set().run(&rs, &cfg);
     let findings: Vec<_> = report
         .findings
         .into_iter()
-        .filter(|f| f.handle == handle)
+        .filter(|f| f.handle != /* ~ changed by cargo-mutants ~ */ handle)
         .collect();
 
     let out = serde_json::json!({
         "protocol": PROTOCOL,
         "handle": handle_str,
         "evidence": evidence,
         "findings": findings,
     });

---- explain_resolves_a_cell_handle stdout ----

thread 'explain_resolves_a_cell_handle' (1224259) panicked at crates/ax-cli/tests/cli.rs:109:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    explain_resolves_a_cell_handle

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
