*** crates/ax-cli/src/main.rs:224:31: replace || with && in resolve_handle

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace || with && in resolve_handle
@@ -216,17 +216,17 @@
                 "column": col.name,
                 "row": row,
                 "value": value,
                 "column_type": col.ty,
             }))
         }
         Handle::Range { column, start, end } => {
             let col = rs.column(column).ok_or_else(unresolved)?;
-            if *start >= *end || *end > col.len() {
+            if *start >= *end && /* ~ changed by cargo-mutants ~ */ *end > col.len() {
                 return Err(unresolved());
             }
             Ok(serde_json::json!({
                 "kind": "range",
                 "column": col.name,
                 "start": start,
                 "end": end,
                 "values": &col.cells[*start..*end],

---- tests::resolve_range_valid_and_invalid stdout ----

thread 'tests::resolve_range_valid_and_invalid' (1493247) panicked at crates/ax-cli/src/main.rs:305:9:
assertion failed: resolve_handle(&rs,
        &Handle::Range { column: "x".into(), start: 2, end: 2 }).is_err()

failures:
    tests::resolve_range_valid_and_invalid

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
