*** crates/ax-cli/src/main.rs:224:39: replace > with == in resolve_handle

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace > with == in resolve_handle
@@ -216,17 +216,17 @@
                 "column": col.name,
                 "row": row,
                 "value": value,
                 "column_type": col.ty,
             }))
         }
         Handle::Range { column, start, end } => {
             let col = rs.column(column).ok_or_else(unresolved)?;
-            if *start >= *end || *end > col.len() {
+            if *start >= *end || *end == /* ~ changed by cargo-mutants ~ */ col.len() {
                 return Err(unresolved());
             }
             Ok(serde_json::json!({
                 "kind": "range",
                 "column": col.name,
                 "start": start,
                 "end": end,
                 "values": &col.cells[*start..*end],

---- tests::resolve_range_valid_and_invalid stdout ----

thread 'tests::resolve_range_valid_and_invalid' (1745396) panicked at crates/ax-cli/src/main.rs:232:37:
range end index 4 out of range for slice of length 3

failures:
    tests::resolve_range_valid_and_invalid

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
