*** crates/ax-cli/src/main.rs:64:5: replace usage -> &'static str with ""

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace usage -> &'static str with ""
@@ -56,25 +56,17 @@
         other => Err(AxError::Config(format!(
             "unknown command '{other}'\n{}",
             usage()
         ))),
     }
 }
 
 fn usage() -> &'static str {
-    "anomalyx — contract-first anomaly detection\n\
-     \n\
-     USAGE:\n\
-     \x20 anomalyx describe            Protocol metadata\n\
-     \x20 anomalyx schema              JSON Schema of scan output\n\
-     \x20 anomalyx scan [PATH]         Scan a file (or stdin) for anomalies\n\
-     \x20 anomalyx explain <HANDLE> [PATH]   Resolve a finding handle to evidence\n\
-     \n\
-     EXIT: 0 clean · 1 anomalies found · 2 error"
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
     match path {
         Some(p) if p != "-" => {
             let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
             Ok((p.clone(), bytes))

---- tests::usage_is_nonempty_and_documents_verbs stdout ----

thread 'tests::usage_is_nonempty_and_documents_verbs' (1221299) panicked at crates/ax-cli/src/main.rs:241:9:
assertion failed: u.contains("describe") && u.contains("scan") && u.contains("explain")

failures:
    tests::usage_is_nonempty_and_documents_verbs

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
