*** crates/ax-cli/src/main.rs:77:5: replace read_input -> Result<(String, Vec<u8>), AxError> with Ok((String::new(), vec![]))

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace read_input -> Result<(String, Vec<u8>), AxError> with Ok((String::new(), vec![]))
@@ -69,29 +69,17 @@
      \x20 anomalyx scan [PATH]         Scan a file (or stdin) for anomalies\n\
      \x20 anomalyx explain <HANDLE> [PATH]   Resolve a finding handle to evidence\n\
      \n\
      EXIT: 0 clean · 1 anomalies found · 2 error"
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
-    match path {
-        Some(p) if p != "-" => {
-            let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
-            Ok((p.clone(), bytes))
-        }
-        _ => {
-            let mut buf = Vec::new();
-            std::io::stdin()
-                .read_to_end(&mut buf)
-                .map_err(|e| AxError::Io(format!("stdin: {e}")))?;
-            Ok(("-".to_string(), buf))
-        }
-    }
+    Ok((String::new(), vec![])) /* ~ changed by cargo-mutants ~ */
 }
 
 fn cmd_scan(rest: &[String]) -> Result<ExitCode, AxError> {
     let (source, bytes) = read_input(rest.first())?;
     let rs = ax_normalize::normalize(&source, &bytes)?;
     let cfg = DetectConfig::default();
     let registry = Registry::default_set();
     let report = registry.run(&rs, &cfg);

---- explain_resolves_a_cell_handle stdout ----

thread 'explain_resolves_a_cell_handle' (1221748) panicked at crates/ax-cli/tests/cli.rs:106:5:
assertion `left == right` failed: stderr: anomalyx: error: unsupported or unrecognized input format: 

  left: 2
 right: 0

---- scan_clean_exits_zero_with_no_rows stdout ----

thread 'scan_clean_exits_zero_with_no_rows' (1221750) panicked at crates/ax-cli/tests/cli.rs:63:5:
assertion `left == right` failed: stderr: anomalyx: error: unsupported or unrecognized input format: 

  left: 2
 right: 0

---- scan_outlier_exits_one_with_a_finding stdout ----

thread 'scan_outlier_exits_one_with_a_finding' (1221756) panicked at crates/ax-cli/tests/cli.rs:72:5:
assertion `left == right` failed: stderr: anomalyx: error: unsupported or unrecognized input format: 

  left: 2
 right: 1

failures:
    explain_resolves_a_cell_handle
    scan_clean_exits_zero_with_no_rows
    scan_dash_reads_stdin
    scan_outlier_exits_one_with_a_finding
    scan_reads_from_a_file_path_not_stdin

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
