*** crates/ax-cli/src/main.rs:78:20: replace match guard p != "-" with true in read_input

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace match guard p != "-" with true in read_input
@@ -70,17 +70,17 @@
      \x20 anomalyx explain <HANDLE> [PATH]   Resolve a finding handle to evidence\n\
      \n\
      EXIT: 0 clean · 1 anomalies found · 2 error"
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
     match path {
-        Some(p) if p != "-" => {
+        Some(p) if true /* ~ changed by cargo-mutants ~ */ => {
             let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
             Ok((p.clone(), bytes))
         }
         _ => {
             let mut buf = Vec::new();
             std::io::stdin()
                 .read_to_end(&mut buf)
                 .map_err(|e| AxError::Io(format!("stdin: {e}")))?;

---- scan_dash_reads_stdin stdout ----

thread 'scan_dash_reads_stdin' (1223264) panicked at crates/ax-cli/tests/cli.rs:100:5:
assertion `left == right` failed: stderr: anomalyx: error: io error: -: No such file or directory (os error 2)

  left: 2
 right: 1

---- explain_resolves_a_cell_handle stdout ----

thread 'explain_resolves_a_cell_handle' (1223260) panicked at crates/ax-cli/tests/cli.rs:106:5:
assertion `left == right` failed: stderr: anomalyx: error: io error: -: No such file or directory (os error 2)

  left: 2
 right: 0

failures:
    explain_resolves_a_cell_handle
    scan_dash_reads_stdin

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
