*** crates/ax-cli/src/main.rs:79:5: replace split_baseline -> Result<(Option<String>, Vec<String>), AxError> with Ok((Some(String::new()), vec![String::new()]))

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace split_baseline -> Result<(Option<String>, Vec<String>), AxError> with Ok((Some(String::new()), vec![String::new()]))
@@ -71,30 +71,17 @@
      \n\
      With --baseline, distributional drift and schema-diff are compared against B.\n\
      EXIT: 0 clean · 1 anomalies found · 2 error"
 }
 
 /// Extracts `--baseline <PATH>` from `args`, returning the baseline path and the
 /// remaining positional arguments. Fails cleanly if the flag has no value.
 fn split_baseline(args: &[String]) -> Result<(Option<String>, Vec<String>), AxError> {
-    let mut baseline = None;
-    let mut positional = Vec::new();
-    let mut it = args.iter();
-    while let Some(arg) = it.next() {
-        if arg == "--baseline" {
-            let value = it
-                .next()
-                .ok_or_else(|| AxError::Config("--baseline requires a path".into()))?;
-            baseline = Some(value.clone());
-        } else {
-            positional.push(arg.clone());
-        }
-    }
-    Ok((baseline, positional))
+    Ok((Some(String::new()), vec![String::new()])) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
     match path {
         Some(p) if p != "-" => {
             let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
             Ok((p.clone(), bytes))

---- tests::split_baseline_errors_without_value stdout ----

thread 'tests::split_baseline_errors_without_value' (1739362) panicked at crates/ax-cli/src/main.rs:396:9:
assertion failed: split_baseline(&strings(&["--baseline"])).is_err()

---- tests::split_baseline_none_when_absent stdout ----

thread 'tests::split_baseline_none_when_absent' (1739364) panicked at crates/ax-cli/src/main.rs:390:9:
assertion `left == right` failed
  left: Some("")
 right: None

---- tests::split_baseline_extracts_flag_and_positionals stdout ----

thread 'tests::split_baseline_extracts_flag_and_positionals' (1739363) panicked at crates/ax-cli/src/main.rs:383:9:
assertion `left == right` failed
  left: Some("")
 right: Some("base.csv")

failures:
    tests::split_baseline_errors_without_value
    tests::split_baseline_extracts_flag_and_positionals
    tests::split_baseline_none_when_absent

test result: FAILED. 9 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
