*** crates/ax-cli/src/main.rs:83:16: replace == with != in split_baseline

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace == with != in split_baseline
@@ -75,17 +75,17 @@
 
 /// Extracts `--baseline <PATH>` from `args`, returning the baseline path and the
 /// remaining positional arguments. Fails cleanly if the flag has no value.
 fn split_baseline(args: &[String]) -> Result<(Option<String>, Vec<String>), AxError> {
     let mut baseline = None;
     let mut positional = Vec::new();
     let mut it = args.iter();
     while let Some(arg) = it.next() {
-        if arg == "--baseline" {
+        if arg != /* ~ changed by cargo-mutants ~ */ "--baseline" {
             let value = it
                 .next()
                 .ok_or_else(|| AxError::Config("--baseline requires a path".into()))?;
             baseline = Some(value.clone());
         } else {
             positional.push(arg.clone());
         }
     }

---- tests::split_baseline_errors_without_value stdout ----

thread 'tests::split_baseline_errors_without_value' (1740757) panicked at crates/ax-cli/src/main.rs:409:9:
assertion failed: split_baseline(&strings(&["--baseline"])).is_err()

---- tests::split_baseline_extracts_flag_and_positionals stdout ----

thread 'tests::split_baseline_extracts_flag_and_positionals' (1740758) panicked at crates/ax-cli/src/main.rs:396:9:
assertion `left == right` failed
  left: Some("cur.csv")
 right: Some("base.csv")

---- tests::split_baseline_none_when_absent stdout ----

thread 'tests::split_baseline_none_when_absent' (1740759) panicked at crates/ax-cli/src/main.rs:402:63:
called `Result::unwrap()` on an `Err` value: Config("--baseline requires a path")

failures:
    tests::split_baseline_errors_without_value
    tests::split_baseline_extracts_flag_and_positionals
    tests::split_baseline_none_when_absent

test result: FAILED. 9 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
