*** crates/ax-cli/src/main.rs:97:5: replace read_input -> Result<(String, Vec<u8>), AxError> with Ok(("xyzzy".into(), vec![0]))

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace read_input -> Result<(String, Vec<u8>), AxError> with Ok(("xyzzy".into(), vec![0]))
@@ -89,29 +89,17 @@
             positional.push(arg.clone());
         }
     }
     Ok((baseline, positional))
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
-    match path {
-        Some(p) if p != "-" => {
-            let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
-            Ok((p.clone(), bytes))
-        }
-        _ => {
-            let mut buf = Vec::new();
-            std::io::stdin()
-                .read_to_end(&mut buf)
-                .map_err(|e| AxError::Io(format!("stdin: {e}")))?;
-            Ok(("-".to_string(), buf))
-        }
-    }
+    Ok(("xyzzy".into(), vec![0])) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalizes the optional baseline corpus from its path.
 fn load_baseline(path: &Option<String>) -> Result<Option<RecordSet>, AxError> {
     match path {
         Some(p) => {
             let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
             Ok(Some(ax_normalize::normalize(p, &bytes)?))

---- explain_resolves_a_cell_handle stdout ----

thread 'explain_resolves_a_cell_handle' (1742209) panicked at crates/ax-cli/tests/cli.rs:109:5:
assertion `left == right` failed: stderr: anomalyx: error: handle does not resolve against this corpus: cell:amount:8

  left: 2
 right: 0

---- scan_dash_reads_stdin stdout ----

thread 'scan_dash_reads_stdin' (1742217) panicked at crates/ax-cli/tests/cli.rs:103:5:
assertion `left == right` failed: stderr: 
  left: 0
 right: 1

---- scan_baseline_mode_detects_drift stdout ----

thread 'scan_baseline_mode_detects_drift' (1742213) panicked at crates/ax-cli/tests/cli.rs:160:5:
assertion failed: detectors.contains(&"dist.ks")

failures:
    explain_resolves_a_cell_handle
    scan_baseline_mode_detects_drift
    scan_dash_reads_stdin
    scan_outlier_exits_one_with_a_finding
    scan_reads_from_a_file_path_not_stdin

test result: FAILED. 7 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
