*** crates/ax-cli/src/main.rs:98:22: replace != with == in read_input

*** mutation diff:
--- crates/ax-cli/src/main.rs
+++ replace != with == in read_input
@@ -90,17 +90,17 @@
         }
     }
     Ok((baseline, positional))
 }
 
 /// Reads the input corpus: a path argument, or stdin when absent or `-`.
 fn read_input(path: Option<&String>) -> Result<(String, Vec<u8>), AxError> {
     match path {
-        Some(p) if p != "-" => {
+        Some(p) if p == /* ~ changed by cargo-mutants ~ */ "-" => {
             let bytes = std::fs::read(p).map_err(|e| AxError::Io(format!("{p}: {e}")))?;
             Ok((p.clone(), bytes))
         }
         _ => {
             let mut buf = Vec::new();
             std::io::stdin()
                 .read_to_end(&mut buf)
                 .map_err(|e| AxError::Io(format!("stdin: {e}")))?;

---- scan_dash_reads_stdin stdout ----

thread 'scan_dash_reads_stdin' (1743406) panicked at crates/ax-cli/tests/cli.rs:103:5:
assertion `left == right` failed: stderr: anomalyx: error: io error: -: No such file or directory (os error 2)

  left: 2
 right: 1

---- scan_baseline_mode_detects_drift stdout ----

thread 'scan_baseline_mode_detects_drift' (1743402) panicked at crates/ax-cli/tests/cli.rs:150:5:
assertion `left == right` failed: stderr: anomalyx: error: unsupported or unrecognized input format: -

  left: 2
 right: 1

---- explain_resolves_a_cell_handle stdout ----

thread 'explain_resolves_a_cell_handle' (1743400) panicked at crates/ax-cli/tests/cli.rs:109:5:
assertion `left == right` failed: stderr: anomalyx: error: io error: -: No such file or directory (os error 2)

  left: 2
 right: 0

failures:
    explain_resolves_a_cell_handle
    scan_baseline_mode_detects_drift
    scan_dash_reads_stdin
    scan_reads_from_a_file_path_not_stdin

test result: FAILED. 8 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
