*** crates/ax-core/src/det.rs:100:5: replace mad -> Option<f64> with Some(1.0)

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace mad -> Option<f64> with Some(1.0)
@@ -92,19 +92,17 @@
 /// Median (the 0.5 quantile).
 pub fn median(xs: &[f64]) -> Option<f64> {
     quantile(xs, 0.5)
 }
 
 /// Median absolute deviation, scaled to be a consistent estimator of σ for
 /// normal data (factor `1.4826`). `None` for an empty slice.
 pub fn mad(xs: &[f64]) -> Option<f64> {
-    let med = median(xs)?;
-    let dev: Vec<f64> = xs.iter().map(|x| (x - med).abs()).collect();
-    median(&dev).map(|m| 1.4826 * m)
+    Some(1.0) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn det_sum_is_permutation_invariant() {

---- det::tests::mad_of_constant_is_zero stdout ----

thread 'det::tests::mad_of_constant_is_zero' (1003527) panicked at crates/ax-core/src/det.rs:136:9:
assertion `left == right` failed
  left: Some(1.0)
 right: Some(0.0)

failures:
    det::tests::mad_of_constant_is_zero

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
