*** crates/ax-core/src/det.rs:101:46: replace - with + in mad

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace - with + in mad
@@ -93,17 +93,17 @@
 pub fn median(xs: &[f64]) -> Option<f64> {
     quantile(xs, 0.5)
 }
 
 /// Median absolute deviation, scaled to be a consistent estimator of σ for
 /// normal data (factor `1.4826`). `None` for an empty slice.
 pub fn mad(xs: &[f64]) -> Option<f64> {
     let med = median(xs)?;
-    let dev: Vec<f64> = xs.iter().map(|x| (x - med).abs()).collect();
+    let dev: Vec<f64> = xs.iter().map(|x| (x + /* ~ changed by cargo-mutants ~ */ med).abs()).collect();
     median(&dev).map(|m| 1.4826 * m)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- det::tests::mad_of_constant_is_zero stdout ----

thread 'det::tests::mad_of_constant_is_zero' (1004123) panicked at crates/ax-core/src/det.rs:138:9:
assertion `left == right` failed
  left: Some(20.7564)
 right: Some(0.0)

failures:
    det::tests::mad_of_constant_is_zero

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
