*** crates/ax-core/src/det.rs:108:5: replace mad -> Option<f64> with Some(0.0)

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace mad -> Option<f64> with Some(0.0)
@@ -100,19 +100,17 @@
 /// Median (the 0.5 quantile).
 pub fn median(xs: &[f64]) -> Option<f64> {
     quantile(xs, 0.5)
 }
 
 /// Median absolute deviation, scaled to be a consistent estimator of σ for
 /// normal data (factor `1.4826`). `None` for an empty slice.
 pub fn mad(xs: &[f64]) -> Option<f64> {
-    let med = median(xs)?;
-    let dev: Vec<f64> = xs.iter().map(|x| (x - med).abs()).collect();
-    median(&dev).map(|m| 1.4826 * m)
+    Some(0.0) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn finite_drops_non_finite_keeps_order() {

---- det::tests::mad_of_spread_is_nonzero_exact stdout ----

thread 'det::tests::mad_of_spread_is_nonzero_exact' (1150262) panicked at crates/ax-core/src/det.rs:161:9:
assertion `left == right` failed
  left: Some(0.0)
 right: Some(1.4826)

failures:
    det::tests::mad_of_spread_is_nonzero_exact

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
