*** crates/ax-core/src/det.rs:110:33: replace * with + in mad

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace * with + in mad
@@ -102,17 +102,17 @@
     quantile(xs, 0.5)
 }
 
 /// Median absolute deviation, scaled to be a consistent estimator of σ for
 /// normal data (factor `1.4826`). `None` for an empty slice.
 pub fn mad(xs: &[f64]) -> Option<f64> {
     let med = median(xs)?;
     let dev: Vec<f64> = xs.iter().map(|x| (x - med).abs()).collect();
-    median(&dev).map(|m| 1.4826 * m)
+    median(&dev).map(|m| 1.4826 + /* ~ changed by cargo-mutants ~ */ m)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn finite_drops_non_finite_keeps_order() {

---- det::tests::mad_of_spread_is_nonzero_exact stdout ----

thread 'det::tests::mad_of_spread_is_nonzero_exact' (1151719) panicked at crates/ax-core/src/det.rs:163:9:
assertion `left == right` failed
  left: Some(2.4825999999999997)
 right: Some(1.4826)

---- det::tests::mad_of_constant_is_zero stdout ----

thread 'det::tests::mad_of_constant_is_zero' (1151718) panicked at crates/ax-core/src/det.rs:187:9:
assertion `left == right` failed
  left: Some(1.4826)
 right: Some(0.0)

failures:
    det::tests::mad_of_constant_is_zero
    det::tests::mad_of_spread_is_nonzero_exact

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
