*** crates/ax-core/src/det.rs:17:5: replace finite -> Vec<f64> with vec![]

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace finite -> Vec<f64> with vec![]
@@ -9,17 +9,17 @@
 //! bits, regardless of how the caller arranged them.
 //!
 //! NaNs are never silently folded into a statistic; callers strip them first
 //! (see [`finite`]). This keeps "honest absence" honest: a column that is all
 //! NaN yields `None`, not a fabricated `0.0`.
 
 /// Returns the subset of `xs` that is finite (no NaN, no ±∞), preserving order.
 pub fn finite(xs: &[f64]) -> Vec<f64> {
-    xs.iter().copied().filter(|x| x.is_finite()).collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Order-independent compensated sum.
 ///
 /// Values are sorted by [`f64::total_cmp`] so that any permutation of the same
 /// inputs produces the same bit pattern, then accumulated with the Neumaier
 /// variant of Kahan summation to bound rounding error.
 pub fn det_sum(xs: &[f64]) -> f64 {

*** result: Success
