*** crates/ax-core/src/det.rs:17:5: replace finite -> Vec<f64> with vec![1.0]

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace finite -> Vec<f64> with vec![1.0]
@@ -9,17 +9,17 @@
 //! bits, regardless of how the caller arranged them.
 //!
 //! NaNs are never silently folded into a statistic; callers strip them first
 //! (see [`finite`]). This keeps "honest absence" honest: a column that is all
 //! NaN yields `None`, not a fabricated `0.0`.
 
 /// Returns the subset of `xs` that is finite (no NaN, no ±∞), preserving order.
 pub fn finite(xs: &[f64]) -> Vec<f64> {
-    xs.iter().copied().filter(|x| x.is_finite()).collect()
+    vec![1.0] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Order-independent compensated sum.
 ///
 /// Values are sorted by [`f64::total_cmp`] so that any permutation of the same
 /// inputs produces the same bit pattern, then accumulated with the Neumaier
 /// variant of Kahan summation to bound rounding error.
 pub fn det_sum(xs: &[f64]) -> f64 {

---- det::tests::finite_drops_non_finite_keeps_order stdout ----

thread 'det::tests::finite_drops_non_finite_keeps_order' (1129070) panicked at crates/ax-core/src/det.rs:120:9:
assertion `left == right` failed
  left: [1.0]
 right: [1.0, 2.0, 3.0]

failures:
    det::tests::finite_drops_non_finite_keeps_order

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
