*** crates/ax-core/src/det.rs:26:5: replace det_sum -> f64 with 1.0

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace det_sum -> f64 with 1.0
@@ -18,30 +18,17 @@
 }
 
 /// Order-independent compensated sum.
 ///
 /// Values are sorted by [`f64::total_cmp`] so that any permutation of the same
 /// inputs produces the same bit pattern, then accumulated with the Neumaier
 /// variant of Kahan summation to bound rounding error.
 pub fn det_sum(xs: &[f64]) -> f64 {
-    let mut sorted: Vec<f64> = xs.to_vec();
-    sorted.sort_by(|a, b| a.total_cmp(b));
-    let mut sum = 0.0_f64;
-    let mut comp = 0.0_f64; // running compensation
-    for &x in &sorted {
-        let t = sum + x;
-        if sum.abs() >= x.abs() {
-            comp += (sum - t) + x;
-        } else {
-            comp += (x - t) + sum;
-        }
-        sum = t;
-    }
-    sum + comp
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {
     if xs.is_empty() {
         return None;
     }
     Some(det_sum(xs) / xs.len() as f64)

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (984085) panicked at crates/ax-core/src/det.rs:112:9:
assertion `left == right` failed
  left: Some(1.0)
 right: Some(2.0)

failures:
    det::tests::variance_needs_two

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
