*** crates/ax-core/src/det.rs:26:5: replace det_sum -> f64 with -1.0

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace det_sum -> f64 with -1.0
@@ -18,30 +18,17 @@
 }
 
 /// Order-independent compensated sum.
 ///
 /// Values are sorted by [`f64::total_cmp`] so that any permutation of the same
 /// inputs produces the same bit pattern, then accumulated with the Neumaier
 /// variant of Kahan summation to bound rounding error.
 pub fn det_sum(xs: &[f64]) -> f64 {
-    let mut sorted: Vec<f64> = xs.to_vec();
-    sorted.sort_by(|a, b| a.total_cmp(b));
-    let mut sum = 0.0_f64;
-    let mut comp = 0.0_f64; // running compensation
-    for &x in &sorted {
-        let t = sum + x;
-        if sum.abs() >= x.abs() {
-            comp += (sum - t) + x;
-        } else {
-            comp += (x - t) + sum;
-        }
-        sum = t;
-    }
-    sum + comp
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {
     if xs.is_empty() {
         return None;
     }
     Some(det_sum(xs) / xs.len() as f64)

---- det::tests::det_sum_else_branch_compensation_is_exact stdout ----

thread 'det::tests::det_sum_else_branch_compensation_is_exact' (1130230) panicked at crates/ax-core/src/det.rs:129:9:
assertion `left == right` failed
  left: -1.0
 right: 0.6

---- det::tests::det_sum_compensation_recovers_small_term stdout ----

thread 'det::tests::det_sum_compensation_recovers_small_term' (1130229) panicked at crates/ax-core/src/det.rs:120:9:
assertion `left == right` failed
  left: -1.0
 right: 1.0

---- det::tests::det_sum_exact_value stdout ----

thread 'det::tests::det_sum_exact_value' (1130231) panicked at crates/ax-core/src/det.rs:112:9:
assertion `left == right` failed
  left: -1.0
 right: 10.0

failures:
    det::tests::det_sum_compensation_recovers_small_term
    det::tests::det_sum_else_branch_compensation_is_exact
    det::tests::det_sum_exact_value
    det::tests::variance_and_std_exact
    det::tests::variance_needs_two

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
