*** crates/ax-core/src/det.rs:32:22: replace >= with < in det_sum

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace >= with < in det_sum
@@ -24,17 +24,17 @@
 /// variant of Kahan summation to bound rounding error.
 pub fn det_sum(xs: &[f64]) -> f64 {
     let mut sorted: Vec<f64> = xs.to_vec();
     sorted.sort_by(|a, b| a.total_cmp(b));
     let mut sum = 0.0_f64;
     let mut comp = 0.0_f64; // running compensation
     for &x in &sorted {
         let t = sum + x;
-        if sum.abs() >= x.abs() {
+        if sum.abs() < /* ~ changed by cargo-mutants ~ */ x.abs() {
             comp += (sum - t) + x;
         } else {
             comp += (x - t) + sum;
         }
         sum = t;
     }
     sum + comp
 }

*** result: Success
