*** crates/ax-core/src/det.rs:33:26: replace - with + in det_sum

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace - with + in det_sum
@@ -25,17 +25,17 @@
 pub fn det_sum(xs: &[f64]) -> f64 {
     let mut sorted: Vec<f64> = xs.to_vec();
     sorted.sort_by(|a, b| a.total_cmp(b));
     let mut sum = 0.0_f64;
     let mut comp = 0.0_f64; // running compensation
     for &x in &sorted {
         let t = sum + x;
         if sum.abs() >= x.abs() {
-            comp += (sum - t) + x;
+            comp += (sum + /* ~ changed by cargo-mutants ~ */ t) + x;
         } else {
             comp += (x - t) + sum;
         }
         sum = t;
     }
     sum + comp
 }

---- det::tests::det_sum_compensation_recovers_small_term stdout ----

thread 'det::tests::det_sum_compensation_recovers_small_term' (1132560) panicked at crates/ax-core/src/det.rs:133:9:
assertion `left == right` failed
  left: -2e16
 right: 1.0

---- det::tests::det_sum_exact_value stdout ----

thread 'det::tests::det_sum_exact_value' (1132562) panicked at crates/ax-core/src/det.rs:125:9:
assertion `left == right` failed
  left: 42.0
 right: 10.0

---- det::tests::det_sum_else_branch_compensation_is_exact stdout ----

thread 'det::tests::det_sum_else_branch_compensation_is_exact' (1132561) panicked at crates/ax-core/src/det.rs:142:9:
assertion `left == right` failed
  left: 1.8000000000000003
 right: 0.6

failures:
    det::tests::det_sum_compensation_recovers_small_term
    det::tests::det_sum_else_branch_compensation_is_exact
    det::tests::det_sum_exact_value
    det::tests::variance_and_std_exact
    det::tests::variance_needs_two

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
