*** crates/ax-core/src/det.rs:35:18: replace += with -= in det_sum

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace += with -= in det_sum
@@ -27,17 +27,17 @@
     sorted.sort_by(|a, b| a.total_cmp(b));
     let mut sum = 0.0_f64;
     let mut comp = 0.0_f64; // running compensation
     for &x in &sorted {
         let t = sum + x;
         if sum.abs() >= x.abs() {
             comp += (sum - t) + x;
         } else {
-            comp += (x - t) + sum;
+            comp -= /* ~ changed by cargo-mutants ~ */ (x - t) + sum;
         }
         sum = t;
     }
     sum + comp
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {

*** result: Success
