*** crates/ax-core/src/det.rs:35:24: replace - with + in det_sum

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace - with + in det_sum
@@ -27,17 +27,17 @@
     sorted.sort_by(|a, b| a.total_cmp(b));
     let mut sum = 0.0_f64;
     let mut comp = 0.0_f64; // running compensation
     for &x in &sorted {
         let t = sum + x;
         if sum.abs() >= x.abs() {
             comp += (sum - t) + x;
         } else {
-            comp += (x - t) + sum;
+            comp += (x + /* ~ changed by cargo-mutants ~ */ t) + sum;
         }
         sum = t;
     }
     sum + comp
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (988101) panicked at crates/ax-core/src/det.rs:125:9:
assertion `left == right` failed
  left: Some(488.0)
 right: Some(2.0)

failures:
    det::tests::variance_needs_two

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
