*** crates/ax-core/src/det.rs:35:29: replace + with - in det_sum

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace + with - in det_sum
@@ -27,17 +27,17 @@
     sorted.sort_by(|a, b| a.total_cmp(b));
     let mut sum = 0.0_f64;
     let mut comp = 0.0_f64; // running compensation
     for &x in &sorted {
         let t = sum + x;
         if sum.abs() >= x.abs() {
             comp += (sum - t) + x;
         } else {
-            comp += (x - t) + sum;
+            comp += (x - t) - /* ~ changed by cargo-mutants ~ */ sum;
         }
         sum = t;
     }
     sum + comp
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {

---- det::tests::det_sum_else_branch_compensation_is_exact stdout ----

thread 'det::tests::det_sum_else_branch_compensation_is_exact' (1133721) panicked at crates/ax-core/src/det.rs:142:9:
assertion `left == right` failed
  left: 0.4
 right: 0.6

---- det::tests::det_sum_exact_value stdout ----

thread 'det::tests::det_sum_exact_value' (1133722) panicked at crates/ax-core/src/det.rs:125:9:
assertion `left == right` failed
  left: 8.0
 right: 10.0

---- det::tests::variance_and_std_exact stdout ----

thread 'det::tests::variance_and_std_exact' (1133729) panicked at crates/ax-core/src/det.rs:156:9:
assertion `left == right` failed
  left: Some(4.000000000000001)
 right: Some(4.0)

failures:
    det::tests::det_sum_else_branch_compensation_is_exact
    det::tests::det_sum_exact_value
    det::tests::variance_and_std_exact
    det::tests::variance_needs_two

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
