*** crates/ax-core/src/det.rs:39:9: replace + with - in det_sum

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace + with - in det_sum
@@ -31,17 +31,17 @@
         let t = sum + x;
         if sum.abs() >= x.abs() {
             comp += (sum - t) + x;
         } else {
             comp += (x - t) + sum;
         }
         sum = t;
     }
-    sum + comp
+    sum - /* ~ changed by cargo-mutants ~ */ comp
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {
     if xs.is_empty() {
         return None;
     }
     Some(det_sum(xs) / xs.len() as f64)

---- det::tests::det_sum_compensation_recovers_small_term stdout ----

thread 'det::tests::det_sum_compensation_recovers_small_term' (1134953) panicked at crates/ax-core/src/det.rs:133:9:
assertion `left == right` failed
  left: -1.0
 right: 1.0

---- det::tests::det_sum_else_branch_compensation_is_exact stdout ----

thread 'det::tests::det_sum_else_branch_compensation_is_exact' (1134954) panicked at crates/ax-core/src/det.rs:142:9:
assertion `left == right` failed
  left: 0.6000000000000002
 right: 0.6

failures:
    det::tests::det_sum_compensation_recovers_small_term
    det::tests::det_sum_else_branch_compensation_is_exact

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
