*** crates/ax-core/src/det.rs:39:9: replace + with * in det_sum

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace + with * in det_sum
@@ -31,17 +31,17 @@
         let t = sum + x;
         if sum.abs() >= x.abs() {
             comp += (sum - t) + x;
         } else {
             comp += (x - t) + sum;
         }
         sum = t;
     }
-    sum + comp
+    sum * /* ~ changed by cargo-mutants ~ */ comp
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {
     if xs.is_empty() {
         return None;
     }
     Some(det_sum(xs) / xs.len() as f64)

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (988969) panicked at crates/ax-core/src/det.rs:125:9:
assertion `left == right` failed
  left: Some(0.0)
 right: Some(2.0)

failures:
    det::tests::variance_needs_two

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
