*** crates/ax-core/src/det.rs:44:5: replace mean -> Option<f64> with Some(0.0)

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace mean -> Option<f64> with Some(0.0)
@@ -36,20 +36,17 @@
         }
         sum = t;
     }
     sum + comp
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {
-    if xs.is_empty() {
-        return None;
-    }
-    Some(det_sum(xs) / xs.len() as f64)
+    Some(0.0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Sample variance (Bessel-corrected, denominator `n - 1`).
 ///
 /// Returns `None` for fewer than two values, where sample variance is undefined.
 pub fn variance(xs: &[f64]) -> Option<f64> {
     let n = xs.len();
     if n < 2 {

---- det::tests::mean_of_empty_is_none stdout ----

thread 'det::tests::mean_of_empty_is_none' (989502) panicked at crates/ax-core/src/det.rs:116:9:
assertion `left == right` failed
  left: Some(0.0)
 right: None

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (989504) panicked at crates/ax-core/src/det.rs:122:9:
assertion `left == right` failed
  left: Some(20.0)
 right: Some(2.0)

failures:
    det::tests::mean_of_empty_is_none
    det::tests::variance_needs_two

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
