*** crates/ax-core/src/det.rs:47:22: replace / with % in mean

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace / with % in mean
@@ -39,17 +39,17 @@
     sum + comp
 }
 
 /// Arithmetic mean, or `None` if `xs` is empty.
 pub fn mean(xs: &[f64]) -> Option<f64> {
     if xs.is_empty() {
         return None;
     }
-    Some(det_sum(xs) / xs.len() as f64)
+    Some(det_sum(xs) % /* ~ changed by cargo-mutants ~ */ xs.len() as f64)
 }
 
 /// Sample variance (Bessel-corrected, denominator `n - 1`).
 ///
 /// Returns `None` for fewer than two values, where sample variance is undefined.
 pub fn variance(xs: &[f64]) -> Option<f64> {
     let n = xs.len();
     if n < 2 {

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (990326) panicked at crates/ax-core/src/det.rs:125:9:
assertion `left == right` failed
  left: Some(20.0)
 right: Some(2.0)

failures:
    det::tests::variance_needs_two

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
