*** crates/ax-core/src/det.rs:54:5: replace variance -> Option<f64> with Some(1.0)

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace variance -> Option<f64> with Some(1.0)
@@ -46,31 +46,17 @@
     }
     Some(det_sum(xs) / xs.len() as f64)
 }
 
 /// Sample variance (Bessel-corrected, denominator `n - 1`).
 ///
 /// Returns `None` for fewer than two values, where sample variance is undefined.
 pub fn variance(xs: &[f64]) -> Option<f64> {
-    let n = xs.len();
-    if n < 2 {
-        return None;
-    }
-    let m = mean(xs)?;
-    // Compute the deviation once: writing `(x - m) * (x - m)` would let a single
-    // sign flip become an equivalent mutant, since Σ(x+m)(x−m) == Σ(x−m)².
-    let sq: Vec<f64> = xs
-        .iter()
-        .map(|x| {
-            let d = x - m;
-            d * d
-        })
-        .collect();
-    Some(det_sum(&sq) / (n - 1) as f64)
+    Some(1.0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Sample standard deviation. `None` for fewer than two values.
 pub fn std_dev(xs: &[f64]) -> Option<f64> {
     variance(xs).map(f64::sqrt)
 }
 
 /// Quantile via linear interpolation (the "type 7" / NumPy default method).

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (1137875) panicked at crates/ax-core/src/det.rs:159:9:
assertion `left == right` failed
  left: Some(1.0)
 right: None

---- det::tests::variance_and_std_exact stdout ----

thread 'det::tests::variance_and_std_exact' (1137874) panicked at crates/ax-core/src/det.rs:142:9:
assertion `left == right` failed
  left: Some(1.0)
 right: Some(4.0)

failures:
    det::tests::variance_and_std_exact
    det::tests::variance_needs_two

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
