*** crates/ax-core/src/det.rs:55:10: replace < with == in variance

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace < with == in variance
@@ -47,17 +47,17 @@
     Some(det_sum(xs) / xs.len() as f64)
 }
 
 /// Sample variance (Bessel-corrected, denominator `n - 1`).
 ///
 /// Returns `None` for fewer than two values, where sample variance is undefined.
 pub fn variance(xs: &[f64]) -> Option<f64> {
     let n = xs.len();
-    if n < 2 {
+    if n == /* ~ changed by cargo-mutants ~ */ 2 {
         return None;
     }
     let m = mean(xs)?;
     // Compute the deviation once: writing `(x - m) * (x - m)` would let a single
     // sign flip become an equivalent mutant, since Σ(x+m)(x−m) == Σ(x−m)².
     let sq: Vec<f64> = xs
         .iter()
         .map(|x| {

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (1138460) panicked at crates/ax-core/src/det.rs:173:9:
assertion `left == right` failed
  left: Some(NaN)
 right: None

failures:
    det::tests::variance_needs_two

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
