*** crates/ax-core/src/det.rs:55:10: replace < with <= in variance

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace < with <= in variance
@@ -47,17 +47,17 @@
     Some(det_sum(xs) / xs.len() as f64)
 }
 
 /// Sample variance (Bessel-corrected, denominator `n - 1`).
 ///
 /// Returns `None` for fewer than two values, where sample variance is undefined.
 pub fn variance(xs: &[f64]) -> Option<f64> {
     let n = xs.len();
-    if n < 2 {
+    if n <= /* ~ changed by cargo-mutants ~ */ 2 {
         return None;
     }
     let m = mean(xs)?;
     let sq: Vec<f64> = xs.iter().map(|x| (x - m) * (x - m)).collect();
     Some(det_sum(&sq) / (n - 1) as f64)
 }
 
 /// Sample standard deviation. `None` for fewer than two values.

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (992454) panicked at crates/ax-core/src/det.rs:125:9:
assertion `left == right` failed
  left: None
 right: Some(2.0)

failures:
    det::tests::variance_needs_two

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
