*** crates/ax-core/src/det.rs:60:23: replace / with * in variance

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace / with * in variance
@@ -52,17 +52,17 @@
 /// Returns `None` for fewer than two values, where sample variance is undefined.
 pub fn variance(xs: &[f64]) -> Option<f64> {
     let n = xs.len();
     if n < 2 {
         return None;
     }
     let m = mean(xs)?;
     let sq: Vec<f64> = xs.iter().map(|x| (x - m) * (x - m)).collect();
-    Some(det_sum(&sq) / (n - 1) as f64)
+    Some(det_sum(&sq) * /* ~ changed by cargo-mutants ~ */ (n - 1) as f64)
 }
 
 /// Sample standard deviation. `None` for fewer than two values.
 pub fn std_dev(xs: &[f64]) -> Option<f64> {
     variance(xs).map(f64::sqrt)
 }
 
 /// Quantile via linear interpolation (the "type 7" / NumPy default method).

*** result: Success
