*** crates/ax-core/src/det.rs:64:23: replace - with / in variance

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace - with / in variance
@@ -56,17 +56,17 @@
         return None;
     }
     let m = mean(xs)?;
     // Compute the deviation once: writing `(x - m) * (x - m)` would let a single
     // sign flip become an equivalent mutant, since Σ(x+m)(x−m) == Σ(x−m)².
     let sq: Vec<f64> = xs
         .iter()
         .map(|x| {
-            let d = x - m;
+            let d = x / /* ~ changed by cargo-mutants ~ */ m;
             d * d
         })
         .collect();
     Some(det_sum(&sq) / (n - 1) as f64)
 }
 
 /// Sample standard deviation. `None` for fewer than two values.
 pub fn std_dev(xs: &[f64]) -> Option<f64> {

---- det::tests::variance_and_std_exact stdout ----

thread 'det::tests::variance_and_std_exact' (1139622) panicked at crates/ax-core/src/det.rs:156:9:
assertion `left == right` failed
  left: Some(1.75)
 right: Some(4.0)

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (1139623) panicked at crates/ax-core/src/det.rs:174:9:
assertion `left == right` failed
  left: Some(2.2222222222222223)
 right: Some(2.0)

failures:
    det::tests::variance_and_std_exact
    det::tests::variance_needs_two

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
