*** crates/ax-core/src/det.rs:65:15: replace * with + in variance

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace * with + in variance
@@ -57,17 +57,17 @@
     }
     let m = mean(xs)?;
     // Compute the deviation once: writing `(x - m) * (x - m)` would let a single
     // sign flip become an equivalent mutant, since Σ(x+m)(x−m) == Σ(x−m)².
     let sq: Vec<f64> = xs
         .iter()
         .map(|x| {
             let d = x - m;
-            d * d
+            d + /* ~ changed by cargo-mutants ~ */ d
         })
         .collect();
     Some(det_sum(&sq) / (n - 1) as f64)
 }
 
 /// Sample standard deviation. `None` for fewer than two values.
 pub fn std_dev(xs: &[f64]) -> Option<f64> {
     variance(xs).map(f64::sqrt)

---- det::tests::variance_and_std_exact stdout ----

thread 'det::tests::variance_and_std_exact' (1139912) panicked at crates/ax-core/src/det.rs:156:9:
assertion `left == right` failed
  left: Some(0.0)
 right: Some(4.0)

---- det::tests::variance_needs_two stdout ----

thread 'det::tests::variance_needs_two' (1139913) panicked at crates/ax-core/src/det.rs:174:9:
assertion `left == right` failed
  left: Some(0.0)
 right: Some(2.0)

failures:
    det::tests::variance_and_std_exact
    det::tests::variance_needs_two

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
