*** crates/ax-core/src/det.rs:73:5: replace std_dev -> Option<f64> with Some(1.0)

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace std_dev -> Option<f64> with Some(1.0)
@@ -65,17 +65,17 @@
             d * d
         })
         .collect();
     Some(det_sum(&sq) / (n - 1) as f64)
 }
 
 /// Sample standard deviation. `None` for fewer than two values.
 pub fn std_dev(xs: &[f64]) -> Option<f64> {
-    variance(xs).map(f64::sqrt)
+    Some(1.0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Quantile via linear interpolation (the "type 7" / NumPy default method).
 ///
 /// `q` is clamped to `[0, 1]`. Returns `None` for an empty slice.
 pub fn quantile(xs: &[f64], q: f64) -> Option<f64> {
     if xs.is_empty() {
         return None;

---- det::tests::variance_and_std_exact stdout ----

thread 'det::tests::variance_and_std_exact' (1142311) panicked at crates/ax-core/src/det.rs:157:9:
assertion `left == right` failed
  left: Some(1.0)
 right: Some(2.0)

failures:
    det::tests::variance_and_std_exact

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
