*** crates/ax-core/src/det.rs:79:10: replace == with != in quantile

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace == with != in quantile
@@ -71,17 +71,17 @@
 pub fn quantile(xs: &[f64], q: f64) -> Option<f64> {
     if xs.is_empty() {
         return None;
     }
     let q = q.clamp(0.0, 1.0);
     let mut sorted: Vec<f64> = xs.to_vec();
     sorted.sort_by(|a, b| a.total_cmp(b));
     let n = sorted.len();
-    if n == 1 {
+    if n != /* ~ changed by cargo-mutants ~ */ 1 {
         return Some(sorted[0]);
     }
     let pos = q * (n - 1) as f64;
     let lo = pos.floor() as usize;
     let hi = pos.ceil() as usize;
     if lo == hi {
         return Some(sorted[lo]);
     }

---- det::tests::quantile_endpoints_and_middle stdout ----

thread 'det::tests::quantile_endpoints_and_middle' (997603) panicked at crates/ax-core/src/det.rs:132:9:
assertion `left == right` failed
  left: Some(1.0)
 right: Some(4.0)

failures:
    det::tests::quantile_endpoints_and_middle

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
