*** crates/ax-core/src/det.rs:80:5: replace quantile -> Option<f64> with Some(1.0)

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace quantile -> Option<f64> with Some(1.0)
@@ -72,34 +72,17 @@
 pub fn std_dev(xs: &[f64]) -> Option<f64> {
     variance(xs).map(f64::sqrt)
 }
 
 /// Quantile via linear interpolation (the "type 7" / NumPy default method).
 ///
 /// `q` is clamped to `[0, 1]`. Returns `None` for an empty slice.
 pub fn quantile(xs: &[f64], q: f64) -> Option<f64> {
-    if xs.is_empty() {
-        return None;
-    }
-    let q = q.clamp(0.0, 1.0);
-    let mut sorted: Vec<f64> = xs.to_vec();
-    sorted.sort_by(|a, b| a.total_cmp(b));
-    let n = sorted.len();
-    if n == 1 {
-        return Some(sorted[0]);
-    }
-    let pos = q * (n - 1) as f64;
-    let lo = pos.floor() as usize;
-    let hi = pos.ceil() as usize;
-    if lo == hi {
-        return Some(sorted[lo]);
-    }
-    let frac = pos - lo as f64;
-    Some(sorted[lo] * (1.0 - frac) + sorted[hi] * frac)
+    Some(1.0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Median (the 0.5 quantile).
 pub fn median(xs: &[f64]) -> Option<f64> {
     quantile(xs, 0.5)
 }
 
 /// Median absolute deviation, scaled to be a consistent estimator of σ for

---- det::tests::mad_of_constant_is_zero stdout ----

thread 'det::tests::mad_of_constant_is_zero' (1143470) panicked at crates/ax-core/src/det.rs:170:9:
assertion `left == right` failed
  left: Some(1.4826)
 right: Some(0.0)

---- det::tests::quantile_endpoints_and_middle stdout ----

thread 'det::tests::quantile_endpoints_and_middle' (1143473) panicked at crates/ax-core/src/det.rs:164:9:
assertion `left == right` failed
  left: Some(1.0)
 right: Some(4.0)

failures:
    det::tests::mad_of_constant_is_zero
    det::tests::quantile_endpoints_and_middle

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
