*** crates/ax-core/src/det.rs:82:17: replace * with + in quantile

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace * with + in quantile
@@ -74,17 +74,17 @@
     }
     let q = q.clamp(0.0, 1.0);
     let mut sorted: Vec<f64> = xs.to_vec();
     sorted.sort_by(|a, b| a.total_cmp(b));
     let n = sorted.len();
     if n == 1 {
         return Some(sorted[0]);
     }
-    let pos = q * (n - 1) as f64;
+    let pos = q + /* ~ changed by cargo-mutants ~ */ (n - 1) as f64;
     let lo = pos.floor() as usize;
     let hi = pos.ceil() as usize;
     if lo == hi {
         return Some(sorted[lo]);
     }
     let frac = pos - lo as f64;
     Some(sorted[lo] * (1.0 - frac) + sorted[hi] * frac)
 }

---- det::tests::quantile_endpoints_and_middle stdout ----

thread 'det::tests::quantile_endpoints_and_middle' (997870) panicked at crates/ax-core/src/det.rs:131:9:
assertion `left == right` failed
  left: Some(4.0)
 right: Some(1.0)

---- det::tests::mad_of_constant_is_zero stdout ----

thread 'det::tests::mad_of_constant_is_zero' (997868) panicked at crates/ax-core/src/det.rs:89:44:
index out of bounds: the len is 3 but the index is 3

failures:
    det::tests::mad_of_constant_is_zero
    det::tests::quantile_endpoints_and_middle

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
