*** crates/ax-core/src/det.rs:90:22: replace - with + in quantile

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace - with + in quantile
@@ -82,17 +82,17 @@
     }
     let q = q.clamp(0.0, 1.0);
     let mut sorted: Vec<f64> = xs.to_vec();
     sorted.sort_by(|a, b| a.total_cmp(b));
     let n = sorted.len();
     if n == 1 {
         return Some(sorted[0]);
     }
-    let pos = q * (n - 1) as f64;
+    let pos = q * (n + /* ~ changed by cargo-mutants ~ */ 1) as f64;
     let lo = pos.floor() as usize;
     let hi = pos.ceil() as usize;
     if lo == hi {
         return Some(sorted[lo]);
     }
     let frac = pos - lo as f64;
     Some(sorted[lo] * (1.0 - frac) + sorted[hi] * frac)
 }

---- det::tests::mad_of_spread_is_nonzero_exact stdout ----

thread 'det::tests::mad_of_spread_is_nonzero_exact' (1144925) panicked at crates/ax-core/src/det.rs:163:9:
assertion `left == right` failed
  left: Some(2.9652)
 right: Some(1.4826)

---- det::tests::quantile_endpoints_and_middle stdout ----

thread 'det::tests::quantile_endpoints_and_middle' (1144927) panicked at crates/ax-core/src/det.rs:94:27:
index out of bounds: the len is 4 but the index is 5

failures:
    det::tests::mad_of_spread_is_nonzero_exact
    det::tests::quantile_endpoints_and_middle

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
