*** crates/ax-core/src/det.rs:94:5: replace median -> Option<f64> with Some(-1.0)

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace median -> Option<f64> with Some(-1.0)
@@ -86,17 +86,17 @@
         return Some(sorted[lo]);
     }
     let frac = pos - lo as f64;
     Some(sorted[lo] * (1.0 - frac) + sorted[hi] * frac)
 }
 
 /// Median (the 0.5 quantile).
 pub fn median(xs: &[f64]) -> Option<f64> {
-    quantile(xs, 0.5)
+    Some(-1.0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Median absolute deviation, scaled to be a consistent estimator of σ for
 /// normal data (factor `1.4826`). `None` for an empty slice.
 pub fn mad(xs: &[f64]) -> Option<f64> {
     let med = median(xs)?;
     let dev: Vec<f64> = xs.iter().map(|x| (x - med).abs()).collect();
     median(&dev).map(|m| 1.4826 * m)

---- det::tests::quantile_endpoints_and_middle stdout ----

thread 'det::tests::quantile_endpoints_and_middle' (1002724) panicked at crates/ax-core/src/det.rs:133:9:
assertion `left == right` failed
  left: Some(-1.0)
 right: Some(2.5)

---- det::tests::mad_of_constant_is_zero stdout ----

thread 'det::tests::mad_of_constant_is_zero' (1002722) panicked at crates/ax-core/src/det.rs:138:9:
assertion `left == right` failed
  left: Some(-1.4826)
 right: Some(0.0)

failures:
    det::tests::mad_of_constant_is_zero
    det::tests::quantile_endpoints_and_middle

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
