*** crates/ax-core/src/det.rs:97:36: replace + with * in quantile

*** mutation diff:
--- crates/ax-core/src/det.rs
+++ replace + with * in quantile
@@ -89,17 +89,17 @@
     }
     let pos = q * (n - 1) as f64;
     let lo = pos.floor() as usize;
     let hi = pos.ceil() as usize;
     if lo == hi {
         return Some(sorted[lo]);
     }
     let frac = pos - lo as f64;
-    Some(sorted[lo] * (1.0 - frac) + sorted[hi] * frac)
+    Some(sorted[lo] * (1.0 - frac) * /* ~ changed by cargo-mutants ~ */ sorted[hi] * frac)
 }
 
 /// Median (the 0.5 quantile).
 pub fn median(xs: &[f64]) -> Option<f64> {
     quantile(xs, 0.5)
 }
 
 /// Median absolute deviation, scaled to be a consistent estimator of σ for

---- det::tests::quantile_endpoints_and_middle stdout ----

thread 'det::tests::quantile_endpoints_and_middle' (1146740) panicked at crates/ax-core/src/det.rs:182:9:
assertion `left == right` failed
  left: Some(1.5)
 right: Some(2.5)

failures:
    det::tests::quantile_endpoints_and_middle

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
