*** crates/ax-core/src/dict.rs:27:9: replace Dict::intern -> u32 with 1

*** mutation diff:
--- crates/ax-core/src/dict.rs
+++ replace Dict::intern -> u32 with 1
@@ -19,23 +19,17 @@
 
 impl Dict {
     pub fn new() -> Self {
         Dict::default()
     }
 
     /// Returns the index for `s`, assigning the next index on first sight.
     pub fn intern(&mut self, s: &str) -> u32 {
-        if let Some(&i) = self.index.get(s) {
-            return i;
-        }
-        let i = self.table.len() as u32;
-        self.table.push(s.to_string());
-        self.index.insert(s.to_string(), i);
-        i
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolves an index back to its string, if present.
     pub fn get(&self, i: u32) -> Option<&str> {
         self.table.get(i as usize).map(String::as_str)
     }
 
     pub fn len(&self) -> usize {

---- dict::tests::is_empty_and_as_slice_track_contents stdout ----

thread 'dict::tests::is_empty_and_as_slice_track_contents' (1152642) panicked at crates/ax-core/src/dict.rs:76:9:
assertion failed: !d.is_empty()

---- dict::tests::intern_is_idempotent_and_ordered stdout ----

thread 'dict::tests::intern_is_idempotent_and_ordered' (1152641) panicked at crates/ax-core/src/dict.rs:62:9:
assertion `left == right` failed
  left: 1
 right: 0

---- envelope::tests::findings_set_anomalies_exit_and_max_severity stdout ----

thread 'envelope::tests::findings_set_anomalies_exit_and_max_severity' (1152647) panicked at crates/ax-core/src/envelope.rs:298:9:
assertion `left == right` failed
  left: None
 right: Some("critical")

failures:
    dict::tests::intern_is_idempotent_and_ordered
    dict::tests::is_empty_and_as_slice_track_contents
    envelope::tests::findings_set_anomalies_exit_and_max_severity

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
