*** crates/ax-core/src/dict.rs:38:9: replace Dict::get -> Option<&str> with Some("")

*** mutation diff:
--- crates/ax-core/src/dict.rs
+++ replace Dict::get -> Option<&str> with Some("")
@@ -30,17 +30,17 @@
         let i = self.table.len() as u32;
         self.table.push(s.to_string());
         self.index.insert(s.to_string(), i);
         i
     }
 
     /// Resolves an index back to its string, if present.
     pub fn get(&self, i: u32) -> Option<&str> {
-        self.table.get(i as usize).map(String::as_str)
+        Some("") /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn len(&self) -> usize {
         self.table.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.table.is_empty()

---- dict::tests::intern_is_idempotent_and_ordered stdout ----

thread 'dict::tests::intern_is_idempotent_and_ordered' (1153225) panicked at crates/ax-core/src/dict.rs:72:9:
assertion `left == right` failed
  left: Some("")
 right: Some("b")

---- envelope::tests::findings_set_anomalies_exit_and_max_severity stdout ----

thread 'envelope::tests::findings_set_anomalies_exit_and_max_severity' (1153231) panicked at crates/ax-core/src/envelope.rs:298:9:
assertion `left == right` failed
  left: Some("")
 right: Some("critical")

failures:
    dict::tests::intern_is_idempotent_and_ordered
    envelope::tests::findings_set_anomalies_exit_and_max_severity

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
