*** crates/ax-core/src/dict.rs:42:9: replace Dict::len -> usize with 0

*** mutation diff:
--- crates/ax-core/src/dict.rs
+++ replace Dict::len -> usize with 0
@@ -34,17 +34,17 @@
     }
 
     /// Resolves an index back to its string, if present.
     pub fn get(&self, i: u32) -> Option<&str> {
         self.table.get(i as usize).map(String::as_str)
     }
 
     pub fn len(&self) -> usize {
-        self.table.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.table.is_empty()
     }
 
     /// The backing table, for serialization into the envelope's `dict` field.
     pub fn as_slice(&self) -> &[String] {

---- dict::tests::intern_is_idempotent_and_ordered stdout ----

thread 'dict::tests::intern_is_idempotent_and_ordered' (1006495) panicked at crates/ax-core/src/dict.rs:71:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    dict::tests::intern_is_idempotent_and_ordered

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
