*** crates/ax-core/src/dict.rs:46:9: replace Dict::is_empty -> bool with true

*** mutation diff:
--- crates/ax-core/src/dict.rs
+++ replace Dict::is_empty -> bool with true
@@ -38,17 +38,17 @@
         self.table.get(i as usize).map(String::as_str)
     }
 
     pub fn len(&self) -> usize {
         self.table.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.table.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The backing table, for serialization into the envelope's `dict` field.
     pub fn as_slice(&self) -> &[String] {
         &self.table
     }
 }

*** result: Success
