*** crates/ax-core/src/dict.rs:46:9: replace Dict::is_empty -> bool with false

*** mutation diff:
--- crates/ax-core/src/dict.rs
+++ replace Dict::is_empty -> bool with false
@@ -38,17 +38,17 @@
         self.table.get(i as usize).map(String::as_str)
     }
 
     pub fn len(&self) -> usize {
         self.table.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.table.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The backing table, for serialization into the envelope's `dict` field.
     pub fn as_slice(&self) -> &[String] {
         &self.table
     }
 }

---- dict::tests::is_empty_and_as_slice_track_contents stdout ----

thread 'dict::tests::is_empty_and_as_slice_track_contents' (1154681) panicked at crates/ax-core/src/dict.rs:79:9:
assertion failed: d.is_empty()

failures:
    dict::tests::is_empty_and_as_slice_track_contents

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
