*** crates/ax-core/src/dict.rs:51:9: replace Dict::as_slice -> &[String] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/ax-core/src/dict.rs
+++ replace Dict::as_slice -> &[String] with Vec::leak(Vec::new())
@@ -43,17 +43,17 @@
     }
 
     pub fn is_empty(&self) -> bool {
         self.table.is_empty()
     }
 
     /// The backing table, for serialization into the envelope's `dict` field.
     pub fn as_slice(&self) -> &[String] {
-        &self.table
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Serialize for Dict {
     fn serialize<S: serde::Serializer>(&self, s: S) -> Result<S::Ok, S::Error> {
         self.table.serialize(s)
     }
 }

*** result: Success
