*** crates/ax-core/src/dict.rs:51:9: replace Dict::as_slice -> &[String] with Vec::leak(vec!["xyzzy".into()])

*** mutation diff:
--- crates/ax-core/src/dict.rs
+++ replace Dict::as_slice -> &[String] with Vec::leak(vec!["xyzzy".into()])
@@ -43,17 +43,17 @@
     }
 
     pub fn is_empty(&self) -> bool {
         self.table.is_empty()
     }
 
     /// The backing table, for serialization into the envelope's `dict` field.
     pub fn as_slice(&self) -> &[String] {
-        &self.table
+        Vec::leak(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Serialize for Dict {
     fn serialize<S: serde::Serializer>(&self, s: S) -> Result<S::Ok, S::Error> {
         self.table.serialize(s)
     }
 }

---- dict::tests::is_empty_and_as_slice_track_contents stdout ----

thread 'dict::tests::is_empty_and_as_slice_track_contents' (1155560) panicked at crates/ax-core/src/dict.rs:83:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["a", "b"]

failures:
    dict::tests::is_empty_and_as_slice_track_contents

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
