*** crates/ax-core/src/envelope.rs:202:5: replace severity_token -> &'static str with ""

*** mutation diff:
--- crates/ax-core/src/envelope.rs
+++ replace severity_token -> &'static str with ""
@@ -194,23 +194,17 @@
             absent: self.absent,
             summary,
             exit: exit.code(),
         }
     }
 }
 
 fn severity_token(s: Severity) -> &'static str {
-    match s {
-        Severity::Info => "info",
-        Severity::Low => "low",
-        Severity::Medium => "medium",
-        Severity::High => "high",
-        Severity::Critical => "critical",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn json_u32(v: u32) -> serde_json::Value {
     serde_json::Value::from(v)
 }
 
 fn json_f64(v: f64) -> serde_json::Value {
     serde_json::Number::from_f64(v)

---- envelope::tests::findings_set_anomalies_exit_and_max_severity stdout ----

thread 'envelope::tests::findings_set_anomalies_exit_and_max_severity' (1009571) panicked at crates/ax-core/src/envelope.rs:253:9:
assertion `left == right` failed
  left: Some("")
 right: Some("critical")

failures:
    envelope::tests::findings_set_anomalies_exit_and_max_severity

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
