*** crates/ax-core/src/envelope.rs:212:5: replace json_u32 -> serde_json::Value with Default::default()

*** mutation diff:
--- crates/ax-core/src/envelope.rs
+++ replace json_u32 -> serde_json::Value with Default::default()
@@ -204,17 +204,17 @@
         Severity::Low => "low",
         Severity::Medium => "medium",
         Severity::High => "high",
         Severity::Critical => "critical",
     }
 }
 
 fn json_u32(v: u32) -> serde_json::Value {
-    serde_json::Value::from(v)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn json_f64(v: f64) -> serde_json::Value {
     serde_json::Number::from_f64(v)
         .map(serde_json::Value::Number)
         .unwrap_or(serde_json::Value::Null)
 }

---- envelope::tests::findings_set_anomalies_exit_and_max_severity stdout ----

thread 'envelope::tests::findings_set_anomalies_exit_and_max_severity' (1010101) panicked at crates/ax-core/src/envelope.rs:258:53:
called `Option::unwrap()` on a `None` value

failures:
    envelope::tests::findings_set_anomalies_exit_and_max_severity

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
