*** crates/ax-core/src/envelope.rs:216:5: replace json_f64 -> serde_json::Value with Default::default()

*** mutation diff:
--- crates/ax-core/src/envelope.rs
+++ replace json_f64 -> serde_json::Value with Default::default()
@@ -208,19 +208,17 @@
     }
 }
 
 fn json_u32(v: u32) -> serde_json::Value {
     serde_json::Value::from(v)
 }
 
 fn json_f64(v: f64) -> serde_json::Value {
-    serde_json::Number::from_f64(v)
-        .map(serde_json::Value::Number)
-        .unwrap_or(serde_json::Value::Null)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::finding::Handle;
 
     fn finding(conf: f64, class: AnomalyClass, col: &str) -> Finding {

*** result: Success
