*** crates/ax-core/src/finding.rs:111:9: replace Handle::canonical -> String with "xyzzy".into()

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ replace Handle::canonical -> String with "xyzzy".into()
@@ -103,22 +103,17 @@
     },
     /// A distribution-level finding comparing `column` against a baseline.
     Dist { column: String },
 }
 
 impl Handle {
     /// Canonical wire form, e.g. `cell:amount:42` or `col:status`.
     pub fn canonical(&self) -> String {
-        match self {
-            Handle::Column { name } => format!("col:{name}"),
-            Handle::Cell { column, row } => format!("cell:{column}:{row}"),
-            Handle::Range { column, start, end } => format!("range:{column}:{start}:{end}"),
-            Handle::Dist { column } => format!("dist:{column}"),
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Parses the canonical form. Returns `None` on any malformed handle so the
     /// CLI can fail cleanly rather than guess (honest absence).
     pub fn parse(s: &str) -> Option<Handle> {
         let (kind, rest) = s.split_once(':')?;
         match kind {
             "col" => Some(Handle::Column { name: rest.to_string() }),

---- finding::tests::handle_roundtrips stdout ----

thread 'finding::tests::handle_roundtrips' (1162751) panicked at crates/ax-core/src/finding.rs:203:13:
assertion `left == right` failed: roundtrip failed for xyzzy
  left: None
 right: Some(Column { name: "status" })

failures:
    finding::tests::handle_roundtrips

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
