*** crates/ax-core/src/finding.rs:122:9: replace Handle::parse -> Option<Handle> with None

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ replace Handle::parse -> Option<Handle> with None
@@ -114,36 +114,17 @@
             Handle::Range { column, start, end } => format!("range:{column}:{start}:{end}"),
             Handle::Dist { column } => format!("dist:{column}"),
         }
     }
 
     /// Parses the canonical form. Returns `None` on any malformed handle so the
     /// CLI can fail cleanly rather than guess (honest absence).
     pub fn parse(s: &str) -> Option<Handle> {
-        let (kind, rest) = s.split_once(':')?;
-        match kind {
-            "col" => Some(Handle::Column { name: rest.to_string() }),
-            "dist" => Some(Handle::Dist { column: rest.to_string() }),
-            "cell" => {
-                let (column, row) = rest.rsplit_once(':')?;
-                Some(Handle::Cell {
-                    column: column.to_string(),
-                    row: row.parse().ok()?,
-                })
-            }
-            "range" => {
-                let mut it = rest.rsplitn(3, ':');
-                let end = it.next()?.parse().ok()?;
-                let start = it.next()?.parse().ok()?;
-                let column = it.next()?.to_string();
-                Some(Handle::Range { column, start, end })
-            }
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// One detected anomaly with everything an agent needs to act or drill in.
 #[derive(Debug, Clone, Serialize, Deserialize)]
 pub struct Finding {
     /// Detector that produced this finding (stable id).
     pub detector: String,

---- finding::tests::handle_roundtrips stdout ----

thread 'finding::tests::handle_roundtrips' (1014993) panicked at crates/ax-core/src/finding.rs:189:13:
assertion `left == right` failed: roundtrip failed for col:status
  left: None
 right: Some(Column { name: "status" })

failures:
    finding::tests::handle_roundtrips

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
