*** crates/ax-core/src/finding.rs:124:13: delete match arm "col" in Handle::parse

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ delete match arm "col" in Handle::parse
@@ -116,17 +116,17 @@
         }
     }
 
     /// Parses the canonical form. Returns `None` on any malformed handle so the
     /// CLI can fail cleanly rather than guess (honest absence).
     pub fn parse(s: &str) -> Option<Handle> {
         let (kind, rest) = s.split_once(':')?;
         match kind {
-            "col" => Some(Handle::Column { name: rest.to_string() }),
+             /* ~ changed by cargo-mutants ~ */
             "dist" => Some(Handle::Dist { column: rest.to_string() }),
             "cell" => {
                 let (column, row) = rest.rsplit_once(':')?;
                 Some(Handle::Cell {
                     column: column.to_string(),
                     row: row.parse().ok()?,
                 })
             }

---- finding::tests::handle_roundtrips stdout ----

thread 'finding::tests::handle_roundtrips' (1163337) panicked at crates/ax-core/src/finding.rs:208:13:
assertion `left == right` failed: roundtrip failed for col:status
  left: None
 right: Some(Column { name: "status" })

failures:
    finding::tests::handle_roundtrips

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
