*** crates/ax-core/src/finding.rs:125:13: delete match arm "dist" in Handle::parse

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ delete match arm "dist" in Handle::parse
@@ -117,17 +117,17 @@
     }
 
     /// Parses the canonical form. Returns `None` on any malformed handle so the
     /// CLI can fail cleanly rather than guess (honest absence).
     pub fn parse(s: &str) -> Option<Handle> {
         let (kind, rest) = s.split_once(':')?;
         match kind {
             "col" => Some(Handle::Column { name: rest.to_string() }),
-            "dist" => Some(Handle::Dist { column: rest.to_string() }),
+             /* ~ changed by cargo-mutants ~ */
             "cell" => {
                 let (column, row) = rest.rsplit_once(':')?;
                 Some(Handle::Cell {
                     column: column.to_string(),
                     row: row.parse().ok()?,
                 })
             }
             "range" => {

---- finding::tests::handle_roundtrips stdout ----

thread 'finding::tests::handle_roundtrips' (1163631) panicked at crates/ax-core/src/finding.rs:208:13:
assertion `left == right` failed: roundtrip failed for dist:score
  left: None
 right: Some(Dist { column: "score" })

failures:
    finding::tests::handle_roundtrips

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
