*** crates/ax-core/src/finding.rs:126:13: delete match arm "cell" in Handle::parse

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ delete match arm "cell" in Handle::parse
@@ -118,23 +118,17 @@
 
     /// Parses the canonical form. Returns `None` on any malformed handle so the
     /// CLI can fail cleanly rather than guess (honest absence).
     pub fn parse(s: &str) -> Option<Handle> {
         let (kind, rest) = s.split_once(':')?;
         match kind {
             "col" => Some(Handle::Column { name: rest.to_string() }),
             "dist" => Some(Handle::Dist { column: rest.to_string() }),
-            "cell" => {
-                let (column, row) = rest.rsplit_once(':')?;
-                Some(Handle::Cell {
-                    column: column.to_string(),
-                    row: row.parse().ok()?,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
             "range" => {
                 let mut it = rest.rsplitn(3, ':');
                 let end = it.next()?.parse().ok()?;
                 let start = it.next()?.parse().ok()?;
                 let column = it.next()?.to_string();
                 Some(Handle::Range { column, start, end })
             }
             _ => None,

---- finding::tests::handle_roundtrips stdout ----

thread 'finding::tests::handle_roundtrips' (1163921) panicked at crates/ax-core/src/finding.rs:202:13:
assertion `left == right` failed: roundtrip failed for cell:amount:42
  left: None
 right: Some(Cell { column: "amount", row: 42 })

failures:
    finding::tests::handle_roundtrips

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
