*** crates/ax-core/src/finding.rs:133:13: delete match arm "range" in Handle::parse

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ delete match arm "range" in Handle::parse
@@ -125,23 +125,17 @@
             "dist" => Some(Handle::Dist { column: rest.to_string() }),
             "cell" => {
                 let (column, row) = rest.rsplit_once(':')?;
                 Some(Handle::Cell {
                     column: column.to_string(),
                     row: row.parse().ok()?,
                 })
             }
-            "range" => {
-                let mut it = rest.rsplitn(3, ':');
-                let end = it.next()?.parse().ok()?;
-                let start = it.next()?.parse().ok()?;
-                let column = it.next()?.to_string();
-                Some(Handle::Range { column, start, end })
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 }
 
 /// One detected anomaly with everything an agent needs to act or drill in.
 #[derive(Debug, Clone, Serialize, Deserialize)]
 pub struct Finding {

---- finding::tests::handle_roundtrips stdout ----

thread 'finding::tests::handle_roundtrips' (1016070) panicked at crates/ax-core/src/finding.rs:202:13:
assertion `left == right` failed: roundtrip failed for range:ts:3:9
  left: None
 right: Some(Range { column: "ts", start: 3, end: 9 })

failures:
    finding::tests::handle_roundtrips

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
