*** crates/ax-core/src/finding.rs:36:9: replace AnomalyClass::token -> &'static str with ""

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ replace AnomalyClass::token -> &'static str with ""
@@ -28,25 +28,17 @@
     Multivariate,
     /// Suspiciously regular timing (metronomic cadence).
     Cadence,
 }
 
 impl AnomalyClass {
     /// Stable machine token, also used as the dictionary key in the envelope.
     pub fn token(self) -> &'static str {
-        match self {
-            AnomalyClass::Point => "point",
-            AnomalyClass::Contextual => "contextual",
-            AnomalyClass::Collective => "collective",
-            AnomalyClass::Distributional => "distributional",
-            AnomalyClass::Structural => "structural",
-            AnomalyClass::Multivariate => "multivariate",
-            AnomalyClass::Cadence => "cadence",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every class, in stable order — the basis for `describe` output and for
     /// deterministic grouping.
     pub const ALL: [AnomalyClass; 7] = [
         AnomalyClass::Point,
         AnomalyClass::Contextual,
         AnomalyClass::Collective,

---- finding::tests::class_tokens_are_exact stdout ----

thread 'finding::tests::class_tokens_are_exact' (1158304) panicked at crates/ax-core/src/finding.rs:212:9:
assertion `left == right` failed
  left: ""
 right: "point"

failures:
    finding::tests::class_tokens_are_exact

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
