*** crates/ax-core/src/finding.rs:36:9: replace AnomalyClass::token -> &'static str with "xyzzy"

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ replace AnomalyClass::token -> &'static str with "xyzzy"
@@ -28,25 +28,17 @@
     Multivariate,
     /// Suspiciously regular timing (metronomic cadence).
     Cadence,
 }
 
 impl AnomalyClass {
     /// Stable machine token, also used as the dictionary key in the envelope.
     pub fn token(self) -> &'static str {
-        match self {
-            AnomalyClass::Point => "point",
-            AnomalyClass::Contextual => "contextual",
-            AnomalyClass::Collective => "collective",
-            AnomalyClass::Distributional => "distributional",
-            AnomalyClass::Structural => "structural",
-            AnomalyClass::Multivariate => "multivariate",
-            AnomalyClass::Cadence => "cadence",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every class, in stable order — the basis for `describe` output and for
     /// deterministic grouping.
     pub const ALL: [AnomalyClass; 7] = [
         AnomalyClass::Point,
         AnomalyClass::Contextual,
         AnomalyClass::Collective,

*** result: Success
