*** crates/ax-core/src/finding.rs:76:18: replace match guard c >= 0.95 with true in Severity::from_confidence

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ replace match guard c >= 0.95 with true in Severity::from_confidence
@@ -68,17 +68,17 @@
     High,
     Critical,
 }
 
 impl Severity {
     /// Maps a calibrated confidence in `[0, 1]` to a severity bucket.
     pub fn from_confidence(c: f64) -> Severity {
         match c {
-            c if c >= 0.95 => Severity::Critical,
+            c if true /* ~ changed by cargo-mutants ~ */ => Severity::Critical,
             c if c >= 0.85 => Severity::High,
             c if c >= 0.65 => Severity::Medium,
             c if c >= 0.40 => Severity::Low,
             _ => Severity::Info,
         }
     }
 }

*** result: Success
