*** crates/ax-core/src/finding.rs:76:18: replace match guard c >= 0.95 with false in Severity::from_confidence

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ replace match guard c >= 0.95 with false in Severity::from_confidence
@@ -68,17 +68,17 @@
     High,
     Critical,
 }
 
 impl Severity {
     /// Maps a calibrated confidence in `[0, 1]` to a severity bucket.
     pub fn from_confidence(c: f64) -> Severity {
         match c {
-            c if c >= 0.95 => Severity::Critical,
+            c if false /* ~ changed by cargo-mutants ~ */ => Severity::Critical,
             c if c >= 0.85 => Severity::High,
             c if c >= 0.65 => Severity::Medium,
             c if c >= 0.40 => Severity::Low,
             _ => Severity::Info,
         }
     }
 }

---- envelope::tests::findings_set_anomalies_exit_and_max_severity stdout ----

thread 'envelope::tests::findings_set_anomalies_exit_and_max_severity' (1011455) panicked at crates/ax-core/src/envelope.rs:255:9:
assertion `left == right` failed
  left: Some(High)
 right: Some(Critical)

---- finding::tests::confidence_is_clamped stdout ----

thread 'finding::tests::confidence_is_clamped' (1011456) panicked at crates/ax-core/src/finding.rs:232:9:
assertion `left == right` failed
  left: High
 right: Critical

failures:
    envelope::tests::findings_set_anomalies_exit_and_max_severity
    finding::tests::confidence_is_clamped

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
