*** crates/ax-core/src/finding.rs:76:20: replace >= with < in Severity::from_confidence

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ replace >= with < in Severity::from_confidence
@@ -68,17 +68,17 @@
     High,
     Critical,
 }
 
 impl Severity {
     /// Maps a calibrated confidence in `[0, 1]` to a severity bucket.
     pub fn from_confidence(c: f64) -> Severity {
         match c {
-            c if c >= 0.95 => Severity::Critical,
+            c if c < /* ~ changed by cargo-mutants ~ */ 0.95 => Severity::Critical,
             c if c >= 0.85 => Severity::High,
             c if c >= 0.65 => Severity::Medium,
             c if c >= 0.40 => Severity::Low,
             _ => Severity::Info,
         }
     }
 }

---- finding::tests::confidence_is_clamped stdout ----

thread 'finding::tests::confidence_is_clamped' (1161228) panicked at crates/ax-core/src/finding.rs:264:9:
assertion `left == right` failed
  left: High
 right: Critical

---- finding::tests::severity_buckets_are_exact_at_boundaries stdout ----

thread 'finding::tests::severity_buckets_are_exact_at_boundaries' (1161231) panicked at crates/ax-core/src/finding.rs:246:13:
assertion `left == right` failed: confidence 0.96
  left: High
 right: Critical

---- finding::tests::severity_is_monotonic_in_confidence stdout ----

thread 'finding::tests::severity_is_monotonic_in_confidence' (1161232) panicked at crates/ax-core/src/finding.rs:255:13:
assertion failed: s >= prev

failures:
    finding::tests::confidence_is_clamped
    finding::tests::severity_buckets_are_exact_at_boundaries
    finding::tests::severity_is_monotonic_in_confidence

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
