*** crates/ax-core/src/finding.rs:79:20: replace >= with < in Severity::from_confidence

*** mutation diff:
--- crates/ax-core/src/finding.rs
+++ replace >= with < in Severity::from_confidence
@@ -71,17 +71,17 @@
 
 impl Severity {
     /// Maps a calibrated confidence in `[0, 1]` to a severity bucket.
     pub fn from_confidence(c: f64) -> Severity {
         match c {
             c if c >= 0.95 => Severity::Critical,
             c if c >= 0.85 => Severity::High,
             c if c >= 0.65 => Severity::Medium,
-            c if c >= 0.40 => Severity::Low,
+            c if c < /* ~ changed by cargo-mutants ~ */ 0.40 => Severity::Low,
             _ => Severity::Info,
         }
     }
 }
 
 /// A stable, drill-able pointer to the evidence behind a finding.
 ///
 /// Handles are the article's "handle-based evidence navigation": the `scan`

---- finding::tests::severity_is_monotonic_in_confidence stdout ----

thread 'finding::tests::severity_is_monotonic_in_confidence' (1014208) panicked at crates/ax-core/src/finding.rs:223:13:
assertion failed: s >= prev

failures:
    finding::tests::severity_is_monotonic_in_confidence

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
