*** crates/ax-core/src/record.rs:36:9: replace Column::numeric -> Vec<f64> with vec![1.0]

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace Column::numeric -> Vec<f64> with vec![1.0]
@@ -28,21 +28,17 @@
             ty,
             cells,
         }
     }
 
     /// The finite numeric projection of this column (nulls and non-numeric
     /// cells dropped). Empty for non-numeric columns — honest absence, not zeros.
     pub fn numeric(&self) -> Vec<f64> {
-        self.cells
-            .iter()
-            .filter_map(Value::as_f64)
-            .filter(|x| x.is_finite())
-            .collect()
+        vec![1.0] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Count of null cells.
     pub fn null_count(&self) -> usize {
         self.cells.iter().filter(|v| v.is_null()).count()
     }
 
     pub fn len(&self) -> usize {

---- record::tests::numeric_skips_nulls_and_strings stdout ----

thread 'record::tests::numeric_skips_nulls_and_strings' (1165098) panicked at crates/ax-core/src/record.rs:109:9:
assertion `left == right` failed
  left: [1.0]
 right: [1.0, 2.5]

failures:
    record::tests::numeric_skips_nulls_and_strings

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
