*** crates/ax-core/src/record.rs:45:9: replace Column::null_count -> usize with 0

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace Column::null_count -> usize with 0
@@ -37,17 +37,17 @@
             .iter()
             .filter_map(Value::as_f64)
             .filter(|x| x.is_finite())
             .collect()
     }
 
     /// Count of null cells.
     pub fn null_count(&self) -> usize {
-        self.cells.iter().filter(|v| v.is_null()).count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn len(&self) -> usize {
         self.cells.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.cells.is_empty()

---- record::tests::numeric_skips_nulls_and_strings stdout ----

thread 'record::tests::numeric_skips_nulls_and_strings' (1017471) panicked at crates/ax-core/src/record.rs:115:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    record::tests::numeric_skips_nulls_and_strings

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
