*** crates/ax-core/src/record.rs:45:9: replace Column::null_count -> usize with 1

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace Column::null_count -> usize with 1
@@ -37,17 +37,17 @@
             .iter()
             .filter_map(Value::as_f64)
             .filter(|x| x.is_finite())
             .collect()
     }
 
     /// Count of null cells.
     pub fn null_count(&self) -> usize {
-        self.cells.iter().filter(|v| v.is_null()).count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn len(&self) -> usize {
         self.cells.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.cells.is_empty()

---- record::tests::null_count_is_exact stdout ----

thread 'record::tests::null_count_is_exact' (1165965) panicked at crates/ax-core/src/record.rs:120:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    record::tests::null_count_is_exact

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
