*** crates/ax-core/src/record.rs:49:9: replace Column::len -> usize with 0

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace Column::len -> usize with 0
@@ -41,17 +41,17 @@
     }
 
     /// Count of null cells.
     pub fn null_count(&self) -> usize {
         self.cells.iter().filter(|v| v.is_null()).count()
     }
 
     pub fn len(&self) -> usize {
-        self.cells.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.cells.is_empty()
     }
 }
 
 /// A normalized corpus: named columns of equal length, plus provenance about

---- record::tests::rows_and_width stdout ----

thread 'record::tests::rows_and_width' (1166257) panicked at crates/ax-core/src/record.rs:143:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    record::tests::rows_and_width

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
