*** crates/ax-core/src/record.rs:53:9: replace Column::is_empty -> bool with false

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace Column::is_empty -> bool with false
@@ -45,17 +45,17 @@
         self.cells.iter().filter(|v| v.is_null()).count()
     }
 
     pub fn len(&self) -> usize {
         self.cells.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.cells.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A normalized corpus: named columns of equal length, plus provenance about
 /// where it came from. This is the universal input to every detector.
 #[derive(Debug, Clone, Serialize, Deserialize)]
 pub struct RecordSet {
     /// Logical source identifier (path, URL, or `"-"` for stdin).

*** result: Success
