*** crates/ax-core/src/record.rs:86:9: replace RecordSet::rows -> usize with 0

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace RecordSet::rows -> usize with 0
@@ -78,17 +78,17 @@
             source: source.into(),
             format: format.into(),
             columns,
         }
     }
 
     /// Number of rows (length of the first column, or 0 if columnless).
     pub fn rows(&self) -> usize {
-        self.columns.first().map_or(0, Column::len)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn width(&self) -> usize {
         self.columns.len()
     }
 
     pub fn column(&self, name: &str) -> Option<&Column> {
         self.columns.iter().find(|c| c.name == name)

---- record::tests::rows_and_width stdout ----

thread 'record::tests::rows_and_width' (1019079) panicked at crates/ax-core/src/record.rs:128:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    record::tests::rows_and_width

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
