*** crates/ax-core/src/record.rs:90:9: replace RecordSet::width -> usize with 1

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace RecordSet::width -> usize with 1
@@ -82,17 +82,17 @@
     }
 
     /// Number of rows (length of the first column, or 0 if columnless).
     pub fn rows(&self) -> usize {
         self.columns.first().map_or(0, Column::len)
     }
 
     pub fn width(&self) -> usize {
-        self.columns.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn column(&self, name: &str) -> Option<&Column> {
         self.columns.iter().find(|c| c.name == name)
     }
 }
 
 #[cfg(test)]

---- record::tests::rows_and_width stdout ----

thread 'record::tests::rows_and_width' (1019878) panicked at crates/ax-core/src/record.rs:129:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    record::tests::rows_and_width

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
