*** crates/ax-core/src/record.rs:94:45: replace == with != in RecordSet::column

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace == with != in RecordSet::column
@@ -86,17 +86,17 @@
         self.columns.first().map_or(0, Column::len)
     }
 
     pub fn width(&self) -> usize {
         self.columns.len()
     }
 
     pub fn column(&self, name: &str) -> Option<&Column> {
-        self.columns.iter().find(|c| c.name == name)
+        self.columns.iter().find(|c| c.name != /* ~ changed by cargo-mutants ~ */ name)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- record::tests::rows_and_width stdout ----

thread 'record::tests::rows_and_width' (1020424) panicked at crates/ax-core/src/record.rs:131:9:
assertion failed: rs.column("z").is_none()

failures:
    record::tests::rows_and_width

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
