*** crates/ax-core/src/record.rs:94:9: replace RecordSet::column -> Option<&Column> with None

*** mutation diff:
--- crates/ax-core/src/record.rs
+++ replace RecordSet::column -> Option<&Column> with None
@@ -86,17 +86,17 @@
         self.columns.first().map_or(0, Column::len)
     }
 
     pub fn width(&self) -> usize {
         self.columns.len()
     }
 
     pub fn column(&self, name: &str) -> Option<&Column> {
-        self.columns.iter().find(|c| c.name == name)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- record::tests::rows_and_width stdout ----

thread 'record::tests::rows_and_width' (1020147) panicked at crates/ax-core/src/record.rs:130:9:
assertion failed: rs.column("a").is_some()

failures:
    record::tests::rows_and_width

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
