*** crates/ax-core/src/value.rs:111:13: delete match arm (Unknown, x) |(x, Unknown) in ColType::unify

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ delete match arm (Unknown, x) |(x, Unknown) in ColType::unify
@@ -103,17 +103,17 @@
 impl ColType {
     /// Least-upper-bound when folding cell types into a column type.
     ///
     /// `Unknown` is the identity; `Int`+`Float` widen to `Float`; any other
     /// disagreement is `Mixed` (itself a structural anomaly signal, not an error).
     pub fn unify(self, other: ColType) -> ColType {
         use ColType::*;
         match (self, other) {
-            (Unknown, x) | (x, Unknown) => x,
+             /* ~ changed by cargo-mutants ~ */
             (a, b) if a == b => a,
             (Int, Float) | (Float, Int) => Float,
             _ => Mixed,
         }
     }
 
     pub fn is_numeric(self) -> bool {
         matches!(self, ColType::Int | ColType::Float | ColType::Bool)

---- value::tests::unify_widens_int_float stdout ----

thread 'value::tests::unify_widens_int_float' (1024552) panicked at crates/ax-core/src/value.rs:135:9:
assertion `left == right` failed
  left: Mixed
 right: Str

failures:
    value::tests::unify_widens_int_float

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
