*** crates/ax-core/src/value.rs:112:23: replace match guard a == b with false in ColType::unify

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ replace match guard a == b with false in ColType::unify
@@ -104,17 +104,17 @@
     /// Least-upper-bound when folding cell types into a column type.
     ///
     /// `Unknown` is the identity; `Int`+`Float` widen to `Float`; any other
     /// disagreement is `Mixed` (itself a structural anomaly signal, not an error).
     pub fn unify(self, other: ColType) -> ColType {
         use ColType::*;
         match (self, other) {
             (Unknown, x) | (x, Unknown) => x,
-            (a, b) if a == b => a,
+            (a, b) if false /* ~ changed by cargo-mutants ~ */ => a,
             (Int, Float) | (Float, Int) => Float,
             _ => Mixed,
         }
     }
 
     pub fn is_numeric(self) -> bool {
         matches!(self, ColType::Int | ColType::Float | ColType::Bool)
     }

---- value::tests::unify_is_commutative_and_idempotent stdout ----

thread 'value::tests::unify_is_commutative_and_idempotent' (1025346) panicked at crates/ax-core/src/value.rs:150:13:
assertion `left == right` failed
  left: Mixed
 right: Bool

failures:
    value::tests::unify_is_commutative_and_idempotent

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
