*** crates/ax-core/src/value.rs:112:25: replace == with != in ColType::unify

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ replace == with != in ColType::unify
@@ -104,17 +104,17 @@
     /// Least-upper-bound when folding cell types into a column type.
     ///
     /// `Unknown` is the identity; `Int`+`Float` widen to `Float`; any other
     /// disagreement is `Mixed` (itself a structural anomaly signal, not an error).
     pub fn unify(self, other: ColType) -> ColType {
         use ColType::*;
         match (self, other) {
             (Unknown, x) | (x, Unknown) => x,
-            (a, b) if a == b => a,
+            (a, b) if a != /* ~ changed by cargo-mutants ~ */ b => a,
             (Int, Float) | (Float, Int) => Float,
             _ => Mixed,
         }
     }
 
     pub fn is_numeric(self) -> bool {
         matches!(self, ColType::Int | ColType::Float | ColType::Bool)
     }

---- record::tests::numeric_skips_nulls_and_strings stdout ----

thread 'record::tests::numeric_skips_nulls_and_strings' (1025608) panicked at crates/ax-core/src/record.rs:114:9:
assertion `left == right` failed
  left: Int
 right: Mixed

---- value::tests::unify_is_commutative_and_idempotent stdout ----

thread 'value::tests::unify_is_commutative_and_idempotent' (1025611) panicked at crates/ax-core/src/value.rs:150:13:
assertion `left == right` failed
  left: Mixed
 right: Bool

---- value::tests::unify_widens_int_float stdout ----

thread 'value::tests::unify_widens_int_float' (1025612) panicked at crates/ax-core/src/value.rs:134:9:
assertion `left == right` failed
  left: Int
 right: Float

failures:
    record::tests::numeric_skips_nulls_and_strings
    value::tests::unify_is_commutative_and_idempotent
    value::tests::unify_widens_int_float

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
