*** crates/ax-core/src/value.rs:113:13: delete match arm (Int, Float) |(Float, Int) in ColType::unify

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ delete match arm (Int, Float) |(Float, Int) in ColType::unify
@@ -105,17 +105,17 @@
     ///
     /// `Unknown` is the identity; `Int`+`Float` widen to `Float`; any other
     /// disagreement is `Mixed` (itself a structural anomaly signal, not an error).
     pub fn unify(self, other: ColType) -> ColType {
         use ColType::*;
         match (self, other) {
             (Unknown, x) | (x, Unknown) => x,
             (a, b) if a == b => a,
-            (Int, Float) | (Float, Int) => Float,
+             /* ~ changed by cargo-mutants ~ */
             _ => Mixed,
         }
     }
 
     pub fn is_numeric(self) -> bool {
         matches!(self, ColType::Int | ColType::Float | ColType::Bool)
     }
 }

---- value::tests::unify_widens_int_float stdout ----

thread 'value::tests::unify_widens_int_float' (1173761) panicked at crates/ax-core/src/value.rs:180:9:
assertion `left == right` failed
  left: Mixed
 right: Float

failures:
    value::tests::unify_widens_int_float

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
