*** crates/ax-core/src/value.rs:119:9: replace ColType::is_numeric -> bool with false

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ replace ColType::is_numeric -> bool with false
@@ -111,17 +111,17 @@
             (Unknown, x) | (x, Unknown) => x,
             (a, b) if a == b => a,
             (Int, Float) | (Float, Int) => Float,
             _ => Mixed,
         }
     }
 
     pub fn is_numeric(self) -> bool {
-        matches!(self, ColType::Int | ColType::Float | ColType::Bool)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- value::tests::is_numeric_classification stdout ----

thread 'value::tests::is_numeric_classification' (1175209) panicked at crates/ax-core/src/value.rs:170:9:
assertion failed: ColType::Int.is_numeric()

failures:
    value::tests::is_numeric_classification

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
