*** crates/ax-core/src/value.rs:40:9: replace Value::as_f64 -> Option<f64> with Some(0.0)

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ replace Value::as_f64 -> Option<f64> with Some(0.0)
@@ -32,22 +32,17 @@
     }
 
     /// Numeric projection used by statistical detectors.
     ///
     /// `Int` and `Float` map to their `f64` value; `Bool` maps to `0.0`/`1.0`;
     /// `Null` and `Str` are non-numeric and return `None`. Honest absence: a
     /// `Null` never becomes a `0.0` that would skew a mean.
     pub fn as_f64(&self) -> Option<f64> {
-        match self {
-            Value::Int(i) => Some(*i as f64),
-            Value::Float(f) => Some(*f),
-            Value::Bool(b) => Some(if *b { 1.0 } else { 0.0 }),
-            Value::Null | Value::Str(_) => None,
-        }
+        Some(0.0) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_null(&self) -> bool {
         matches!(self, Value::Null)
     }
 
     /// Canonical string form, used for categorical/frequency detectors and as
     /// the basis for stable evidence handles.

---- record::tests::numeric_skips_nulls_and_strings stdout ----

thread 'record::tests::numeric_skips_nulls_and_strings' (1020965) panicked at crates/ax-core/src/record.rs:113:9:
assertion `left == right` failed
  left: [0.0, 0.0, 0.0, 0.0]
 right: [1.0, 2.5]

---- value::tests::null_is_not_numeric_zero stdout ----

thread 'value::tests::null_is_not_numeric_zero' (1020967) panicked at crates/ax-core/src/value.rs:124:9:
assertion `left == right` failed
  left: Some(0.0)
 right: None

failures:
    record::tests::numeric_skips_nulls_and_strings
    value::tests::null_is_not_numeric_zero

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
