*** crates/ax-core/src/value.rs:49:9: replace Value::is_null -> bool with false

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ replace Value::is_null -> bool with false
@@ -41,17 +41,17 @@
             Value::Int(i) => Some(*i as f64),
             Value::Float(f) => Some(*f),
             Value::Bool(b) => Some(if *b { 1.0 } else { 0.0 }),
             Value::Null | Value::Str(_) => None,
         }
     }
 
     pub fn is_null(&self) -> bool {
-        matches!(self, Value::Null)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Canonical string form, used for categorical/frequency detectors and as
     /// the basis for stable evidence handles.
     pub fn canonical(&self) -> String {
         match self {
             Value::Null => "\u{0}null".to_string(),
             Value::Bool(b) => format!("b:{b}"),

---- record::tests::null_count_is_exact stdout ----

thread 'record::tests::null_count_is_exact' (1170744) panicked at crates/ax-core/src/record.rs:121:9:
assertion `left == right` failed
  left: 0
 right: 2

---- record::tests::numeric_skips_nulls_and_strings stdout ----

thread 'record::tests::numeric_skips_nulls_and_strings' (1170745) panicked at crates/ax-core/src/record.rs:115:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    record::tests::null_count_is_exact
    record::tests::numeric_skips_nulls_and_strings

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
