*** crates/ax-core/src/value.rs:55:9: replace Value::canonical -> String with "xyzzy".into()

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ replace Value::canonical -> String with "xyzzy".into()
@@ -47,23 +47,17 @@
 
     pub fn is_null(&self) -> bool {
         matches!(self, Value::Null)
     }
 
     /// Canonical string form, used for categorical/frequency detectors and as
     /// the basis for stable evidence handles.
     pub fn canonical(&self) -> String {
-        match self {
-            Value::Null => "\u{0}null".to_string(),
-            Value::Bool(b) => format!("b:{b}"),
-            Value::Int(i) => format!("i:{i}"),
-            Value::Float(f) => format!("f:{:?}", f),
-            Value::Str(s) => format!("s:{s}"),
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A total order over values, so detector output (and thus the envelope) is
 /// deterministic regardless of input ordering. Cross-variant ties break on a
 /// fixed variant rank; floats use [`f64::total_cmp`] so NaN has a defined seat.
 impl Value {
     pub fn total_cmp(&self, other: &Value) -> Ordering {

*** result: Success
