*** crates/ax-core/src/value.rs:71:13: replace Value::total_cmp::rank -> u8 with 0

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ replace Value::total_cmp::rank -> u8 with 0
@@ -63,23 +63,17 @@
 }
 
 /// A total order over values, so detector output (and thus the envelope) is
 /// deterministic regardless of input ordering. Cross-variant ties break on a
 /// fixed variant rank; floats use [`f64::total_cmp`] so NaN has a defined seat.
 impl Value {
     pub fn total_cmp(&self, other: &Value) -> Ordering {
         fn rank(v: &Value) -> u8 {
-            match v {
-                Value::Null => 0,
-                Value::Bool(_) => 1,
-                Value::Int(_) => 2,
-                Value::Float(_) => 3,
-                Value::Str(_) => 4,
-            }
+            0 /* ~ changed by cargo-mutants ~ */
         }
         match (self, other) {
             (Value::Bool(a), Value::Bool(b)) => a.cmp(b),
             (Value::Int(a), Value::Int(b)) => a.cmp(b),
             (Value::Float(a), Value::Float(b)) => a.total_cmp(b),
             (Value::Str(a), Value::Str(b)) => a.cmp(b),
             _ => rank(self).cmp(&rank(other)),
         }

---- value::tests::total_cmp_orders_across_variants_by_rank stdout ----

thread 'value::tests::total_cmp_orders_across_variants_by_rank' (1171636) panicked at crates/ax-core/src/value.rs:157:17:
assertion `left == right` failed: i=0 j=1
  left: Equal
 right: Less

failures:
    value::tests::total_cmp_orders_across_variants_by_rank

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
