*** crates/ax-core/src/value.rs:71:13: replace Value::total_cmp::rank -> u8 with 1

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ replace Value::total_cmp::rank -> u8 with 1
@@ -63,23 +63,17 @@
 }
 
 /// A total order over values, so detector output (and thus the envelope) is
 /// deterministic regardless of input ordering. Cross-variant ties break on a
 /// fixed variant rank; floats use [`f64::total_cmp`] so NaN has a defined seat.
 impl Value {
     pub fn total_cmp(&self, other: &Value) -> Ordering {
         fn rank(v: &Value) -> u8 {
-            match v {
-                Value::Null => 0,
-                Value::Bool(_) => 1,
-                Value::Int(_) => 2,
-                Value::Float(_) => 3,
-                Value::Str(_) => 4,
-            }
+            1 /* ~ changed by cargo-mutants ~ */
         }
         match (self, other) {
             (Value::Bool(a), Value::Bool(b)) => a.cmp(b),
             (Value::Int(a), Value::Int(b)) => a.cmp(b),
             (Value::Float(a), Value::Float(b)) => a.total_cmp(b),
             (Value::Str(a), Value::Str(b)) => a.cmp(b),
             _ => rank(self).cmp(&rank(other)),
         }

*** result: Success
