*** crates/ax-core/src/value.rs:83:13: delete match arm (Value::Str(a), Value::Str(b)) in Value::total_cmp

*** mutation diff:
--- crates/ax-core/src/value.rs
+++ delete match arm (Value::Str(a), Value::Str(b)) in Value::total_cmp
@@ -75,17 +75,17 @@
                 Value::Float(_) => 3,
                 Value::Str(_) => 4,
             }
         }
         match (self, other) {
             (Value::Bool(a), Value::Bool(b)) => a.cmp(b),
             (Value::Int(a), Value::Int(b)) => a.cmp(b),
             (Value::Float(a), Value::Float(b)) => a.total_cmp(b),
-            (Value::Str(a), Value::Str(b)) => a.cmp(b),
+             /* ~ changed by cargo-mutants ~ */
             _ => rank(self).cmp(&rank(other)),
         }
     }
 }
 
 /// The inferred logical type of a column.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "lowercase")]

---- value::tests::total_cmp_orders_within_variant stdout ----

thread 'value::tests::total_cmp_orders_within_variant' (1173159) panicked at crates/ax-core/src/value.rs:147:9:
assertion `left == right` failed
  left: Equal
 right: Less

failures:
    value::tests::total_cmp_orders_within_variant

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
