*** crates/ax-detect/src/cadence.rs:24:32: replace - with / in intervals

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace - with / in intervals
@@ -16,17 +16,17 @@
 use ax_core::finding::Handle;
 use ax_core::{AnomalyClass, Finding};
 
 #[derive(Debug, Default, Clone)]
 pub struct CadenceDetector;
 
 /// Consecutive forward differences of a value sequence.
 pub fn intervals(xs: &[f64]) -> Vec<f64> {
-    xs.windows(2).map(|w| w[1] - w[0]).collect()
+    xs.windows(2).map(|w| w[1] / /* ~ changed by cargo-mutants ~ */ w[0]).collect()
 }
 
 /// Coefficient of variation `σ/μ` of `xs`. `None` unless there are at least two
 /// values and the mean is strictly positive (a progressing series).
 pub fn coefficient_of_variation(xs: &[f64]) -> Option<f64> {
     let mean = det::mean(xs)?;
     if mean <= 0.0 {
         return None;

---- cadence::tests::confidence_increases_as_cadence_tightens stdout ----

thread 'cadence::tests::confidence_increases_as_cadence_tightens' (2061250) panicked at crates/ax-detect/src/cadence.rs:224:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::confidence_is_one_minus_cv_over_threshold stdout ----

thread 'cadence::tests::confidence_is_one_minus_cv_over_threshold' (2061251) panicked at crates/ax-detect/src/cadence.rs:202:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::jittery_human_stream_is_not_flagged stdout ----

thread 'cadence::tests::jittery_human_stream_is_not_flagged' (2061254) panicked at crates/ax-detect/src/cadence.rs:168:9:
ragged cadence is not anomalous

failures:
    cadence::tests::confidence_increases_as_cadence_tightens
    cadence::tests::confidence_is_one_minus_cv_over_threshold
    cadence::tests::intervals_are_consecutive_differences
    cadence::tests::jittery_human_stream_is_not_flagged

test result: FAILED. 103 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
