*** crates/ax-detect/src/cadence.rs:30:5: replace coefficient_of_variation -> Option<f64> with None

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace coefficient_of_variation -> Option<f64> with None
@@ -22,22 +22,17 @@
 /// Consecutive forward differences of a value sequence.
 pub fn intervals(xs: &[f64]) -> Vec<f64> {
     xs.windows(2).map(|w| w[1] - w[0]).collect()
 }
 
 /// Coefficient of variation `σ/μ` of `xs`. `None` unless there are at least two
 /// values and the mean is strictly positive (a progressing series).
 pub fn coefficient_of_variation(xs: &[f64]) -> Option<f64> {
-    let mean = det::mean(xs)?;
-    if mean <= 0.0 {
-        return None;
-    }
-    let sd = det::std_dev(xs)?;
-    Some(sd / mean)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 impl Detector for CadenceDetector {
     fn id(&self) -> &'static str {
         "cad.regularity"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Cadence

---- cadence::tests::confidence_is_one_minus_cv_over_threshold stdout ----

thread 'cadence::tests::confidence_is_one_minus_cv_over_threshold' (2061675) panicked at crates/ax-detect/src/cadence.rs:197:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::cv_exact_and_guards stdout ----

thread 'cadence::tests::cv_exact_and_guards' (2061676) panicked at crates/ax-detect/src/cadence.rs:128:61:
called `Option::unwrap()` on a `None` value

---- cadence::tests::confidence_increases_as_cadence_tightens stdout ----

thread 'cadence::tests::confidence_increases_as_cadence_tightens' (2061674) panicked at crates/ax-detect/src/cadence.rs:219:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    cadence::tests::confidence_increases_as_cadence_tightens
    cadence::tests::confidence_is_one_minus_cv_over_threshold
    cadence::tests::cv_exact_and_guards
    cadence::tests::jittery_human_stream_is_not_flagged
    cadence::tests::metronomic_stream_is_flagged
    cadence::tests::runs_at_exactly_min_n_intervals

test result: FAILED. 101 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
