*** crates/ax-detect/src/cadence.rs:30:5: replace coefficient_of_variation -> Option<f64> with Some(-1.0)

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace coefficient_of_variation -> Option<f64> with Some(-1.0)
@@ -22,22 +22,17 @@
 /// Consecutive forward differences of a value sequence.
 pub fn intervals(xs: &[f64]) -> Vec<f64> {
     xs.windows(2).map(|w| w[1] - w[0]).collect()
 }
 
 /// Coefficient of variation `σ/μ` of `xs`. `None` unless there are at least two
 /// values and the mean is strictly positive (a progressing series).
 pub fn coefficient_of_variation(xs: &[f64]) -> Option<f64> {
-    let mean = det::mean(xs)?;
-    if mean <= 0.0 {
-        return None;
-    }
-    let sd = det::std_dev(xs)?;
-    Some(sd / mean)
+    Some(-1.0) /* ~ changed by cargo-mutants ~ */
 }
 
 impl Detector for CadenceDetector {
     fn id(&self) -> &'static str {
         "cad.regularity"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Cadence

---- cadence::tests::cv_exact_and_guards stdout ----

thread 'cadence::tests::cv_exact_and_guards' (2063012) panicked at crates/ax-detect/src/cadence.rs:128:9:
assertion failed: (coefficient_of_variation(&[2.0, 4.0, 6.0]).unwrap() - 0.5).abs() < 1e-12

---- cadence::tests::confidence_is_one_minus_cv_over_threshold stdout ----

thread 'cadence::tests::confidence_is_one_minus_cv_over_threshold' (2063011) panicked at crates/ax-detect/src/cadence.rs:199:9:
cv is small but positive: -1

---- cadence::tests::confidence_increases_as_cadence_tightens stdout ----

thread 'cadence::tests::confidence_increases_as_cadence_tightens' (2063010) panicked at crates/ax-detect/src/cadence.rs:221:9:
assertion failed: c2.findings[0].confidence > c1.findings[0].confidence

failures:
    cadence::tests::confidence_increases_as_cadence_tightens
    cadence::tests::confidence_is_one_minus_cv_over_threshold
    cadence::tests::cv_exact_and_guards
    cadence::tests::jittery_human_stream_is_not_flagged

test result: FAILED. 103 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
