*** crates/ax-detect/src/cadence.rs:31:13: replace <= with > in coefficient_of_variation

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace <= with > in coefficient_of_variation
@@ -23,17 +23,17 @@
 pub fn intervals(xs: &[f64]) -> Vec<f64> {
     xs.windows(2).map(|w| w[1] - w[0]).collect()
 }
 
 /// Coefficient of variation `σ/μ` of `xs`. `None` unless there are at least two
 /// values and the mean is strictly positive (a progressing series).
 pub fn coefficient_of_variation(xs: &[f64]) -> Option<f64> {
     let mean = det::mean(xs)?;
-    if mean <= 0.0 {
+    if mean > /* ~ changed by cargo-mutants ~ */ 0.0 {
         return None;
     }
     let sd = det::std_dev(xs)?;
     Some(sd / mean)
 }
 
 impl Detector for CadenceDetector {
     fn id(&self) -> &'static str {

---- cadence::tests::cv_exact_and_guards stdout ----

thread 'cadence::tests::cv_exact_and_guards' (2063436) panicked at crates/ax-detect/src/cadence.rs:133:61:
called `Option::unwrap()` on a `None` value

---- cadence::tests::confidence_increases_as_cadence_tightens stdout ----

thread 'cadence::tests::confidence_increases_as_cadence_tightens' (2063434) panicked at crates/ax-detect/src/cadence.rs:224:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::confidence_is_one_minus_cv_over_threshold stdout ----

thread 'cadence::tests::confidence_is_one_minus_cv_over_threshold' (2063435) panicked at crates/ax-detect/src/cadence.rs:202:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    cadence::tests::confidence_increases_as_cadence_tightens
    cadence::tests::confidence_is_one_minus_cv_over_threshold
    cadence::tests::cv_exact_and_guards
    cadence::tests::jittery_human_stream_is_not_flagged
    cadence::tests::metronomic_stream_is_flagged
    cadence::tests::runs_at_exactly_min_n_intervals

test result: FAILED. 101 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
