*** crates/ax-detect/src/cadence.rs:35:13: replace / with % in coefficient_of_variation

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace / with % in coefficient_of_variation
@@ -27,17 +27,17 @@
 /// Coefficient of variation `σ/μ` of `xs`. `None` unless there are at least two
 /// values and the mean is strictly positive (a progressing series).
 pub fn coefficient_of_variation(xs: &[f64]) -> Option<f64> {
     let mean = det::mean(xs)?;
     if mean <= 0.0 {
         return None;
     }
     let sd = det::std_dev(xs)?;
-    Some(sd / mean)
+    Some(sd % /* ~ changed by cargo-mutants ~ */ mean)
 }
 
 impl Detector for CadenceDetector {
     fn id(&self) -> &'static str {
         "cad.regularity"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Cadence

---- cadence::tests::confidence_is_one_minus_cv_over_threshold stdout ----

thread 'cadence::tests::confidence_is_one_minus_cv_over_threshold' (2063858) panicked at crates/ax-detect/src/cadence.rs:202:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::confidence_increases_as_cadence_tightens stdout ----

thread 'cadence::tests::confidence_increases_as_cadence_tightens' (2063857) panicked at crates/ax-detect/src/cadence.rs:224:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::cv_exact_and_guards stdout ----

thread 'cadence::tests::cv_exact_and_guards' (2063859) panicked at crates/ax-detect/src/cadence.rs:133:9:
assertion failed: (coefficient_of_variation(&[2.0, 4.0, 6.0]).unwrap() - 0.5).abs() < 1e-12

failures:
    cadence::tests::confidence_increases_as_cadence_tightens
    cadence::tests::confidence_is_one_minus_cv_over_threshold
    cadence::tests::cv_exact_and_guards

test result: FAILED. 104 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
