*** crates/ax-detect/src/cadence.rs:40:9: replace <impl Detector for CadenceDetector>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace <impl Detector for CadenceDetector>::id -> &'static str with "xyzzy"
@@ -32,17 +32,17 @@
         return None;
     }
     let sd = det::std_dev(xs)?;
     Some(sd / mean)
 }
 
 impl Detector for CadenceDetector {
     fn id(&self) -> &'static str {
-        "cad.regularity"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Cadence
     }
     fn detect(&self, ctx: &ScanContext, cfg: &DetectConfig, out: &mut Report) {
         let Some(name) = cfg.cadence_column.as_deref() else {
             out.mark_absent(
                 self.id(),

---- cadence::tests::absent_without_a_cadence_column stdout ----

thread 'cadence::tests::absent_without_a_cadence_column' (2065152) panicked at crates/ax-detect/src/cadence.rs:145:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "cad.regularity"

---- tests::registry_registers_the_default_detector_set stdout ----

thread 'tests::registry_registers_the_default_detector_set' (2065255) panicked at crates/ax-detect/src/lib.rs:186:9:
assertion `left == right` failed
  left: ["point.modz", "struct.schema", "dist.ks", "dist.psi", "dist.chi2", "mv.mahalanobis", "ctx.seasonal", "coll.cusum", "xyzzy"]
 right: ["point.modz", "struct.schema", "dist.ks", "dist.psi", "dist.chi2", "mv.mahalanobis", "ctx.seasonal", "coll.cusum", "cad.regularity"]

failures:
    cadence::tests::absent_without_a_cadence_column
    tests::registry_registers_the_default_detector_set

test result: FAILED. 105 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
