*** crates/ax-detect/src/cadence.rs:59:25: replace < with == in <impl Detector for CadenceDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace < with == in <impl Detector for CadenceDetector>::detect
@@ -51,17 +51,17 @@
             return;
         };
         let Some(col) = ctx.current.column(name) else {
             out.mark_absent(self.id(), format!("column '{name}' not found"));
             return;
         };
         let values = col.numeric();
         let deltas = intervals(&values);
-        if deltas.len() < cfg.cad_min_n {
+        if deltas.len() == /* ~ changed by cargo-mutants ~ */ cfg.cad_min_n {
             out.mark_absent(
                 self.id(),
                 format!("column '{name}' has fewer than {} intervals", cfg.cad_min_n),
             );
             return;
         }
         let Some(cv) = coefficient_of_variation(&deltas) else {
             out.mark_absent(

---- cadence::tests::too_few_intervals_is_absent stdout ----

thread 'cadence::tests::too_few_intervals_is_absent' (2066019) panicked at crates/ax-detect/src/cadence.rs:213:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::runs_at_exactly_min_n_intervals stdout ----

thread 'cadence::tests::runs_at_exactly_min_n_intervals' (2066018) panicked at crates/ax-detect/src/cadence.rs:188:9:
assertion `left == right` failed: exactly min_n intervals must be assessed
  left: 0
 right: 1

failures:
    cadence::tests::runs_at_exactly_min_n_intervals
    cadence::tests::too_few_intervals_is_absent

test result: FAILED. 105 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
