*** crates/ax-detect/src/cadence.rs:59:25: replace < with > in <impl Detector for CadenceDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace < with > in <impl Detector for CadenceDetector>::detect
@@ -51,17 +51,17 @@
             return;
         };
         let Some(col) = ctx.current.column(name) else {
             out.mark_absent(self.id(), format!("column '{name}' not found"));
             return;
         };
         let values = col.numeric();
         let deltas = intervals(&values);
-        if deltas.len() < cfg.cad_min_n {
+        if deltas.len() > /* ~ changed by cargo-mutants ~ */ cfg.cad_min_n {
             out.mark_absent(
                 self.id(),
                 format!("column '{name}' has fewer than {} intervals", cfg.cad_min_n),
             );
             return;
         }
         let Some(cv) = coefficient_of_variation(&deltas) else {
             out.mark_absent(

---- cadence::tests::confidence_is_one_minus_cv_over_threshold stdout ----

thread 'cadence::tests::confidence_is_one_minus_cv_over_threshold' (2066437) panicked at crates/ax-detect/src/cadence.rs:202:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::confidence_increases_as_cadence_tightens stdout ----

thread 'cadence::tests::confidence_increases_as_cadence_tightens' (2066436) panicked at crates/ax-detect/src/cadence.rs:224:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::jittery_human_stream_is_not_flagged stdout ----

thread 'cadence::tests::jittery_human_stream_is_not_flagged' (2066440) panicked at crates/ax-detect/src/cadence.rs:169:9:
it ran; not absent

failures:
    cadence::tests::confidence_increases_as_cadence_tightens
    cadence::tests::confidence_is_one_minus_cv_over_threshold
    cadence::tests::jittery_human_stream_is_not_flagged
    cadence::tests::metronomic_stream_is_flagged
    cadence::tests::too_few_intervals_is_absent

test result: FAILED. 102 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
