*** crates/ax-detect/src/cadence.rs:77:27: replace > with < in <impl Detector for CadenceDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace > with < in <impl Detector for CadenceDetector>::detect
@@ -69,17 +69,17 @@
                 format!("column '{name}' is not a progressing time series (non-positive mean interval)"),
             );
             return;
         };
 
         // Written `threshold > cv` (not `cv < threshold`) so the measure-zero
         // boundary mutant has a distinct `>`/`>=` descriptor — letting the
         // genuinely-killable `min_n` `<` above stay under the gate.
-        if cfg.cad_max_cv > cv {
+        if cfg.cad_max_cv < /* ~ changed by cargo-mutants ~ */ cv {
             // Lower CV ⇒ more metronomic ⇒ higher confidence.
             let confidence = (1.0 - cv / cfg.cad_max_cv).clamp(0.0, 1.0);
             out.push(Finding::new(
                 self.id(),
                 AnomalyClass::Cadence,
                 Handle::Column { name: name.to_string() },
                 confidence,
                 cv,

---- cadence::tests::confidence_increases_as_cadence_tightens stdout ----

thread 'cadence::tests::confidence_increases_as_cadence_tightens' (2067798) panicked at crates/ax-detect/src/cadence.rs:224:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::confidence_is_one_minus_cv_over_threshold stdout ----

thread 'cadence::tests::confidence_is_one_minus_cv_over_threshold' (2067799) panicked at crates/ax-detect/src/cadence.rs:202:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cadence::tests::jittery_human_stream_is_not_flagged stdout ----

thread 'cadence::tests::jittery_human_stream_is_not_flagged' (2067802) panicked at crates/ax-detect/src/cadence.rs:168:9:
ragged cadence is not anomalous

failures:
    cadence::tests::confidence_increases_as_cadence_tightens
    cadence::tests::confidence_is_one_minus_cv_over_threshold
    cadence::tests::jittery_human_stream_is_not_flagged
    cadence::tests::metronomic_stream_is_flagged
    cadence::tests::runs_at_exactly_min_n_intervals

test result: FAILED. 102 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
