*** crates/ax-detect/src/cadence.rs:79:35: replace - with / in <impl Detector for CadenceDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/cadence.rs
+++ replace - with / in <impl Detector for CadenceDetector>::detect
@@ -71,17 +71,17 @@
             return;
         };
 
         // Written `threshold > cv` (not `cv < threshold`) so the measure-zero
         // boundary mutant has a distinct `>`/`>=` descriptor — letting the
         // genuinely-killable `min_n` `<` above stay under the gate.
         if cfg.cad_max_cv > cv {
             // Lower CV ⇒ more metronomic ⇒ higher confidence.
-            let confidence = (1.0 - cv / cfg.cad_max_cv).clamp(0.0, 1.0);
+            let confidence = (1.0 / /* ~ changed by cargo-mutants ~ */ cv / cfg.cad_max_cv).clamp(0.0, 1.0);
             out.push(Finding::new(
                 self.id(),
                 AnomalyClass::Cadence,
                 Handle::Column { name: name.to_string() },
                 confidence,
                 cv,
                 format!(
                     "column '{name}': inter-arrival CV={cv:.5} < {:.5} — metronomic (automated) cadence",

---- cadence::tests::confidence_is_one_minus_cv_over_threshold stdout ----

thread 'cadence::tests::confidence_is_one_minus_cv_over_threshold' (2068647) panicked at crates/ax-detect/src/cadence.rs:206:9:
assertion failed: (f.confidence - expected).abs() < 1e-12

---- cadence::tests::confidence_increases_as_cadence_tightens stdout ----

thread 'cadence::tests::confidence_increases_as_cadence_tightens' (2068646) panicked at crates/ax-detect/src/cadence.rs:226:9:
assertion failed: c2.findings[0].confidence > c1.findings[0].confidence

failures:
    cadence::tests::confidence_increases_as_cadence_tightens
    cadence::tests::confidence_is_one_minus_cv_over_threshold

test result: FAILED. 105 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
