*** crates/ax-detect/src/coll.rs:25:5: replace cusum_changepoint -> usize with 0

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace cusum_changepoint -> usize with 0
@@ -17,29 +17,17 @@
 use ax_core::{AnomalyClass, Finding};
 
 #[derive(Debug, Default, Clone)]
 pub struct CusumDetector;
 
 /// Index `m` (a split into `[0, m)` and `[m, n)`) that maximizes `|CUSUM|` over
 /// interior split points. Returns `0` if there is no interior split.
 pub fn cusum_changepoint(xs: &[f64], mean: f64) -> usize {
-    let n = xs.len();
-    let mut s = 0.0_f64;
-    let mut best = -1.0_f64;
-    let mut m = 0;
-    for (k, &x) in xs.iter().enumerate() {
-        s += x - mean;
-        let split = k + 1;
-        if split < n && s.abs() > best {
-            best = s.abs();
-            m = split;
-        }
-    }
-    m
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Standardized two-segment mean difference
 /// `|meanL − meanR| / (σ·√(1/nl + 1/nr))`. Extracted so the exact arithmetic is
 /// pinned by tests.
 pub fn standardized_shift(mean_l: f64, mean_r: f64, sigma: f64, nl: usize, nr: usize) -> f64 {
     let se = sigma * (1.0 / nl as f64 + 1.0 / nr as f64).sqrt();
     (mean_l - mean_r).abs() / se

---- coll::tests::changepoint_breaks_ties_to_the_first_peak stdout ----

thread 'coll::tests::changepoint_breaks_ties_to_the_first_peak' (1904826) panicked at crates/ax-detect/src/coll.rs:153:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coll::tests::changepoint_on_flat_series_is_first_interior_split stdout ----

thread 'coll::tests::changepoint_on_flat_series_is_first_interior_split' (1904828) panicked at crates/ax-detect/src/coll.rs:146:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coll::tests::changepoint_finds_the_shift_index stdout ----

thread 'coll::tests::changepoint_finds_the_shift_index' (1904827) panicked at crates/ax-detect/src/coll.rs:139:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    coll::tests::changepoint_breaks_ties_to_the_first_peak
    coll::tests::changepoint_finds_the_shift_index
    coll::tests::changepoint_on_flat_series_is_first_interior_split
    coll::tests::sustained_level_shift_is_flagged_as_a_range

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
