*** crates/ax-detect/src/coll.rs:27:20: delete - in cusum_changepoint

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ delete - in cusum_changepoint
@@ -19,17 +19,17 @@
 #[derive(Debug, Default, Clone)]
 pub struct CusumDetector;
 
 /// Index `m` (a split into `[0, m)` and `[m, n)`) that maximizes `|CUSUM|` over
 /// interior split points. Returns `0` if there is no interior split.
 pub fn cusum_changepoint(xs: &[f64], mean: f64) -> usize {
     let n = xs.len();
     let mut s = 0.0_f64;
-    let mut best = -1.0_f64;
+    let mut best =  /* ~ changed by cargo-mutants ~ */1.0_f64;
     let mut m = 0;
     for (k, &x) in xs.iter().enumerate() {
         s += x - mean;
         let split = k + 1;
         if split < n && s.abs() > best {
             best = s.abs();
             m = split;
         }

---- coll::tests::changepoint_on_flat_series_is_first_interior_split stdout ----

thread 'coll::tests::changepoint_on_flat_series_is_first_interior_split' (1905645) panicked at crates/ax-detect/src/coll.rs:158:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::changepoint_on_flat_series_is_first_interior_split

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
