*** crates/ax-detect/src/coll.rs:30:11: replace += with *= in cusum_changepoint

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace += with *= in cusum_changepoint
@@ -22,17 +22,17 @@
 /// Index `m` (a split into `[0, m)` and `[m, n)`) that maximizes `|CUSUM|` over
 /// interior split points. Returns `0` if there is no interior split.
 pub fn cusum_changepoint(xs: &[f64], mean: f64) -> usize {
     let n = xs.len();
     let mut s = 0.0_f64;
     let mut best = -1.0_f64;
     let mut m = 0;
     for (k, &x) in xs.iter().enumerate() {
-        s += x - mean;
+        s *= /* ~ changed by cargo-mutants ~ */ x - mean;
         let split = k + 1;
         if split < n && s.abs() > best {
             best = s.abs();
             m = split;
         }
     }
     m
 }

---- coll::tests::changepoint_finds_the_shift_index stdout ----

thread 'coll::tests::changepoint_finds_the_shift_index' (1906049) panicked at crates/ax-detect/src/coll.rs:151:9:
assertion `left == right` failed
  left: 1
 right: 3

---- coll::tests::sustained_level_shift_is_flagged_as_a_range stdout ----

thread 'coll::tests::sustained_level_shift_is_flagged_as_a_range' (1906057) panicked at crates/ax-detect/src/coll.rs:190:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::changepoint_finds_the_shift_index
    coll::tests::sustained_level_shift_is_flagged_as_a_range

test result: FAILED. 95 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
