*** crates/ax-detect/src/coll.rs:44:5: replace standardized_shift -> f64 with -1.0

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace standardized_shift -> f64 with -1.0
@@ -36,18 +36,17 @@
     }
     m
 }
 
 /// Standardized two-segment mean difference
 /// `|meanL − meanR| / (σ·√(1/nl + 1/nr))`. Extracted so the exact arithmetic is
 /// pinned by tests.
 pub fn standardized_shift(mean_l: f64, mean_r: f64, sigma: f64, nl: usize, nr: usize) -> f64 {
-    let se = sigma * (1.0 / nl as f64 + 1.0 / nr as f64).sqrt();
-    (mean_l - mean_r).abs() / se
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Logistic confidence in the excess of the standardized shift over `threshold`
 /// (shift == threshold ⇒ 0.5), strictly increasing in the shift.
 fn shift_confidence(shift: f64, threshold: f64) -> f64 {
     1.0 / (1.0 + (-(shift - threshold)).exp())
 }

---- coll::tests::standardized_shift_is_exact stdout ----

thread 'coll::tests::standardized_shift_is_exact' (1911487) panicked at crates/ax-detect/src/coll.rs:170:9:
assertion failed: (standardized_shift(0.0, 6.0, 2.0, 2, 2) - 3.0).abs() < 1e-12

---- coll::tests::sustained_level_shift_is_flagged_as_a_range stdout ----

thread 'coll::tests::sustained_level_shift_is_flagged_as_a_range' (1911489) panicked at crates/ax-detect/src/coll.rs:189:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::standardized_shift_is_exact
    coll::tests::sustained_level_shift_is_flagged_as_a_range

test result: FAILED. 95 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
