*** crates/ax-detect/src/coll.rs:45:29: replace / with * in standardized_shift

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace / with * in standardized_shift
@@ -37,17 +37,17 @@
     m
 }
 
 /// Standardized two-segment mean difference
 /// `|meanL − meanR| / (σ·√(1/nl + 1/nr))`. Extracted so the exact arithmetic is
 /// pinned by tests.
 pub fn standardized_shift(mean_l: f64, mean_r: f64, sigma: f64, nl: usize, nr: usize) -> f64 {
     let se = sigma * (1.0 / nl as f64 + 1.0 / nr as f64).sqrt();
-    (mean_l - mean_r).abs() / se
+    (mean_l - mean_r).abs() * /* ~ changed by cargo-mutants ~ */ se
 }
 
 /// Logistic confidence in the excess of the standardized shift over `threshold`
 /// (shift == threshold ⇒ 0.5), strictly increasing in the shift.
 fn shift_confidence(shift: f64, threshold: f64) -> f64 {
     1.0 / (1.0 + (-(shift - threshold)).exp())
 }

---- coll::tests::standardized_shift_is_exact stdout ----

thread 'coll::tests::standardized_shift_is_exact' (1915627) panicked at crates/ax-detect/src/coll.rs:171:9:
assertion failed: (standardized_shift(0.0, 6.0, 2.0, 2, 2) - 3.0).abs() < 1e-12

failures:
    coll::tests::standardized_shift_is_exact

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
