*** crates/ax-detect/src/coll.rs:51:5: replace shift_confidence -> f64 with -1.0

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace shift_confidence -> f64 with -1.0
@@ -43,17 +43,17 @@
 pub fn standardized_shift(mean_l: f64, mean_r: f64, sigma: f64, nl: usize, nr: usize) -> f64 {
     let se = sigma * (1.0 / nl as f64 + 1.0 / nr as f64).sqrt();
     (mean_l - mean_r).abs() / se
 }
 
 /// Logistic confidence in the excess of the standardized shift over `threshold`
 /// (shift == threshold ⇒ 0.5), strictly increasing in the shift.
 fn shift_confidence(shift: f64, threshold: f64) -> f64 {
-    1.0 / (1.0 + (-(shift - threshold)).exp())
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 impl Detector for CusumDetector {
     fn id(&self) -> &'static str {
         "coll.cusum"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Collective

---- coll::tests::shift_confidence_is_half_at_threshold_and_monotonic stdout ----

thread 'coll::tests::shift_confidence_is_half_at_threshold_and_monotonic' (1917666) panicked at crates/ax-detect/src/coll.rs:178:9:
assertion `left == right` failed
  left: -1.0
 right: 0.5

failures:
    coll::tests::shift_confidence_is_half_at_threshold_and_monotonic

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
