*** crates/ax-detect/src/coll.rs:62:9: replace <impl Detector for CusumDetector>::detect with ()

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace <impl Detector for CusumDetector>::detect with ()
@@ -54,76 +54,17 @@
 impl Detector for CusumDetector {
     fn id(&self) -> &'static str {
         "coll.cusum"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Collective
     }
     fn detect(&self, ctx: &ScanContext, cfg: &DetectConfig, out: &mut Report) {
-        let mut applicable = false;
-        for col in &ctx.current.columns {
-            if !col.ty.is_numeric() {
-                continue;
-            }
-            // Finite values in row order, with their original row indices.
-            let pairs: Vec<(usize, f64)> = col
-                .cells
-                .iter()
-                .enumerate()
-                .filter_map(|(row, cell)| cell.as_f64().filter(|v| v.is_finite()).map(|v| (row, v)))
-                .collect();
-            if pairs.len() < cfg.coll_min_n {
-                continue;
-            }
-            let xs: Vec<f64> = pairs.iter().map(|(_, v)| *v).collect();
-            let n = xs.len();
-            let mean = det::mean(&xs).unwrap_or(0.0);
-            let sigma = match det::std_dev(&xs) {
-                Some(s) if s > 0.0 => s,
-                _ => continue, // constant column: no shift possible
-            };
-            applicable = true;
-
-            let m = cusum_changepoint(&xs, mean);
-            if m == 0 {
-                continue;
-            }
-            let mean_l = det::mean(&xs[..m]).unwrap_or(0.0);
-            let mean_r = det::mean(&xs[m..]).unwrap_or(0.0);
-            let shift = standardized_shift(mean_l, mean_r, sigma, m, n - m);
-            if shift > cfg.coll_threshold {
-                let start = pairs[m].0;
-                let end = pairs[n - 1].0 + 1;
-                out.push(Finding::new(
-                    self.id(),
-                    AnomalyClass::Collective,
-                    Handle::Range {
-                        column: col.name.clone(),
-                        start,
-                        end,
-                    },
-                    shift_confidence(shift, cfg.coll_threshold),
-                    shift,
-                    format!(
-                        "{}: level shift at row {start} — mean {mean_l:.4} → {mean_r:.4}, standardized shift {shift:.3} > {:.3}",
-                        col.name, cfg.coll_threshold
-                    ),
-                ));
-            }
-        }
-        if !applicable {
-            out.mark_absent(
-                self.id(),
-                format!(
-                    "no numeric column with ≥ {} values and non-zero variance",
-                    cfg.coll_min_n
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use ax_core::{Column, RecordSet, Value};

---- coll::tests::constant_column_is_absent stdout ----

thread 'coll::tests::constant_column_is_absent' (1921869) panicked at crates/ax-detect/src/coll.rs:184:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coll::tests::sustained_level_shift_is_flagged_as_a_range stdout ----

thread 'coll::tests::sustained_level_shift_is_flagged_as_a_range' (1921875) panicked at crates/ax-detect/src/coll.rs:131:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coll::tests::too_short_is_absent stdout ----

thread 'coll::tests::too_short_is_absent' (1921876) panicked at crates/ax-detect/src/coll.rs:177:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::constant_column_is_absent
    coll::tests::sustained_level_shift_is_flagged_as_a_range
    coll::tests::too_short_is_absent

test result: FAILED. 94 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
