*** crates/ax-detect/src/coll.rs:64:16: delete ! in <impl Detector for CusumDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ delete ! in <impl Detector for CusumDetector>::detect
@@ -56,17 +56,17 @@
         "coll.cusum"
     }
     fn class(&self) -> AnomalyClass {
         AnomalyClass::Collective
     }
     fn detect(&self, ctx: &ScanContext, cfg: &DetectConfig, out: &mut Report) {
         let mut applicable = false;
         for col in &ctx.current.columns {
-            if !col.ty.is_numeric() {
+            if  /* ~ changed by cargo-mutants ~ */col.ty.is_numeric() {
                 continue;
             }
             // Finite values in row order, with their original row indices.
             let pairs: Vec<(usize, f64)> = col
                 .cells
                 .iter()
                 .enumerate()
                 .filter_map(|(row, cell)| cell.as_f64().filter(|v| v.is_finite()).map(|v| (row, v)))

---- coll::tests::runs_at_exactly_min_n stdout ----

thread 'coll::tests::runs_at_exactly_min_n' (1922276) panicked at crates/ax-detect/src/coll.rs:215:9:
exactly min_n rows must be assessed

---- coll::tests::stationary_series_has_no_findings stdout ----

thread 'coll::tests::stationary_series_has_no_findings' (1922279) panicked at crates/ax-detect/src/coll.rs:229:9:
it ran; not absent

---- coll::tests::sustained_level_shift_is_flagged_as_a_range stdout ----

thread 'coll::tests::sustained_level_shift_is_flagged_as_a_range' (1922280) panicked at crates/ax-detect/src/coll.rs:190:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::runs_at_exactly_min_n
    coll::tests::stationary_series_has_no_findings
    coll::tests::sustained_level_shift_is_flagged_as_a_range

test result: FAILED. 94 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
