*** crates/ax-detect/src/coll.rs:81:30: replace > with == in <impl Detector for CusumDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace > with == in <impl Detector for CusumDetector>::detect
@@ -73,17 +73,17 @@
                 .collect();
             if pairs.len() < cfg.coll_min_n {
                 continue;
             }
             let xs: Vec<f64> = pairs.iter().map(|(_, v)| *v).collect();
             let n = xs.len();
             let mean = det::mean(&xs).unwrap_or(0.0);
             let sigma = match det::std_dev(&xs) {
-                Some(s) if s > 0.0 => s,
+                Some(s) if s == /* ~ changed by cargo-mutants ~ */ 0.0 => s,
                 _ => continue, // constant column: no shift possible
             };
             applicable = true;
 
             let m = cusum_changepoint(&xs, mean);
             if m == 0 {
                 continue;
             }

---- coll::tests::runs_at_exactly_min_n stdout ----

thread 'coll::tests::runs_at_exactly_min_n' (1924787) panicked at crates/ax-detect/src/coll.rs:215:9:
exactly min_n rows must be assessed

---- coll::tests::constant_column_is_absent stdout ----

thread 'coll::tests::constant_column_is_absent' (1924785) panicked at crates/ax-detect/src/coll.rs:243:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coll::tests::sustained_level_shift_is_flagged_as_a_range stdout ----

thread 'coll::tests::sustained_level_shift_is_flagged_as_a_range' (1924791) panicked at crates/ax-detect/src/coll.rs:190:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::constant_column_is_absent
    coll::tests::runs_at_exactly_min_n
    coll::tests::stationary_series_has_no_findings
    coll::tests::sustained_level_shift_is_flagged_as_a_range

test result: FAILED. 93 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
