*** crates/ax-detect/src/coll.rs:92:72: replace - with / in <impl Detector for CusumDetector>::detect

*** mutation diff:
--- crates/ax-detect/src/coll.rs
+++ replace - with / in <impl Detector for CusumDetector>::detect
@@ -84,17 +84,17 @@
             applicable = true;
 
             let m = cusum_changepoint(&xs, mean);
             if m == 0 {
                 continue;
             }
             let mean_l = det::mean(&xs[..m]).unwrap_or(0.0);
             let mean_r = det::mean(&xs[m..]).unwrap_or(0.0);
-            let shift = standardized_shift(mean_l, mean_r, sigma, m, n - m);
+            let shift = standardized_shift(mean_l, mean_r, sigma, m, n / /* ~ changed by cargo-mutants ~ */ m);
             if shift > cfg.coll_threshold {
                 let start = pairs[m].0;
                 let end = pairs[n - 1].0 + 1;
                 out.push(Finding::new(
                     self.id(),
                     AnomalyClass::Collective,
                     Handle::Range {
                         column: col.name.clone(),

---- coll::tests::sustained_level_shift_is_flagged_as_a_range stdout ----

thread 'coll::tests::sustained_level_shift_is_flagged_as_a_range' (1926441) panicked at crates/ax-detect/src/coll.rs:190:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coll::tests::sustained_level_shift_is_flagged_as_a_range

test result: FAILED. 96 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
