*** crates/ax-normalize/src/binary.rs:18:5: replace read -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/binary.rs
+++ replace read -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -10,31 +10,17 @@
 use crate::format::Format;
 use ax_core::{AxError, Column, Value};
 use polars::prelude::*;
 use std::io::Cursor;
 
 /// Reads a binary `fmt` into columns. Only [`Format::Parquet`] and
 /// [`Format::Arrow`] are handled; anything else is a programming error.
 pub fn read(fmt: Format, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-    let df = match fmt {
-        Format::Parquet => ParquetReader::new(Cursor::new(bytes.to_vec()))
-            .finish()
-            .map_err(|e| parse_err(fmt, e))?,
-        Format::Arrow => IpcReader::new(Cursor::new(bytes.to_vec()))
-            .finish()
-            .map_err(|e| parse_err(fmt, e))?,
-        _ => {
-            return Err(AxError::UnknownFormat(format!(
-                "{} is not a binary format",
-                fmt.token()
-            )))
-        }
-    };
-    Ok(df_to_columns(&df))
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Lowers a Polars `DataFrame` to `RecordSet` columns, preserving column order.
 fn df_to_columns(df: &DataFrame) -> Vec<Column> {
     df.columns()
         .iter()
         .map(|col| {
             let series = col.as_materialized_series();

---- binary::tests::corrupt_bytes_fail_cleanly stdout ----

thread 'binary::tests::corrupt_bytes_fail_cleanly' (1565993) panicked at crates/ax-normalize/src/binary.rs:182:9:
assertion failed: matches!(read(Format::Parquet, b"PAR1 not really parquet"),
    Err(AxError::Parse { .. }))

---- binary::tests::non_binary_format_is_rejected stdout ----

thread 'binary::tests::non_binary_format_is_rejected' (1565994) panicked at crates/ax-normalize/src/binary.rs:174:9:
assertion failed: matches!(read(Format::Csv, b"a,b"), Err(AxError::UnknownFormat(_)))

---- binary::tests::arrow_roundtrips_to_recordset stdout ----

thread 'binary::tests::arrow_roundtrips_to_recordset' (1565992) panicked at crates/ax-normalize/src/binary.rs:149:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    binary::tests::arrow_roundtrips_to_recordset
    binary::tests::corrupt_bytes_fail_cleanly
    binary::tests::non_binary_format_is_rejected
    binary::tests::normalize_routes_binary_through_read_binary
    binary::tests::nulls_survive_the_roundtrip
    binary::tests::parquet_roundtrips_to_recordset

test result: FAILED. 18 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
