*** crates/ax-normalize/src/binary.rs:22:9: delete match arm Format::Arrow in read

*** mutation diff:
--- crates/ax-normalize/src/binary.rs
+++ delete match arm Format::Arrow in read
@@ -14,19 +14,17 @@
 
 /// Reads a binary `fmt` into columns. Only [`Format::Parquet`] and
 /// [`Format::Arrow`] are handled; anything else is a programming error.
 pub fn read(fmt: Format, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
     let df = match fmt {
         Format::Parquet => ParquetReader::new(Cursor::new(bytes.to_vec()))
             .finish()
             .map_err(|e| parse_err(fmt, e))?,
-        Format::Arrow => IpcReader::new(Cursor::new(bytes.to_vec()))
-            .finish()
-            .map_err(|e| parse_err(fmt, e))?,
+         /* ~ changed by cargo-mutants ~ */
         _ => {
             return Err(AxError::UnknownFormat(format!(
                 "{} is not a binary format",
                 fmt.token()
             )))
         }
     };
     Ok(df_to_columns(&df))

---- binary::tests::arrow_roundtrips_to_recordset stdout ----

thread 'binary::tests::arrow_roundtrips_to_recordset' (1567155) panicked at crates/ax-normalize/src/binary.rs:160:63:
called `Result::unwrap()` on an `Err` value: UnknownFormat("arrow is not a binary format")

failures:
    binary::tests::arrow_roundtrips_to_recordset

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
