*** crates/ax-normalize/src/binary.rs:37:5: replace df_to_columns -> Vec<Column> with vec![]

*** mutation diff:
--- crates/ax-normalize/src/binary.rs
+++ replace df_to_columns -> Vec<Column> with vec![]
@@ -29,24 +29,17 @@
             )))
         }
     };
     Ok(df_to_columns(&df))
 }
 
 /// Lowers a Polars `DataFrame` to `RecordSet` columns, preserving column order.
 fn df_to_columns(df: &DataFrame) -> Vec<Column> {
-    df.columns()
-        .iter()
-        .map(|col| {
-            let series = col.as_materialized_series();
-            let cells: Vec<Value> = series.iter().map(any_value_to_value).collect();
-            Column::new(col.name().as_str(), cells)
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps one Polars `AnyValue` into the closed [`Value`] set. Integer widths fold
 /// to `i64`; floats to `f64` (non-finite → `Null`); strings pass through; every
 /// other logical type is preserved as its display string (honest, not dropped).
 fn any_value_to_value(av: AnyValue) -> Value {
     match av {
         AnyValue::Null => Value::Null,

---- binary::tests::arrow_roundtrips_to_recordset stdout ----

thread 'binary::tests::arrow_roundtrips_to_recordset' (1567813) panicked at crates/ax-normalize/src/binary.rs:156:9:
assertion `left == right` failed
  left: 0
 right: 2

---- binary::tests::nulls_survive_the_roundtrip stdout ----

thread 'binary::tests::nulls_survive_the_roundtrip' (1567818) panicked at crates/ax-normalize/src/binary.rs:166:24:
index out of bounds: the len is 0 but the index is 0

---- binary::tests::normalize_routes_binary_through_read_binary stdout ----

thread 'binary::tests::normalize_routes_binary_through_read_binary' (1567817) panicked at crates/ax-normalize/src/binary.rs:174:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    binary::tests::arrow_roundtrips_to_recordset
    binary::tests::normalize_routes_binary_through_read_binary
    binary::tests::nulls_survive_the_roundtrip
    binary::tests::parquet_roundtrips_to_recordset

test result: FAILED. 20 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
