*** crates/ax-normalize/src/format.rs:25:9: replace Format::token -> &'static str with ""

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ replace Format::token -> &'static str with ""
@@ -17,24 +17,17 @@
     Parquet,
     /// Apache Arrow IPC / Feather file (binary columnar). Requires `polars`.
     Arrow,
 }
 
 impl Format {
     /// Stable token recorded in the envelope's `format` field.
     pub fn token(self) -> &'static str {
-        match self {
-            Format::Csv => "csv",
-            Format::Tsv => "tsv",
-            Format::Ndjson => "ndjson",
-            Format::Json => "json",
-            Format::Parquet => "parquet",
-            Format::Arrow => "arrow",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether this format is binary columnar (read via the Polars backbone).
     pub fn is_binary(self) -> bool {
         matches!(self, Format::Parquet | Format::Arrow)
     }
 
     /// Picks a format from a file extension, if recognized.

---- format::tests::format_tokens_are_exact stdout ----

thread 'format::tests::format_tokens_are_exact' (1568465) panicked at crates/ax-normalize/src/format.rs:107:9:
assertion `left == right` failed
  left: ""
 right: "csv"

---- binary::tests::normalize_routes_binary_through_read_binary stdout ----

thread 'binary::tests::normalize_routes_binary_through_read_binary' (1568459) panicked at crates/ax-normalize/src/binary.rs:183:9:
assertion `left == right` failed
  left: ""
 right: "parquet"

failures:
    binary::tests::normalize_routes_binary_through_read_binary
    format::tests::format_tokens_are_exact

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
