*** crates/ax-normalize/src/format.rs:49:13: delete match arm "arrow" | "ipc" | "feather" in Format::from_extension

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm "arrow" | "ipc" | "feather" in Format::from_extension
@@ -41,17 +41,17 @@
     pub fn from_extension(path: &str) -> Option<Format> {
         let ext = path.rsplit('.').next()?.to_ascii_lowercase();
         match ext.as_str() {
             "csv" => Some(Format::Csv),
             "tsv" | "tab" => Some(Format::Tsv),
             "ndjson" | "jsonl" => Some(Format::Ndjson),
             "json" => Some(Format::Json),
             "parquet" | "pq" => Some(Format::Parquet),
-            "arrow" | "ipc" | "feather" => Some(Format::Arrow),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 
     /// Sniffs a format from leading content. Binary magic numbers are checked
     /// first (they are not valid UTF-8); then textual sniffing. `None` if
     /// nothing matches.
     pub fn sniff(bytes: &[u8]) -> Option<Format> {

---- format::tests::binary_extensions_and_magic stdout ----

thread 'format::tests::binary_extensions_and_magic' (1574626) panicked at crates/ax-normalize/src/format.rs:133:9:
assertion `left == right` failed
  left: None
 right: Some(Arrow)

failures:
    format::tests::binary_extensions_and_magic

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
