*** crates/ax-normalize/src/format.rs:79:33: replace >= with < in Format::sniff

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ replace >= with < in Format::sniff
@@ -71,17 +71,17 @@
             '{' => {
                 // One object → json; multiple object-lines → ndjson.
                 let object_lines = trimmed
                     .lines()
                     .filter(|l| !l.trim().is_empty())
                     .take(3)
                     .filter(|l| l.trim_start().starts_with('{'))
                     .count();
-                if object_lines >= 2 {
+                if object_lines < /* ~ changed by cargo-mutants ~ */ 2 {
                     Some(Format::Ndjson)
                 } else {
                     Some(Format::Json)
                 }
             }
             _ => {
                 // Tabular: prefer TSV if a tab appears before any comma on line 1.
                 let line = trimmed.lines().next()?;

---- format::tests::sniff_json_vs_ndjson stdout ----

thread 'format::tests::sniff_json_vs_ndjson' (1577668) panicked at crates/ax-normalize/src/format.rs:163:9:
assertion `left == right` failed
  left: Some(Json)
 right: Some(Ndjson)

---- tests::ndjson_key_union_pads_missing stdout ----

thread 'tests::ndjson_key_union_pads_missing' (1577675) panicked at crates/ax-normalize/src/lib.rs:220:68:
called `Result::unwrap()` on an `Err` value: Parse { format: "json", message: "trailing characters at line 2 column 1" }

failures:
    format::tests::sniff_json_vs_ndjson
    tests::ndjson_key_union_pads_missing

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
