*** crates/ax-normalize/src/format.rs:91:43: replace match guard t < c with false in Format::sniff

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ replace match guard t < c with false in Format::sniff
@@ -83,17 +83,17 @@
                 }
             }
             _ => {
                 // Tabular: prefer TSV if a tab appears before any comma on line 1.
                 let line = trimmed.lines().next()?;
                 // Indices of '\t' and ',' are positions of distinct characters,
                 // so they are never equal; `<` is the only meaningful test.
                 match (line.find('\t'), line.find(',')) {
-                    (Some(t), Some(c)) if t < c => Some(Format::Tsv),
+                    (Some(t), Some(c)) if false /* ~ changed by cargo-mutants ~ */ => Some(Format::Tsv),
                     (Some(_), None) => Some(Format::Tsv),
                     _ => Some(Format::Csv), // comma-first, or single comma-free column
                 }
             }
         }
     }
 
     /// Resolves the format for `source`/`bytes`: extension first, then sniff.

---- format::tests::sniff_uses_delimiter_order_when_both_present stdout ----

thread 'format::tests::sniff_uses_delimiter_order_when_both_present' (1579516) panicked at crates/ax-normalize/src/format.rs:156:9:
assertion `left == right` failed
  left: Some(Csv)
 right: Some(Tsv)

failures:
    format::tests::sniff_uses_delimiter_order_when_both_present

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
