*** crates/ax-normalize/src/format.rs:92:21: delete match arm (Some(_), None) in Format::sniff

*** mutation diff:
--- crates/ax-normalize/src/format.rs
+++ delete match arm (Some(_), None) in Format::sniff
@@ -84,17 +84,17 @@
             }
             _ => {
                 // Tabular: prefer TSV if a tab appears before any comma on line 1.
                 let line = trimmed.lines().next()?;
                 // Indices of '\t' and ',' are positions of distinct characters,
                 // so they are never equal; `<` is the only meaningful test.
                 match (line.find('\t'), line.find(',')) {
                     (Some(t), Some(c)) if t < c => Some(Format::Tsv),
-                    (Some(_), None) => Some(Format::Tsv),
+                     /* ~ changed by cargo-mutants ~ */
                     _ => Some(Format::Csv), // comma-first, or single comma-free column
                 }
             }
         }
     }
 
     /// Resolves the format for `source`/`bytes`: extension first, then sniff.
     pub fn resolve(source: &str, bytes: &[u8]) -> Result<Format, AxError> {

---- format::tests::sniff_csv_vs_tsv stdout ----

thread 'format::tests::sniff_csv_vs_tsv' (1578326) panicked at crates/ax-normalize/src/format.rs:173:9:
assertion `left == right` failed
  left: Some(Csv)
 right: Some(Tsv)

failures:
    format::tests::sniff_csv_vs_tsv

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
