*** crates/ax-normalize/src/infer.rs:27:9: delete match arm "true" | "TRUE" | "True" in infer_scalar

*** mutation diff:
--- crates/ax-normalize/src/infer.rs
+++ delete match arm "true" | "TRUE" | "True" in infer_scalar
@@ -19,17 +19,17 @@
     if let Ok(f) = raw.parse::<f64>() {
         // Reject the textual forms `inf`/`nan` that `f64::parse` accepts but
         // that are not meaningful data values; keep them as strings instead.
         if f.is_finite() {
             return Value::Float(f);
         }
     }
     match raw {
-        "true" | "TRUE" | "True" => return Value::Bool(true),
+         /* ~ changed by cargo-mutants ~ */
         "false" | "FALSE" | "False" => return Value::Bool(false),
         _ => {}
     }
     Value::Str(raw.to_string())
 }
 
 /// Converts a JSON scalar to a [`Value`]. Nested objects/arrays are not
 /// flattened here — they are preserved as their canonical JSON string and typed

---- infer::tests::scalar_inference_precedence stdout ----

thread 'infer::tests::scalar_inference_precedence' (2517566) panicked at crates/ax-normalize/src/infer.rs:71:9:
assertion failed: matches!(infer_scalar("true"), Value::Bool(true))

failures:
    infer::tests::scalar_inference_precedence

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
