*** crates/ax-normalize/src/infer.rs:28:9: delete match arm "false" | "FALSE" | "False" in infer_scalar

*** mutation diff:
--- crates/ax-normalize/src/infer.rs
+++ delete match arm "false" | "FALSE" | "False" in infer_scalar
@@ -20,17 +20,17 @@
         // Reject the textual forms `inf`/`nan` that `f64::parse` accepts but
         // that are not meaningful data values; keep them as strings instead.
         if f.is_finite() {
             return Value::Float(f);
         }
     }
     match raw {
         "true" | "TRUE" | "True" => return Value::Bool(true),
-        "false" | "FALSE" | "False" => return Value::Bool(false),
+         /* ~ changed by cargo-mutants ~ */
         _ => {}
     }
     Value::Str(raw.to_string())
 }
 
 /// Converts a JSON scalar to a [`Value`]. Nested objects/arrays are not
 /// flattened here — they are preserved as their canonical JSON string and typed
 /// as `Str`, so a structural detector can still see them without the normalizer

---- infer::tests::scalar_inference_precedence stdout ----

thread 'infer::tests::scalar_inference_precedence' (1581976) panicked at crates/ax-normalize/src/infer.rs:72:9:
assertion failed: matches!(infer_scalar("false"), Value::Bool(false))

failures:
    infer::tests::scalar_inference_precedence

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
