*** crates/ax-normalize/src/lib.rs:116:5: replace read_json -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace read_json -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -108,27 +108,17 @@
         builder.push_value(val);
     }
     Ok(builder.finish())
 }
 
 /// Reads a single JSON document: an array of records, a lone object (one row),
 /// or a scalar/array (one `value` cell).
 fn read_json(bytes: &[u8], fmt: Format) -> Result<Vec<Column>, AxError> {
-    let val: serde_json::Value = serde_json::from_slice(bytes).map_err(|e| parse_err(fmt, e))?;
-    let mut builder = TableBuilder::new();
-    match val {
-        serde_json::Value::Array(items) => {
-            for item in items {
-                builder.push_value(item);
-            }
-        }
-        other => builder.push_value(other),
-    }
-    Ok(builder.finish())
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 const VALUE_COL: &str = "value";
 
 /// Accumulates JSON records into columns with a stable, sorted key-union order.
 /// Missing keys fill with [`Value::Null`] so every column ends equal length.
 struct TableBuilder {
     order: Vec<String>,

---- tests::json_scalar_goes_to_value_column stdout ----

thread 'tests::json_scalar_goes_to_value_column' (1561853) panicked at crates/ax-normalize/src/lib.rs:227:39:
called `Option::unwrap()` on a `None` value

---- tests::json_array_of_objects stdout ----

thread 'tests::json_array_of_objects' (1561852) panicked at crates/ax-normalize/src/lib.rs:220:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    tests::json_array_of_objects
    tests::json_scalar_goes_to_value_column

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
