*** crates/ax-normalize/src/lib.rs:152:9: replace TableBuilder::ensure -> usize with 0

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace TableBuilder::ensure -> usize with 0
@@ -144,24 +144,17 @@
             index: BTreeMap::new(),
             cols: Vec::new(),
             rows: 0,
         }
     }
 
     /// Ensures a column exists, back-filling it with `Null` for prior rows.
     fn ensure(&mut self, name: &str) -> usize {
-        if let Some(&i) = self.index.get(name) {
-            return i;
-        }
-        let i = self.order.len();
-        self.order.push(name.to_string());
-        self.index.insert(name.to_string(), i);
-        self.cols.push(vec![Value::Null; self.rows]);
-        i
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Adds one record. Objects contribute their fields; anything else goes to
     /// the synthetic `value` column.
     fn push_value(&mut self, val: serde_json::Value) {
         let mut row: BTreeMap<String, Value> = BTreeMap::new();
         match val {
             serde_json::Value::Object(map) => {

---- tests::ndjson_key_union_pads_missing stdout ----

thread 'tests::ndjson_key_union_pads_missing' (1562551) panicked at crates/ax-normalize/src/lib.rs:214:9:
assertion `left == right` failed
  left: 0
 right: 2

---- tests::json_array_of_objects stdout ----

thread 'tests::json_array_of_objects' (1562549) panicked at crates/ax-normalize/src/lib.rs:223:9:
assertion `left == right` failed
  left: 0
 right: 3

---- tests::json_scalar_goes_to_value_column stdout ----

thread 'tests::json_scalar_goes_to_value_column' (1562550) panicked at crates/ax-normalize/src/lib.rs:230:39:
called `Option::unwrap()` on a `None` value

failures:
    tests::json_array_of_objects
    tests::json_scalar_goes_to_value_column
    tests::ndjson_key_union_pads_missing

test result: FAILED. 21 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
