*** crates/ax-normalize/src/lib.rs:165:9: replace TableBuilder::push_value with ()

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace TableBuilder::push_value with ()
@@ -157,35 +157,17 @@
         self.index.insert(name.to_string(), i);
         self.cols.push(vec![Value::Null; self.rows]);
         i
     }
 
     /// Adds one record. Objects contribute their fields; anything else goes to
     /// the synthetic `value` column.
     fn push_value(&mut self, val: serde_json::Value) {
-        let mut row: BTreeMap<String, Value> = BTreeMap::new();
-        match val {
-            serde_json::Value::Object(map) => {
-                for (k, v) in map {
-                    row.insert(k, infer::json_to_value(&v));
-                }
-            }
-            other => {
-                row.insert(VALUE_COL.to_string(), infer::json_to_value(&other));
-            }
-        }
-        for k in row.keys() {
-            self.ensure(k);
-        }
-        for (name, &i) in &self.index {
-            let cell = row.remove(name).unwrap_or(Value::Null);
-            self.cols[i].push(cell);
-        }
-        self.rows += 1;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn finish(self) -> Vec<Column> {
         self.order
             .into_iter()
             .zip(self.cols)
             .map(|(name, cells)| Column::new(name, cells))
             .collect()

---- tests::json_array_of_objects stdout ----

thread 'tests::json_array_of_objects' (1563735) panicked at crates/ax-normalize/src/lib.rs:212:9:
assertion `left == right` failed
  left: 0
 right: 3

---- tests::json_scalar_goes_to_value_column stdout ----

thread 'tests::json_scalar_goes_to_value_column' (1563736) panicked at crates/ax-normalize/src/lib.rs:219:39:
called `Option::unwrap()` on a `None` value

---- tests::ndjson_key_union_pads_missing stdout ----

thread 'tests::ndjson_key_union_pads_missing' (1563737) panicked at crates/ax-normalize/src/lib.rs:203:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    tests::json_array_of_objects
    tests::json_scalar_goes_to_value_column
    tests::ndjson_key_union_pads_missing

test result: FAILED. 21 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
