*** crates/ax-normalize/src/lib.rs:183:19: replace += with -= in TableBuilder::push_value

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace += with -= in TableBuilder::push_value
@@ -175,17 +175,17 @@
         }
         for k in row.keys() {
             self.ensure(k);
         }
         for (name, &i) in &self.index {
             let cell = row.remove(name).unwrap_or(Value::Null);
             self.cols[i].push(cell);
         }
-        self.rows += 1;
+        self.rows -= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     fn finish(self) -> Vec<Column> {
         self.order
             .into_iter()
             .zip(self.cols)
             .map(|(name, cells)| Column::new(name, cells))
             .collect()

---- tests::ndjson_key_union_pads_missing stdout ----

thread 'tests::ndjson_key_union_pads_missing' (1564331) panicked at crates/ax-normalize/src/lib.rs:183:9:
attempt to subtract with overflow

---- tests::json_scalar_goes_to_value_column stdout ----

thread 'tests::json_scalar_goes_to_value_column' (1564330) panicked at crates/ax-normalize/src/lib.rs:183:9:
attempt to subtract with overflow

---- tests::json_array_of_objects stdout ----

thread 'tests::json_array_of_objects' (1564329) panicked at crates/ax-normalize/src/lib.rs:183:9:
attempt to subtract with overflow

failures:
    tests::json_array_of_objects
    tests::json_scalar_goes_to_value_column
    tests::ndjson_key_union_pads_missing

test result: FAILED. 21 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
