*** crates/ax-normalize/src/lib.rs:183:19: replace += with *= in TableBuilder::push_value

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace += with *= in TableBuilder::push_value
@@ -175,17 +175,17 @@
         }
         for k in row.keys() {
             self.ensure(k);
         }
         for (name, &i) in &self.index {
             let cell = row.remove(name).unwrap_or(Value::Null);
             self.cols[i].push(cell);
         }
-        self.rows += 1;
+        self.rows *= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     fn finish(self) -> Vec<Column> {
         self.order
             .into_iter()
             .zip(self.cols)
             .map(|(name, cells)| Column::new(name, cells))
             .collect()

---- tests::ndjson_key_union_pads_missing stdout ----

thread 'tests::ndjson_key_union_pads_missing' (1564991) panicked at crates/ax-core/src/record.rs:73:9:
RecordSet columns must be equal length

failures:
    tests::ndjson_key_union_pads_missing

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
