*** crates/ax-normalize/src/lib.rs:28:5: replace read_binary -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/lib.rs
+++ replace read_binary -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -20,28 +20,17 @@
 pub mod infer;
 
 pub use format::Format;
 
 /// Reads a binary columnar format (Parquet/Arrow) into columns. Behind the
 /// `polars` feature; without it, binary formats fail cleanly (honest absence)
 /// rather than the crate silently mis-handling them.
 fn read_binary(fmt: Format, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-    #[cfg(feature = "polars")]
-    {
-        binary::read(fmt, bytes)
-    }
-    #[cfg(not(feature = "polars"))]
-    {
-        let _ = bytes;
-        Err(AxError::Config(format!(
-            "{} requires the 'polars' feature, which was not built",
-            fmt.token()
-        )))
-    }
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalizes `bytes` from logical `source` into a [`RecordSet`], resolving the
 /// format by extension then content sniff.
 pub fn normalize(source: &str, bytes: &[u8]) -> Result<RecordSet, AxError> {
     let fmt = Format::resolve(source, bytes)?;
     normalize_as(source, bytes, fmt)
 }

---- binary::tests::normalize_routes_binary_through_read_binary stdout ----

thread 'binary::tests::normalize_routes_binary_through_read_binary' (1559940) panicked at crates/ax-normalize/src/binary.rs:181:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    binary::tests::normalize_routes_binary_through_read_binary

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
