*** crates/ax-normalize/src/parser.rs:115:30: replace == with != in ParserRegistry::normalize_with

*** mutation diff:
--- crates/ax-normalize/src/parser.rs
+++ replace == with != in ParserRegistry::normalize_with
@@ -107,17 +107,17 @@
         &self,
         id: &str,
         source: &str,
         bytes: &[u8],
     ) -> Result<RecordSet, AxError> {
         let parser = self
             .parsers
             .iter()
-            .find(|p| p.id() == id)
+            .find(|p| p.id() != /* ~ changed by cargo-mutants ~ */ id)
             .ok_or_else(|| AxError::Config(format!("unknown format id '{id}'")))?;
         Ok(RecordSet::new(
             source,
             parser.id(),
             parser.parse(source, bytes)?,
         ))
     }
 }

---- tests::normalize_with_explicit_id stdout ----

thread 'tests::normalize_with_explicit_id' (2524196) panicked at crates/ax-normalize/src/lib.rs:94:58:
called `Result::unwrap()` on an `Err` value: Parse { format: "parquet", message: "parquet: File out of specification: A parquet file must contain a header and footer with at least 12 bytes" }

failures:
    tests::normalize_with_explicit_id

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
