*** crates/ax-normalize/src/parser.rs:64:9: replace ParserRegistry::ids -> Vec<&'static str> with vec!["xyzzy"]

*** mutation diff:
--- crates/ax-normalize/src/parser.rs
+++ replace ParserRegistry::ids -> Vec<&'static str> with vec!["xyzzy"]
@@ -56,17 +56,17 @@
 
     pub fn register(&mut self, parser: Box<dyn FormatParser>) -> &mut Self {
         self.parsers.push(parser);
         self
     }
 
     /// Registered parser ids, in order (handy for `describe`/tests).
     pub fn ids(&self) -> Vec<&'static str> {
-        self.parsers.iter().map(|p| p.id()).collect()
+        vec!["xyzzy"] /* ~ changed by cargo-mutants ~ */
     }
 
     /// The lower-cased final extension of `source`, if any.
     fn extension(source: &str) -> Option<String> {
         source.rsplit('.').next().map(|e| e.to_ascii_lowercase())
     }
 
     /// Resolves the parser for `source`/`bytes`: a matching file extension wins;

---- parser::tests::default_registry_lists_all_formats stdout ----

thread 'parser::tests::default_registry_lists_all_formats' (2520792) panicked at crates/ax-normalize/src/parser.rs:209:9:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["parquet", "arrow", "ndjson", "json", "tsv", "csv"]

failures:
    parser::tests::default_registry_lists_all_formats

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
