*** crates/ax-normalize/src/parser.rs:69:9: replace ParserRegistry::extension -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/ax-normalize/src/parser.rs
+++ replace ParserRegistry::extension -> Option<String> with Some("xyzzy".into())
@@ -61,17 +61,17 @@
 
     /// Registered parser ids, in order (handy for `describe`/tests).
     pub fn ids(&self) -> Vec<&'static str> {
         self.parsers.iter().map(|p| p.id()).collect()
     }
 
     /// The lower-cased final extension of `source`, if any.
     fn extension(source: &str) -> Option<String> {
-        source.rsplit('.').next().map(|e| e.to_ascii_lowercase())
+        Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolves the parser for `source`/`bytes`: a matching file extension wins;
     /// otherwise the highest-confidence content sniff (first registered on a
     /// tie). An unrecognized stream is [`AxError::UnknownFormat`], never a guess.
     pub fn resolve(&self, source: &str, bytes: &[u8]) -> Result<&dyn FormatParser, AxError> {
         if let Some(ext) = Self::extension(source) {
             if let Some(p) = self

---- parser::tests::binary_extensions_resolve stdout ----

thread 'parser::tests::binary_extensions_resolve' (2522756) panicked at crates/ax-normalize/src/parser.rs:195:9:
assertion `left == right` failed
  left: "csv"
 right: "parquet"

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2522760) panicked at crates/ax-normalize/src/parser.rs:184:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

---- parser::tests::extension_wins_over_content stdout ----

thread 'parser::tests::extension_wins_over_content' (2522761) panicked at crates/ax-normalize/src/parser.rs:144:9:
assertion `left == right` failed
  left: "json"
 right: "csv"

failures:
    parser::tests::binary_extensions_resolve
    parser::tests::extension_overrides_content_sniff
    parser::tests::extension_wins_over_content

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
