*** crates/ax-normalize/src/parser.rs:89:48: replace > with < in ParserRegistry::resolve

*** mutation diff:
--- crates/ax-normalize/src/parser.rs
+++ replace > with < in ParserRegistry::resolve
@@ -81,17 +81,17 @@
             {
                 return Ok(p.as_ref());
             }
         }
         // Highest sniff confidence; strict `>` keeps the first registered winner.
         let mut best: Option<(Confidence, &dyn FormatParser)> = None;
         for p in &self.parsers {
             if let Some(c) = p.sniff(bytes) {
-                if best.is_none_or(|(bc, _)| c > bc) {
+                if best.is_none_or(|(bc, _)| c < /* ~ changed by cargo-mutants ~ */ bc) {
                     best = Some((c, p.as_ref()));
                 }
             }
         }
         best.map(|(_, p)| p)
             .ok_or_else(|| AxError::UnknownFormat(source.to_string()))
     }

---- parser::tests::binary_magic_outranks_text_sniff stdout ----

thread 'parser::tests::binary_magic_outranks_text_sniff' (2523411) panicked at crates/ax-normalize/src/parser.rs:161:9:
assertion `left == right` failed
  left: "csv"
 right: "parquet"

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2523416) panicked at crates/ax-normalize/src/parser.rs:150:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

---- tests::ndjson_end_to_end stdout ----

thread 'tests::ndjson_end_to_end' (2523442) panicked at crates/ax-normalize/src/lib.rs:55:68:
called `Result::unwrap()` on an `Err` value: Parse { format: "json", message: "trailing characters at line 2 column 1" }

failures:
    parser::tests::binary_magic_outranks_text_sniff
    parser::tests::sniff_used_without_a_known_extension
    tests::ndjson_end_to_end
    tests::tsv_sniffed_from_content

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
