*** crates/ax-normalize/src/parsers/columnar.rs:100:9: replace <impl FormatParser for ArrowParser>::extensions -> &'static[&'static str] with Vec::leak(vec![""])

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ArrowParser>::extensions -> &'static[&'static str] with Vec::leak(vec![""])
@@ -92,17 +92,17 @@
 #[derive(Debug, Default, Clone)]
 pub struct ArrowParser;
 
 impl FormatParser for ArrowParser {
     fn id(&self) -> &'static str {
         "arrow"
     }
     fn extensions(&self) -> &'static [&'static str] {
-        &["arrow", "ipc", "feather"]
+        Vec::leak(vec![""]) /* ~ changed by cargo-mutants ~ */
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Arrow IPC files begin with "ARROW1".
         bytes.starts_with(b"ARROW1").then_some(MAGIC)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let df = IpcReader::new(Cursor::new(bytes.to_vec()))
             .finish()

---- parser::tests::binary_extensions_resolve stdout ----

thread 'parser::tests::binary_extensions_resolve' (2572984) panicked at crates/ax-normalize/src/parser.rs:197:9:
assertion `left == right` failed
  left: "csv"
 right: "arrow"

failures:
    parser::tests::binary_extensions_resolve

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
