*** crates/ax-normalize/src/parsers/columnar.rs:104:9: replace <impl FormatParser for ArrowParser>::sniff -> Option<Confidence> with None

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ArrowParser>::sniff -> Option<Confidence> with None
@@ -96,17 +96,17 @@
     fn id(&self) -> &'static str {
         "arrow"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["arrow", "ipc", "feather"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Arrow IPC files begin with "ARROW1".
-        bytes.starts_with(b"ARROW1").then_some(MAGIC)
+        None /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let df = IpcReader::new(Cursor::new(bytes.to_vec()))
             .finish()
             .map_err(|e| parse_err(self.id(), e))?;
         Ok(df_to_columns(&df))
     }
 }

---- parser::tests::binary_magic_outranks_text_sniff stdout ----

thread 'parser::tests::binary_magic_outranks_text_sniff' (2574316) panicked at crates/ax-normalize/src/parser.rs:162:9:
assertion `left == right` failed
  left: "csv"
 right: "arrow"

---- parsers::columnar::tests::sniff_matches_magic stdout ----

thread 'parsers::columnar::tests::sniff_matches_magic' (2574329) panicked at crates/ax-normalize/src/parsers/columnar.rs:206:9:
assertion `left == right` failed
  left: None
 right: Some(100)

failures:
    parser::tests::binary_magic_outranks_text_sniff
    parsers::columnar::tests::sniff_matches_magic

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
