*** crates/ax-normalize/src/parsers/columnar.rs:104:9: replace <impl FormatParser for ArrowParser>::sniff -> Option<Confidence> with Some(Default::default())

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ArrowParser>::sniff -> Option<Confidence> with Some(Default::default())
@@ -96,17 +96,17 @@
     fn id(&self) -> &'static str {
         "arrow"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["arrow", "ipc", "feather"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Arrow IPC files begin with "ARROW1".
-        bytes.starts_with(b"ARROW1").then_some(MAGIC)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let df = IpcReader::new(Cursor::new(bytes.to_vec()))
             .finish()
             .map_err(|e| parse_err(self.id(), e))?;
         Ok(df_to_columns(&df))
     }
 }

---- parser::tests::binary_magic_outranks_text_sniff stdout ----

thread 'parser::tests::binary_magic_outranks_text_sniff' (2574949) panicked at crates/ax-normalize/src/parser.rs:162:9:
assertion `left == right` failed
  left: "csv"
 right: "arrow"

---- parser::tests::unrecognized_stream_errors stdout ----

thread 'parser::tests::unrecognized_stream_errors' (2574955) panicked at crates/ax-normalize/src/parser.rs:173:9:
assertion failed: matches!(reg().resolve("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

---- parsers::columnar::tests::sniff_matches_magic stdout ----

thread 'parsers::columnar::tests::sniff_matches_magic' (2574962) panicked at crates/ax-normalize/src/parsers/columnar.rs:206:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(100)

failures:
    parser::tests::binary_magic_outranks_text_sniff
    parser::tests::unrecognized_stream_errors
    parsers::columnar::tests::sniff_matches_magic
    tests::unknown_format_errors

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
