*** crates/ax-normalize/src/parsers/columnar.rs:107:9: replace <impl FormatParser for ArrowParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ArrowParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -99,20 +99,17 @@
     fn extensions(&self) -> &'static [&'static str] {
         &["arrow", "ipc", "feather"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Arrow IPC files begin with "ARROW1".
         bytes.starts_with(b"ARROW1").then_some(MAGIC)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-        let df = IpcReader::new(Cursor::new(bytes.to_vec()))
-            .finish()
-            .map_err(|e| parse_err(self.id(), e))?;
-        Ok(df_to_columns(&df))
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use ax_core::ColType;

---- parsers::columnar::tests::arrow_roundtrips_to_columns stdout ----

thread 'parsers::columnar::tests::arrow_roundtrips_to_columns' (2575566) panicked at crates/ax-normalize/src/parsers/columnar.rs:176:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    parsers::columnar::tests::arrow_roundtrips_to_columns

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
