*** crates/ax-normalize/src/parsers/columnar.rs:75:9: replace <impl FormatParser for ParquetParser>::id -> &'static str with ""

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ParquetParser>::id -> &'static str with ""
@@ -67,17 +67,17 @@
     }
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct ParquetParser;
 
 impl FormatParser for ParquetParser {
     fn id(&self) -> &'static str {
-        "parquet"
+        "" /* ~ changed by cargo-mutants ~ */
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["parquet", "pq"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Parquet files begin (and end) with the 4-byte magic "PAR1".
         bytes.starts_with(b"PAR1").then_some(MAGIC)
     }

---- parser::tests::binary_magic_outranks_text_sniff stdout ----

thread 'parser::tests::binary_magic_outranks_text_sniff' (2565398) panicked at crates/ax-normalize/src/parser.rs:161:9:
assertion `left == right` failed
  left: ""
 right: "parquet"

---- parser::tests::binary_extensions_resolve stdout ----

thread 'parser::tests::binary_extensions_resolve' (2565397) panicked at crates/ax-normalize/src/parser.rs:195:9:
assertion `left == right` failed
  left: ""
 right: "parquet"

---- parser::tests::default_registry_lists_all_formats stdout ----

thread 'parser::tests::default_registry_lists_all_formats' (2565400) panicked at crates/ax-normalize/src/parser.rs:209:9:
assertion `left == right` failed
  left: ["", "arrow", "ndjson", "json", "tsv", "csv"]
 right: ["parquet", "arrow", "ndjson", "json", "tsv", "csv"]

failures:
    parser::tests::binary_extensions_resolve
    parser::tests::binary_magic_outranks_text_sniff
    parser::tests::default_registry_lists_all_formats
    tests::parquet_routes_through_the_registry

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
