*** crates/ax-normalize/src/parsers/columnar.rs:78:9: replace <impl FormatParser for ParquetParser>::extensions -> &'static[&'static str] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ParquetParser>::extensions -> &'static[&'static str] with Vec::leak(Vec::new())
@@ -70,17 +70,17 @@
 #[derive(Debug, Default, Clone)]
 pub struct ParquetParser;
 
 impl FormatParser for ParquetParser {
     fn id(&self) -> &'static str {
         "parquet"
     }
     fn extensions(&self) -> &'static [&'static str] {
-        &["parquet", "pq"]
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Parquet files begin (and end) with the 4-byte magic "PAR1".
         bytes.starts_with(b"PAR1").then_some(MAGIC)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let df = ParquetReader::new(Cursor::new(bytes.to_vec()))
             .finish()

---- parser::tests::binary_extensions_resolve stdout ----

thread 'parser::tests::binary_extensions_resolve' (2566799) panicked at crates/ax-normalize/src/parser.rs:195:9:
assertion `left == right` failed
  left: "csv"
 right: "parquet"

failures:
    parser::tests::binary_extensions_resolve

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
