*** crates/ax-normalize/src/parsers/columnar.rs:82:9: replace <impl FormatParser for ParquetParser>::sniff -> Option<Confidence> with None

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ParquetParser>::sniff -> Option<Confidence> with None
@@ -74,17 +74,17 @@
     fn id(&self) -> &'static str {
         "parquet"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["parquet", "pq"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Parquet files begin (and end) with the 4-byte magic "PAR1".
-        bytes.starts_with(b"PAR1").then_some(MAGIC)
+        None /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let df = ParquetReader::new(Cursor::new(bytes.to_vec()))
             .finish()
             .map_err(|e| parse_err(self.id(), e))?;
         Ok(df_to_columns(&df))
     }
 }

---- parser::tests::binary_magic_outranks_text_sniff stdout ----

thread 'parser::tests::binary_magic_outranks_text_sniff' (2568879) panicked at crates/ax-normalize/src/parser.rs:161:9:
assertion `left == right` failed
  left: "csv"
 right: "parquet"

---- parsers::columnar::tests::sniff_matches_magic stdout ----

thread 'parsers::columnar::tests::sniff_matches_magic' (2568892) panicked at crates/ax-normalize/src/parsers/columnar.rs:204:9:
assertion `left == right` failed
  left: None
 right: Some(100)

failures:
    parser::tests::binary_magic_outranks_text_sniff
    parsers::columnar::tests::sniff_matches_magic

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
