*** crates/ax-normalize/src/parsers/columnar.rs:82:9: replace <impl FormatParser for ParquetParser>::sniff -> Option<Confidence> with Some(Default::default())

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ParquetParser>::sniff -> Option<Confidence> with Some(Default::default())
@@ -74,17 +74,17 @@
     fn id(&self) -> &'static str {
         "parquet"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["parquet", "pq"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Parquet files begin (and end) with the 4-byte magic "PAR1".
-        bytes.starts_with(b"PAR1").then_some(MAGIC)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let df = ParquetReader::new(Cursor::new(bytes.to_vec()))
             .finish()
             .map_err(|e| parse_err(self.id(), e))?;
         Ok(df_to_columns(&df))
     }
 }

---- parser::tests::binary_magic_outranks_text_sniff stdout ----

thread 'parser::tests::binary_magic_outranks_text_sniff' (2569548) panicked at crates/ax-normalize/src/parser.rs:161:9:
assertion `left == right` failed
  left: "csv"
 right: "parquet"

---- parser::tests::unrecognized_stream_errors stdout ----

thread 'parser::tests::unrecognized_stream_errors' (2569554) panicked at crates/ax-normalize/src/parser.rs:173:9:
assertion failed: matches!(reg().resolve("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

---- parsers::columnar::tests::sniff_matches_magic stdout ----

thread 'parsers::columnar::tests::sniff_matches_magic' (2569561) panicked at crates/ax-normalize/src/parsers/columnar.rs:204:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(100)

failures:
    parser::tests::binary_magic_outranks_text_sniff
    parser::tests::unrecognized_stream_errors
    parsers::columnar::tests::sniff_matches_magic
    tests::unknown_format_errors

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
