*** crates/ax-normalize/src/parsers/columnar.rs:85:9: replace <impl FormatParser for ParquetParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ParquetParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -77,20 +77,17 @@
     fn extensions(&self) -> &'static [&'static str] {
         &["parquet", "pq"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Parquet files begin (and end) with the 4-byte magic "PAR1".
         bytes.starts_with(b"PAR1").then_some(MAGIC)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-        let df = ParquetReader::new(Cursor::new(bytes.to_vec()))
-            .finish()
-            .map_err(|e| parse_err(self.id(), e))?;
-        Ok(df_to_columns(&df))
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct ArrowParser;
 
 impl FormatParser for ArrowParser {
     fn id(&self) -> &'static str {

---- parsers::columnar::tests::corrupt_bytes_fail_cleanly stdout ----

thread 'parsers::columnar::tests::corrupt_bytes_fail_cleanly' (2570223) panicked at crates/ax-normalize/src/parsers/columnar.rs:193:9:
assertion failed: matches!(ParquetParser.parse("d.parquet", b"PAR1 not really parquet"),
    Err(AxError::Parse { .. }))

---- tests::parquet_routes_through_the_registry stdout ----

thread 'tests::parquet_routes_through_the_registry' (2570247) panicked at crates/ax-normalize/src/lib.rs:108:9:
assertion `left == right` failed
  left: 0
 right: 2

---- parsers::columnar::tests::nulls_survive_the_roundtrip stdout ----

thread 'parsers::columnar::tests::nulls_survive_the_roundtrip' (2570225) panicked at crates/ax-normalize/src/parsers/columnar.rs:188:24:
index out of bounds: the len is 0 but the index is 0

failures:
    parsers::columnar::tests::corrupt_bytes_fail_cleanly
    parsers::columnar::tests::nulls_survive_the_roundtrip
    parsers::columnar::tests::parquet_roundtrips_to_columns
    tests::parquet_routes_through_the_registry

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
