*** crates/ax-normalize/src/parsers/columnar.rs:97:9: replace <impl FormatParser for ArrowParser>::id -> &'static str with ""

*** mutation diff:
--- crates/ax-normalize/src/parsers/columnar.rs
+++ replace <impl FormatParser for ArrowParser>::id -> &'static str with ""
@@ -89,17 +89,17 @@
     }
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct ArrowParser;
 
 impl FormatParser for ArrowParser {
     fn id(&self) -> &'static str {
-        "arrow"
+        "" /* ~ changed by cargo-mutants ~ */
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["arrow", "ipc", "feather"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Arrow IPC files begin with "ARROW1".
         bytes.starts_with(b"ARROW1").then_some(MAGIC)
     }

---- parser::tests::binary_magic_outranks_text_sniff stdout ----

thread 'parser::tests::binary_magic_outranks_text_sniff' (2570994) panicked at crates/ax-normalize/src/parser.rs:162:9:
assertion `left == right` failed
  left: ""
 right: "arrow"

---- parser::tests::binary_extensions_resolve stdout ----

thread 'parser::tests::binary_extensions_resolve' (2570993) panicked at crates/ax-normalize/src/parser.rs:197:9:
assertion `left == right` failed
  left: ""
 right: "arrow"

---- parser::tests::default_registry_lists_all_formats stdout ----

thread 'parser::tests::default_registry_lists_all_formats' (2570996) panicked at crates/ax-normalize/src/parser.rs:209:9:
assertion `left == right` failed
  left: ["parquet", "", "ndjson", "json", "tsv", "csv"]
 right: ["parquet", "arrow", "ndjson", "json", "tsv", "csv"]

failures:
    parser::tests::binary_extensions_resolve
    parser::tests::binary_magic_outranks_text_sniff
    parser::tests::default_registry_lists_all_formats

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
