*** crates/ax-normalize/src/parsers/delimited.rs:100:9: replace <impl FormatParser for TsvParser>::id -> &'static str with ""

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for TsvParser>::id -> &'static str with ""
@@ -92,17 +92,17 @@
     }
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct TsvParser;
 
 impl FormatParser for TsvParser {
     fn id(&self) -> &'static str {
-        "tsv"
+        "" /* ~ changed by cargo-mutants ~ */
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["tsv", "tab"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         tabular_first_line(bytes)
             .filter(|l| tab_before_comma(l))
             .map(|_| TEXT)

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2544185) panicked at crates/ax-normalize/src/parser.rs:184:9:
assertion `left == right` failed
  left: ""
 right: "tsv"

---- parser::tests::default_registry_lists_all_formats stdout ----

thread 'parser::tests::default_registry_lists_all_formats' (2544184) panicked at crates/ax-normalize/src/parser.rs:209:9:
assertion `left == right` failed
  left: ["parquet", "arrow", "ndjson", "json", "", "csv"]
 right: ["parquet", "arrow", "ndjson", "json", "tsv", "csv"]

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2544187) panicked at crates/ax-normalize/src/parser.rs:150:9:
assertion `left == right` failed
  left: ""
 right: "tsv"

failures:
    parser::tests::default_registry_lists_all_formats
    parser::tests::extension_overrides_content_sniff
    parser::tests::sniff_used_without_a_known_extension
    tests::tsv_sniffed_from_content

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
