*** crates/ax-normalize/src/parsers/delimited.rs:103:9: replace <impl FormatParser for TsvParser>::extensions -> &'static[&'static str] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for TsvParser>::extensions -> &'static[&'static str] with Vec::leak(Vec::new())
@@ -95,17 +95,17 @@
 #[derive(Debug, Default, Clone)]
 pub struct TsvParser;
 
 impl FormatParser for TsvParser {
     fn id(&self) -> &'static str {
         "tsv"
     }
     fn extensions(&self) -> &'static [&'static str] {
-        &["tsv", "tab"]
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         tabular_first_line(bytes)
             .filter(|l| tab_before_comma(l))
             .map(|_| TEXT)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         read_delimited(bytes, b'\t', self.id())

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2545448) panicked at crates/ax-normalize/src/parser.rs:184:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

failures:
    parser::tests::extension_overrides_content_sniff

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
