*** crates/ax-normalize/src/parsers/delimited.rs:106:9: replace <impl FormatParser for TsvParser>::sniff -> Option<Confidence> with None

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for TsvParser>::sniff -> Option<Confidence> with None
@@ -98,19 +98,17 @@
 impl FormatParser for TsvParser {
     fn id(&self) -> &'static str {
         "tsv"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["tsv", "tab"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
-        tabular_first_line(bytes)
-            .filter(|l| tab_before_comma(l))
-            .map(|_| TEXT)
+        None /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         read_delimited(bytes, b'\t', self.id())
     }
 }
 
 #[cfg(test)]
 mod tests {

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2547414) panicked at crates/ax-normalize/src/parser.rs:150:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2547425) panicked at crates/ax-normalize/src/parsers/delimited.rs:151:9:
assertion `left == right` failed
  left: None
 right: Some(50)

---- tests::tsv_sniffed_from_content stdout ----

thread 'tests::tsv_sniffed_from_content' (2547444) panicked at crates/ax-normalize/src/lib.rs:72:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

failures:
    parser::tests::sniff_used_without_a_known_extension
    parsers::delimited::tests::sniff_confidences
    tests::tsv_sniffed_from_content

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
