*** crates/ax-normalize/src/parsers/delimited.rs:106:9: replace <impl FormatParser for TsvParser>::sniff -> Option<Confidence> with Some(Default::default())

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for TsvParser>::sniff -> Option<Confidence> with Some(Default::default())
@@ -98,19 +98,17 @@
 impl FormatParser for TsvParser {
     fn id(&self) -> &'static str {
         "tsv"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["tsv", "tab"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
-        tabular_first_line(bytes)
-            .filter(|l| tab_before_comma(l))
-            .map(|_| TEXT)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         read_delimited(bytes, b'\t', self.id())
     }
 }
 
 #[cfg(test)]
 mod tests {

---- parser::tests::unrecognized_stream_errors stdout ----

thread 'parser::tests::unrecognized_stream_errors' (2548116) panicked at crates/ax-normalize/src/parser.rs:173:9:
assertion failed: matches!(reg().resolve("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2548115) panicked at crates/ax-normalize/src/parser.rs:150:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2548126) panicked at crates/ax-normalize/src/parsers/delimited.rs:151:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(50)

failures:
    parser::tests::sniff_used_without_a_known_extension
    parser::tests::unrecognized_stream_errors
    parsers::delimited::tests::sniff_confidences
    tests::tsv_sniffed_from_content
    tests::unknown_format_errors

test result: FAILED. 35 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
