*** crates/ax-normalize/src/parsers/delimited.rs:111:9: replace <impl FormatParser for TsvParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for TsvParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -103,17 +103,17 @@
         &["tsv", "tab"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         tabular_first_line(bytes)
             .filter(|l| tab_before_comma(l))
             .map(|_| TEXT)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-        read_delimited(bytes, b'\t', self.id())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use ax_core::ColType;

---- parsers::delimited::tests::tsv_parses_tab_delimited stdout ----

thread 'parsers::delimited::tests::tsv_parses_tab_delimited' (2548765) panicked at crates/ax-normalize/src/parsers/delimited.rs:146:9:
assertion `left == right` failed
  left: 0
 right: 2

---- tests::tsv_sniffed_from_content stdout ----

thread 'tests::tsv_sniffed_from_content' (2548782) panicked at crates/ax-normalize/src/lib.rs:73:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    parsers::delimited::tests::tsv_parses_tab_delimited
    tests::tsv_sniffed_from_content

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
