*** crates/ax-normalize/src/parsers/delimited.rs:14:5: replace read_delimited -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace read_delimited -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -6,50 +6,17 @@
 
 use crate::infer;
 use crate::parser::{Confidence, FormatParser, FALLBACK, TEXT};
 use ax_core::{AxError, Column, Value};
 
 /// Reads delimited text with a header row. Field count is normalized to the
 /// header width: short rows pad with [`Value::Null`], long rows truncate.
 fn read_delimited(bytes: &[u8], delim: u8, id: &str) -> Result<Vec<Column>, AxError> {
-    let mut rdr = csv::ReaderBuilder::new()
-        .delimiter(delim)
-        .flexible(true)
-        .has_headers(true)
-        .from_reader(bytes);
-
-    let err = |e: csv::Error| AxError::Parse {
-        format: id.to_string(),
-        message: e.to_string(),
-    };
-
-    let headers = rdr
-        .headers()
-        .map_err(err)?
-        .iter()
-        .map(|h| h.to_string())
-        .collect::<Vec<_>>();
-
-    let mut cols: Vec<Vec<Value>> = vec![Vec::new(); headers.len()];
-    for rec in rdr.records() {
-        let rec = rec.map_err(err)?;
-        for (i, col) in cols.iter_mut().enumerate() {
-            match rec.get(i) {
-                Some(field) => col.push(infer::infer_scalar(field)),
-                None => col.push(Value::Null),
-            }
-        }
-    }
-
-    Ok(headers
-        .into_iter()
-        .zip(cols)
-        .map(|(name, cells)| Column::new(name, cells))
-        .collect())
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// True if a tab appears before any comma on `line` (or a tab with no comma) —
 /// the signal that a stream is tab- rather than comma-delimited.
 ///
 /// `t` and `c` are byte offsets of distinct characters, so they are never
 /// equal; `<` is the only meaningful comparison (its `<=` mutant is therefore
 /// equivalent — see `.cargo/mutants.toml`).

---- parsers::delimited::tests::ragged_csv_pads_and_truncates stdout ----

thread 'parsers::delimited::tests::ragged_csv_pads_and_truncates' (2530323) panicked at crates/ax-normalize/src/parsers/delimited.rs:106:24:
index out of bounds: the len is 0 but the index is 1

---- parsers::delimited::tests::csv_roundtrip_types_and_nulls stdout ----

thread 'parsers::delimited::tests::csv_roundtrip_types_and_nulls' (2530322) panicked at crates/ax-normalize/src/parsers/delimited.rs:98:9:
assertion `left == right` failed
  left: 0
 right: 2

---- parsers::delimited::tests::tsv_parses_tab_delimited stdout ----

thread 'parsers::delimited::tests::tsv_parses_tab_delimited' (2530326) panicked at crates/ax-normalize/src/parsers/delimited.rs:113:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    parsers::delimited::tests::csv_roundtrip_types_and_nulls
    parsers::delimited::tests::ragged_csv_pads_and_truncates
    parsers::delimited::tests::tsv_parses_tab_delimited
    tests::csv_end_to_end
    tests::ragged_csv_pads_and_truncates
    tests::tsv_sniffed_from_content

test result: FAILED. 34 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
