*** crates/ax-normalize/src/parsers/delimited.rs:57:5: replace tab_before_comma -> bool with false

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace tab_before_comma -> bool with false
@@ -49,21 +49,17 @@
 
 /// True if a tab appears before any comma on `line` (or a tab with no comma) —
 /// the signal that a stream is tab- rather than comma-delimited.
 ///
 /// `t` and `c` are byte offsets of distinct characters, so they are never
 /// equal; `<` is the only meaningful comparison (its `<=` mutant is therefore
 /// equivalent — see `.cargo/mutants.toml`).
 fn tab_before_comma(line: &str) -> bool {
-    match (line.find('\t'), line.find(',')) {
-        (Some(t), Some(c)) => t < c,
-        (Some(_), None) => true,
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// The first non-empty trimmed line of a UTF-8 stream that isn't JSON-shaped.
 /// Returns `None` for binary, empty, or `[`/`{`-leading content.
 fn tabular_first_line(bytes: &[u8]) -> Option<&str> {
     let text = std::str::from_utf8(bytes).ok()?;
     let trimmed = text.trim_start();
     let first = trimmed.chars().next()?;

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2531707) panicked at crates/ax-normalize/src/parser.rs:150:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2531718) panicked at crates/ax-normalize/src/parsers/delimited.rs:149:9:
assertion `left == right` failed
  left: None
 right: Some(50)

---- parsers::delimited::tests::tab_before_comma_logic stdout ----

thread 'parsers::delimited::tests::tab_before_comma_logic' (2531719) panicked at crates/ax-normalize/src/parsers/delimited.rs:118:9:
assertion failed: tab_before_comma("a\tb,c")

failures:
    parser::tests::sniff_used_without_a_known_extension
    parsers::delimited::tests::sniff_confidences
    parsers::delimited::tests::tab_before_comma_logic
    tests::tsv_sniffed_from_content

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
