*** crates/ax-normalize/src/parsers/delimited.rs:58:9: delete match arm (Some(t), Some(c)) in tab_before_comma

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ delete match arm (Some(t), Some(c)) in tab_before_comma
@@ -50,17 +50,17 @@
 /// True if a tab appears before any comma on `line` (or a tab with no comma) —
 /// the signal that a stream is tab- rather than comma-delimited.
 ///
 /// `t` and `c` are byte offsets of distinct characters, so they are never
 /// equal; `<` is the only meaningful comparison (its `<=` mutant is therefore
 /// equivalent — see `.cargo/mutants.toml`).
 fn tab_before_comma(line: &str) -> bool {
     match (line.find('\t'), line.find(',')) {
-        (Some(t), Some(c)) => t < c,
+         /* ~ changed by cargo-mutants ~ */
         (Some(_), None) => true,
         _ => false,
     }
 }
 
 /// The first non-empty trimmed line of a UTF-8 stream that isn't JSON-shaped.
 /// Returns `None` for binary, empty, or `[`/`{`-leading content.
 fn tabular_first_line(bytes: &[u8]) -> Option<&str> {

---- parsers::delimited::tests::tab_before_comma_logic stdout ----

thread 'parsers::delimited::tests::tab_before_comma_logic' (2532357) panicked at crates/ax-normalize/src/parsers/delimited.rs:122:9:
assertion failed: tab_before_comma("a\tb,c")

failures:
    parsers::delimited::tests::tab_before_comma_logic

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
