*** crates/ax-normalize/src/parsers/delimited.rs:59:9: delete match arm (Some(_), None) in tab_before_comma

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ delete match arm (Some(_), None) in tab_before_comma
@@ -51,17 +51,17 @@
 /// the signal that a stream is tab- rather than comma-delimited.
 ///
 /// `t` and `c` are byte offsets of distinct characters, so they are never
 /// equal; `<` is the only meaningful comparison (its `<=` mutant is therefore
 /// equivalent — see `.cargo/mutants.toml`).
 fn tab_before_comma(line: &str) -> bool {
     match (line.find('\t'), line.find(',')) {
         (Some(t), Some(c)) => t < c,
-        (Some(_), None) => true,
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 /// The first non-empty trimmed line of a UTF-8 stream that isn't JSON-shaped.
 /// Returns `None` for binary, empty, or `[`/`{`-leading content.
 fn tabular_first_line(bytes: &[u8]) -> Option<&str> {
     let text = std::str::from_utf8(bytes).ok()?;

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2532978) panicked at crates/ax-normalize/src/parser.rs:150:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2532989) panicked at crates/ax-normalize/src/parsers/delimited.rs:153:9:
assertion `left == right` failed
  left: None
 right: Some(50)

---- parsers::delimited::tests::tab_before_comma_logic stdout ----

thread 'parsers::delimited::tests::tab_before_comma_logic' (2532990) panicked at crates/ax-normalize/src/parsers/delimited.rs:123:9:
assertion failed: tab_before_comma("a\tb\tc")

failures:
    parser::tests::sniff_used_without_a_known_extension
    parsers::delimited::tests::sniff_confidences
    parsers::delimited::tests::tab_before_comma_logic
    tests::tsv_sniffed_from_content

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
