*** crates/ax-normalize/src/parsers/delimited.rs:67:5: replace tabular_first_line -> Option<&str> with Some("")

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace tabular_first_line -> Option<&str> with Some("")
@@ -59,23 +59,17 @@
         (Some(_), None) => true,
         _ => false,
     }
 }
 
 /// The first non-empty trimmed line of a UTF-8 stream that isn't JSON-shaped.
 /// Returns `None` for binary, empty, or `[`/`{`-leading content.
 fn tabular_first_line(bytes: &[u8]) -> Option<&str> {
-    let text = std::str::from_utf8(bytes).ok()?;
-    let trimmed = text.trim_start();
-    let first = trimmed.chars().next()?;
-    if first == '[' || first == '{' {
-        return None;
-    }
-    trimmed.lines().next()
+    Some("") /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct CsvParser;
 
 impl FormatParser for CsvParser {
     fn id(&self) -> &'static str {
         "csv"

---- parser::tests::unrecognized_stream_errors stdout ----

thread 'parser::tests::unrecognized_stream_errors' (2535592) panicked at crates/ax-normalize/src/parser.rs:173:9:
assertion failed: matches!(reg().resolve("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2535591) panicked at crates/ax-normalize/src/parser.rs:150:9:
assertion `left == right` failed
  left: "csv"
 right: "tsv"

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2535602) panicked at crates/ax-normalize/src/parsers/delimited.rs:147:9:
assertion `left == right` failed
  left: None
 right: Some(50)

failures:
    parser::tests::sniff_used_without_a_known_extension
    parser::tests::unrecognized_stream_errors
    parsers::delimited::tests::sniff_confidences
    tests::tsv_sniffed_from_content
    tests::unknown_format_errors

test result: FAILED. 35 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
