*** crates/ax-normalize/src/parsers/delimited.rs:70:14: replace == with != in tabular_first_line

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace == with != in tabular_first_line
@@ -62,17 +62,17 @@
 }
 
 /// The first non-empty trimmed line of a UTF-8 stream that isn't JSON-shaped.
 /// Returns `None` for binary, empty, or `[`/`{`-leading content.
 fn tabular_first_line(bytes: &[u8]) -> Option<&str> {
     let text = std::str::from_utf8(bytes).ok()?;
     let trimmed = text.trim_start();
     let first = trimmed.chars().next()?;
-    if first == '[' || first == '{' {
+    if first != /* ~ changed by cargo-mutants ~ */ '[' || first == '{' {
         return None;
     }
     trimmed.lines().next()
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct CsvParser;

---- parser::tests::csv_mentioning_par1_is_still_csv stdout ----

thread 'parser::tests::csv_mentioning_par1_is_still_csv' (2537561) panicked at crates/ax-normalize/src/parser.rs:168:55:
called `Result::unwrap()` on an `Err` value: UnknownFormat("-")

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2537565) panicked at crates/ax-normalize/src/parser.rs:149:52:
called `Result::unwrap()` on an `Err` value: UnknownFormat("-")

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2537576) panicked at crates/ax-normalize/src/parsers/delimited.rs:152:9:
assertion `left == right` failed
  left: None
 right: Some(1)

failures:
    parser::tests::csv_mentioning_par1_is_still_csv
    parser::tests::sniff_used_without_a_known_extension
    parsers::delimited::tests::sniff_confidences
    tests::tsv_sniffed_from_content

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
