*** crates/ax-normalize/src/parsers/delimited.rs:70:21: replace || with && in tabular_first_line

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace || with && in tabular_first_line
@@ -62,17 +62,17 @@
 }
 
 /// The first non-empty trimmed line of a UTF-8 stream that isn't JSON-shaped.
 /// Returns `None` for binary, empty, or `[`/`{`-leading content.
 fn tabular_first_line(bytes: &[u8]) -> Option<&str> {
     let text = std::str::from_utf8(bytes).ok()?;
     let trimmed = text.trim_start();
     let first = trimmed.chars().next()?;
-    if first == '[' || first == '{' {
+    if first == '[' && /* ~ changed by cargo-mutants ~ */ first == '{' {
         return None;
     }
     trimmed.lines().next()
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct CsvParser;

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2536938) panicked at crates/ax-normalize/src/parsers/delimited.rs:155:9:
assertion `left == right` failed
  left: Some(1)
 right: None

failures:
    parsers::delimited::tests::sniff_confidences

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
