*** crates/ax-normalize/src/parsers/delimited.rs:81:9: replace <impl FormatParser for CsvParser>::id -> &'static str with ""

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for CsvParser>::id -> &'static str with ""
@@ -73,17 +73,17 @@
     trimmed.lines().next()
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct CsvParser;
 
 impl FormatParser for CsvParser {
     fn id(&self) -> &'static str {
-        "csv"
+        "" /* ~ changed by cargo-mutants ~ */
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["csv"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Fallback: claim any non-JSON UTF-8 text at the lowest confidence.
         tabular_first_line(bytes).map(|_| FALLBACK)
     }

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2538928) panicked at crates/ax-normalize/src/parser.rs:188:9:
assertion `left == right` failed
  left: ""
 right: "csv"

---- parser::tests::csv_mentioning_par1_is_still_csv stdout ----

thread 'parser::tests::csv_mentioning_par1_is_still_csv' (2538926) panicked at crates/ax-normalize/src/parser.rs:168:9:
assertion `left == right` failed
  left: ""
 right: "csv"

---- parser::tests::extension_wins_over_content stdout ----

thread 'parser::tests::extension_wins_over_content' (2538929) panicked at crates/ax-normalize/src/parser.rs:144:9:
assertion `left == right` failed
  left: ""
 right: "csv"

failures:
    parser::tests::csv_mentioning_par1_is_still_csv
    parser::tests::default_registry_lists_all_formats
    parser::tests::extension_overrides_content_sniff
    parser::tests::extension_wins_over_content
    parser::tests::sniff_used_without_a_known_extension
    tests::csv_end_to_end
    tests::normalize_with_explicit_id

test result: FAILED. 33 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
