*** crates/ax-normalize/src/parsers/delimited.rs:84:9: replace <impl FormatParser for CsvParser>::extensions -> &'static[&'static str] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for CsvParser>::extensions -> &'static[&'static str] with Vec::leak(Vec::new())
@@ -76,17 +76,17 @@
 #[derive(Debug, Default, Clone)]
 pub struct CsvParser;
 
 impl FormatParser for CsvParser {
     fn id(&self) -> &'static str {
         "csv"
     }
     fn extensions(&self) -> &'static [&'static str] {
-        &["csv"]
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Fallback: claim any non-JSON UTF-8 text at the lowest confidence.
         tabular_first_line(bytes).map(|_| FALLBACK)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         read_delimited(bytes, b',', self.id())
     }

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2540224) panicked at crates/ax-normalize/src/parser.rs:188:9:
assertion `left == right` failed
  left: "tsv"
 right: "csv"

---- parser::tests::extension_wins_over_content stdout ----

thread 'parser::tests::extension_wins_over_content' (2540225) panicked at crates/ax-normalize/src/parser.rs:144:9:
assertion `left == right` failed
  left: "json"
 right: "csv"

failures:
    parser::tests::extension_overrides_content_sniff
    parser::tests::extension_wins_over_content

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
