*** crates/ax-normalize/src/parsers/delimited.rs:88:9: replace <impl FormatParser for CsvParser>::sniff -> Option<Confidence> with None

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for CsvParser>::sniff -> Option<Confidence> with None
@@ -80,17 +80,17 @@
     fn id(&self) -> &'static str {
         "csv"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["csv"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Fallback: claim any non-JSON UTF-8 text at the lowest confidence.
-        tabular_first_line(bytes).map(|_| FALLBACK)
+        None /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         read_delimited(bytes, b',', self.id())
     }
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct TsvParser;

---- parser::tests::csv_mentioning_par1_is_still_csv stdout ----

thread 'parser::tests::csv_mentioning_par1_is_still_csv' (2542188) panicked at crates/ax-normalize/src/parser.rs:168:55:
called `Result::unwrap()` on an `Err` value: UnknownFormat("-")

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2542192) panicked at crates/ax-normalize/src/parser.rs:149:52:
called `Result::unwrap()` on an `Err` value: UnknownFormat("-")

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2542203) panicked at crates/ax-normalize/src/parsers/delimited.rs:152:9:
assertion `left == right` failed
  left: None
 right: Some(1)

failures:
    parser::tests::csv_mentioning_par1_is_still_csv
    parser::tests::sniff_used_without_a_known_extension
    parsers::delimited::tests::sniff_confidences

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
