*** crates/ax-normalize/src/parsers/delimited.rs:88:9: replace <impl FormatParser for CsvParser>::sniff -> Option<Confidence> with Some(Default::default())

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for CsvParser>::sniff -> Option<Confidence> with Some(Default::default())
@@ -80,17 +80,17 @@
     fn id(&self) -> &'static str {
         "csv"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["csv"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Fallback: claim any non-JSON UTF-8 text at the lowest confidence.
-        tabular_first_line(bytes).map(|_| FALLBACK)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         read_delimited(bytes, b',', self.id())
     }
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct TsvParser;

---- parser::tests::unrecognized_stream_errors stdout ----

thread 'parser::tests::unrecognized_stream_errors' (2542830) panicked at crates/ax-normalize/src/parser.rs:173:9:
assertion failed: matches!(reg().resolve("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

---- parsers::delimited::tests::sniff_confidences stdout ----

thread 'parsers::delimited::tests::sniff_confidences' (2542840) panicked at crates/ax-normalize/src/parsers/delimited.rs:152:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(1)

---- tests::unknown_format_errors stdout ----

thread 'tests::unknown_format_errors' (2542860) panicked at crates/ax-normalize/src/lib.rs:85:9:
assertion failed: matches!(normalize("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

failures:
    parser::tests::unrecognized_stream_errors
    parsers::delimited::tests::sniff_confidences
    tests::unknown_format_errors

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
