*** crates/ax-normalize/src/parsers/delimited.rs:91:9: replace <impl FormatParser for CsvParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/parsers/delimited.rs
+++ replace <impl FormatParser for CsvParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -83,17 +83,17 @@
     fn extensions(&self) -> &'static [&'static str] {
         &["csv"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         // Fallback: claim any non-JSON UTF-8 text at the lowest confidence.
         tabular_first_line(bytes).map(|_| FALLBACK)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-        read_delimited(bytes, b',', self.id())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Default, Clone)]
 pub struct TsvParser;
 
 impl FormatParser for TsvParser {
     fn id(&self) -> &'static str {

---- parsers::delimited::tests::ragged_csv_pads_and_truncates stdout ----

thread 'parsers::delimited::tests::ragged_csv_pads_and_truncates' (2543542) panicked at crates/ax-normalize/src/parsers/delimited.rs:139:24:
index out of bounds: the len is 0 but the index is 1

---- parsers::delimited::tests::csv_roundtrip_types_and_nulls stdout ----

thread 'parsers::delimited::tests::csv_roundtrip_types_and_nulls' (2543541) panicked at crates/ax-normalize/src/parsers/delimited.rs:131:9:
assertion `left == right` failed
  left: 0
 right: 2

---- tests::csv_end_to_end stdout ----

thread 'tests::csv_end_to_end' (2543556) panicked at crates/ax-normalize/src/lib.rs:47:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    parsers::delimited::tests::csv_roundtrip_types_and_nulls
    parsers::delimited::tests::ragged_csv_pads_and_truncates
    tests::csv_end_to_end
    tests::ragged_csv_pads_and_truncates

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
