*** crates/ax-normalize/src/parsers/json.rs:13:9: replace <impl FormatParser for JsonParser>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/ax-normalize/src/parsers/json.rs
+++ replace <impl FormatParser for JsonParser>::id -> &'static str with "xyzzy"
@@ -5,17 +5,17 @@
 use crate::table::TableBuilder;
 use ax_core::{AxError, Column};
 
 #[derive(Debug, Default, Clone)]
 pub struct JsonParser;
 
 impl FormatParser for JsonParser {
     fn id(&self) -> &'static str {
-        "json"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["json"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         let first = text.trim_start().chars().next()?;
         // A leading `[` or `{` is a JSON document. NDJSON outranks this when it

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2550050) panicked at crates/ax-normalize/src/parser.rs:186:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "json"

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2550052) panicked at crates/ax-normalize/src/parser.rs:151:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "json"

---- parser::tests::default_registry_lists_all_formats stdout ----

thread 'parser::tests::default_registry_lists_all_formats' (2550049) panicked at crates/ax-normalize/src/parser.rs:209:9:
assertion `left == right` failed
  left: ["parquet", "arrow", "ndjson", "xyzzy", "tsv", "csv"]
 right: ["parquet", "arrow", "ndjson", "json", "tsv", "csv"]

failures:
    parser::tests::default_registry_lists_all_formats
    parser::tests::extension_overrides_content_sniff
    parser::tests::sniff_used_without_a_known_extension
    tests::json_end_to_end

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
