*** crates/ax-normalize/src/parsers/json.rs:16:9: replace <impl FormatParser for JsonParser>::extensions -> &'static[&'static str] with Vec::leak(vec!["xyzzy"])

*** mutation diff:
--- crates/ax-normalize/src/parsers/json.rs
+++ replace <impl FormatParser for JsonParser>::extensions -> &'static[&'static str] with Vec::leak(vec!["xyzzy"])
@@ -8,17 +8,17 @@
 #[derive(Debug, Default, Clone)]
 pub struct JsonParser;
 
 impl FormatParser for JsonParser {
     fn id(&self) -> &'static str {
         "json"
     }
     fn extensions(&self) -> &'static [&'static str] {
-        &["json"]
+        Vec::leak(vec!["xyzzy"]) /* ~ changed by cargo-mutants ~ */
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         let first = text.trim_start().chars().next()?;
         // A leading `[` or `{` is a JSON document. NDJSON outranks this when it
         // sees repeated object-lines (see ndjson.rs).
         (first == '[' || first == '{').then_some(TEXT)
     }

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2552007) panicked at crates/ax-normalize/src/parser.rs:186:9:
assertion `left == right` failed
  left: "csv"
 right: "json"

failures:
    parser::tests::extension_overrides_content_sniff

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
