*** crates/ax-normalize/src/parsers/json.rs:19:9: replace <impl FormatParser for JsonParser>::sniff -> Option<Confidence> with None

*** mutation diff:
--- crates/ax-normalize/src/parsers/json.rs
+++ replace <impl FormatParser for JsonParser>::sniff -> Option<Confidence> with None
@@ -11,21 +11,17 @@
 impl FormatParser for JsonParser {
     fn id(&self) -> &'static str {
         "json"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["json"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
-        let text = std::str::from_utf8(bytes).ok()?;
-        let first = text.trim_start().chars().next()?;
-        // A leading `[` or `{` is a JSON document. NDJSON outranks this when it
-        // sees repeated object-lines (see ndjson.rs).
-        (first == '[' || first == '{').then_some(TEXT)
+        None /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let val: serde_json::Value = serde_json::from_slice(bytes).map_err(|e| AxError::Parse {
             format: self.id().to_string(),
             message: e.to_string(),
         })?;
         let mut builder = TableBuilder::new();
         match val {

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2552712) panicked at crates/ax-normalize/src/parser.rs:151:55:
called `Result::unwrap()` on an `Err` value: UnknownFormat("-")

---- parsers::json::tests::sniff_recognizes_json_shapes stdout ----

thread 'parsers::json::tests::sniff_recognizes_json_shapes' (2552729) panicked at crates/ax-normalize/src/parsers/json.rs:64:9:
assertion `left == right` failed
  left: None
 right: Some(50)

failures:
    parser::tests::sniff_used_without_a_known_extension
    parsers::json::tests::sniff_recognizes_json_shapes

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
