*** crates/ax-normalize/src/parsers/json.rs:19:9: replace <impl FormatParser for JsonParser>::sniff -> Option<Confidence> with Some(Default::default())

*** mutation diff:
--- crates/ax-normalize/src/parsers/json.rs
+++ replace <impl FormatParser for JsonParser>::sniff -> Option<Confidence> with Some(Default::default())
@@ -11,21 +11,17 @@
 impl FormatParser for JsonParser {
     fn id(&self) -> &'static str {
         "json"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["json"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
-        let text = std::str::from_utf8(bytes).ok()?;
-        let first = text.trim_start().chars().next()?;
-        // A leading `[` or `{` is a JSON document. NDJSON outranks this when it
-        // sees repeated object-lines (see ndjson.rs).
-        (first == '[' || first == '{').then_some(TEXT)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let val: serde_json::Value = serde_json::from_slice(bytes).map_err(|e| AxError::Parse {
             format: self.id().to_string(),
             message: e.to_string(),
         })?;
         let mut builder = TableBuilder::new();
         match val {

---- parser::tests::unrecognized_stream_errors stdout ----

thread 'parser::tests::unrecognized_stream_errors' (2553351) panicked at crates/ax-normalize/src/parser.rs:173:9:
assertion failed: matches!(reg().resolve("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

---- parsers::json::tests::sniff_recognizes_json_shapes stdout ----

thread 'parsers::json::tests::sniff_recognizes_json_shapes' (2553367) panicked at crates/ax-normalize/src/parsers/json.rs:64:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(50)

---- tests::unknown_format_errors stdout ----

thread 'tests::unknown_format_errors' (2553381) panicked at crates/ax-normalize/src/lib.rs:85:9:
assertion failed: matches!(normalize("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

failures:
    parser::tests::unrecognized_stream_errors
    parsers::json::tests::sniff_recognizes_json_shapes
    tests::unknown_format_errors

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
