*** crates/ax-normalize/src/parsers/json.rs:23:23: replace || with && in <impl FormatParser for JsonParser>::sniff

*** mutation diff:
--- crates/ax-normalize/src/parsers/json.rs
+++ replace || with && in <impl FormatParser for JsonParser>::sniff
@@ -15,17 +15,17 @@
     fn extensions(&self) -> &'static [&'static str] {
         &["json"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         let first = text.trim_start().chars().next()?;
         // A leading `[` or `{` is a JSON document. NDJSON outranks this when it
         // sees repeated object-lines (see ndjson.rs).
-        (first == '[' || first == '{').then_some(TEXT)
+        (first == '[' && /* ~ changed by cargo-mutants ~ */ first == '{').then_some(TEXT)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let val: serde_json::Value = serde_json::from_slice(bytes).map_err(|e| AxError::Parse {
             format: self.id().to_string(),
             message: e.to_string(),
         })?;
         let mut builder = TableBuilder::new();
         match val {

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2553983) panicked at crates/ax-normalize/src/parser.rs:151:55:
called `Result::unwrap()` on an `Err` value: UnknownFormat("-")

---- parsers::json::tests::sniff_recognizes_json_shapes stdout ----

thread 'parsers::json::tests::sniff_recognizes_json_shapes' (2554000) panicked at crates/ax-normalize/src/parsers/json.rs:68:9:
assertion `left == right` failed
  left: None
 right: Some(50)

failures:
    parser::tests::sniff_used_without_a_known_extension
    parsers::json::tests::sniff_recognizes_json_shapes

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
