*** crates/ax-normalize/src/parsers/json.rs:23:32: replace == with != in <impl FormatParser for JsonParser>::sniff

*** mutation diff:
--- crates/ax-normalize/src/parsers/json.rs
+++ replace == with != in <impl FormatParser for JsonParser>::sniff
@@ -15,17 +15,17 @@
     fn extensions(&self) -> &'static [&'static str] {
         &["json"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         let first = text.trim_start().chars().next()?;
         // A leading `[` or `{` is a JSON document. NDJSON outranks this when it
         // sees repeated object-lines (see ndjson.rs).
-        (first == '[' || first == '{').then_some(TEXT)
+        (first == '[' || first != /* ~ changed by cargo-mutants ~ */ '{').then_some(TEXT)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let val: serde_json::Value = serde_json::from_slice(bytes).map_err(|e| AxError::Parse {
             format: self.id().to_string(),
             message: e.to_string(),
         })?;
         let mut builder = TableBuilder::new();
         match val {

---- parser::tests::csv_mentioning_par1_is_still_csv stdout ----

thread 'parser::tests::csv_mentioning_par1_is_still_csv' (2555334) panicked at crates/ax-normalize/src/parser.rs:168:9:
assertion `left == right` failed
  left: "json"
 right: "csv"

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2555338) panicked at crates/ax-normalize/src/parser.rs:149:9:
assertion `left == right` failed
  left: "json"
 right: "csv"

---- parsers::json::tests::sniff_recognizes_json_shapes stdout ----

thread 'parsers::json::tests::sniff_recognizes_json_shapes' (2555355) panicked at crates/ax-normalize/src/parsers/json.rs:69:9:
assertion `left == right` failed
  left: None
 right: Some(50)

failures:
    parser::tests::csv_mentioning_par1_is_still_csv
    parser::tests::sniff_used_without_a_known_extension
    parsers::json::tests::sniff_recognizes_json_shapes
    tests::tsv_sniffed_from_content

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
