*** crates/ax-normalize/src/parsers/json.rs:26:9: replace <impl FormatParser for JsonParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/parsers/json.rs
+++ replace <impl FormatParser for JsonParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -18,30 +18,17 @@
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         let first = text.trim_start().chars().next()?;
         // A leading `[` or `{` is a JSON document. NDJSON outranks this when it
         // sees repeated object-lines (see ndjson.rs).
         (first == '[' || first == '{').then_some(TEXT)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-        let val: serde_json::Value = serde_json::from_slice(bytes).map_err(|e| AxError::Parse {
-            format: self.id().to_string(),
-            message: e.to_string(),
-        })?;
-        let mut builder = TableBuilder::new();
-        match val {
-            serde_json::Value::Array(items) => {
-                for item in items {
-                    builder.push_value(item);
-                }
-            }
-            other => builder.push_value(other),
-        }
-        Ok(builder.finish())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use ax_core::ColType;

---- parsers::json::tests::malformed_json_errors stdout ----

thread 'parsers::json::tests::malformed_json_errors' (2556015) panicked at crates/ax-normalize/src/parsers/json.rs:62:9:
assertion failed: matches!(JsonParser.parse("d.json", b"{not json"), Err(AxError::Parse { .. }))

---- parsers::json::tests::array_of_objects stdout ----

thread 'parsers::json::tests::array_of_objects' (2556014) panicked at crates/ax-normalize/src/parsers/json.rs:40:9:
assertion `left == right` failed
  left: 0
 right: 1

---- parsers::json::tests::scalar_array_goes_to_value_column stdout ----

thread 'parsers::json::tests::scalar_array_goes_to_value_column' (2556016) panicked at crates/ax-normalize/src/parsers/json.rs:49:24:
index out of bounds: the len is 0 but the index is 0

failures:
    parsers::json::tests::array_of_objects
    parsers::json::tests::malformed_json_errors
    parsers::json::tests::scalar_array_goes_to_value_column
    tests::json_end_to_end

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
