*** crates/ax-normalize/src/parsers/mod.rs:25:5: replace default_registry -> ParserRegistry with Default::default()

*** mutation diff:
--- crates/ax-normalize/src/parsers/mod.rs
+++ replace default_registry -> ParserRegistry with Default::default()
@@ -17,23 +17,17 @@
 
 #[cfg(feature = "polars")]
 pub use columnar::{ArrowParser, ParquetParser};
 
 /// The default parser set. Registration order is the deterministic tie-break
 /// for content sniffing: binary magic first, then the more specific text shapes
 /// (NDJSON before JSON, TSV before CSV), then the CSV fallback.
 pub fn default_registry() -> ParserRegistry {
-    let mut r = ParserRegistry::new();
-    register_binary(&mut r);
-    r.register(Box::new(NdjsonParser));
-    r.register(Box::new(JsonParser));
-    r.register(Box::new(TsvParser));
-    r.register(Box::new(CsvParser));
-    r
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Binary columnar parsers register only with the `polars` feature. Without it,
 /// a Parquet/Arrow file resolves to no parser and is reported as an unknown
 /// format — the build genuinely cannot read it.
 fn register_binary(r: &mut ParserRegistry) {
     #[cfg(feature = "polars")]
     {

*** result: Failure(101)
