*** crates/ax-normalize/src/parsers/mod.rs:38:5: replace register_binary with ()

*** mutation diff:
--- crates/ax-normalize/src/parsers/mod.rs
+++ replace register_binary with ()
@@ -30,18 +30,10 @@
     r.register(Box::new(CsvParser));
     r
 }
 
 /// Binary columnar parsers register only with the `polars` feature. Without it,
 /// a Parquet/Arrow file resolves to no parser and is reported as an unknown
 /// format — the build genuinely cannot read it.
 fn register_binary(r: &mut ParserRegistry) {
-    #[cfg(feature = "polars")]
-    {
-        r.register(Box::new(ParquetParser));
-        r.register(Box::new(ArrowParser));
-    }
-    #[cfg(not(feature = "polars"))]
-    {
-        let _ = r;
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }

---- parser::tests::binary_extensions_resolve stdout ----

thread 'parser::tests::binary_extensions_resolve' (2525471) panicked at crates/ax-normalize/src/parser.rs:195:9:
assertion `left == right` failed
  left: "csv"
 right: "parquet"

---- parser::tests::binary_magic_outranks_text_sniff stdout ----

thread 'parser::tests::binary_magic_outranks_text_sniff' (2525472) panicked at crates/ax-normalize/src/parser.rs:161:9:
assertion `left == right` failed
  left: "csv"
 right: "parquet"

---- parser::tests::default_registry_lists_all_formats stdout ----

thread 'parser::tests::default_registry_lists_all_formats' (2525474) panicked at crates/ax-normalize/src/parser.rs:209:9:
assertion `left == right` failed
  left: ["ndjson", "json", "tsv", "csv"]
 right: ["parquet", "arrow", "ndjson", "json", "tsv", "csv"]

failures:
    parser::tests::binary_extensions_resolve
    parser::tests::binary_magic_outranks_text_sniff
    parser::tests::default_registry_lists_all_formats
    tests::parquet_routes_through_the_registry

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
