*** crates/ax-normalize/src/parsers/ndjson.rs:13:9: replace <impl FormatParser for NdjsonParser>::id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/ax-normalize/src/parsers/ndjson.rs
+++ replace <impl FormatParser for NdjsonParser>::id -> &'static str with "xyzzy"
@@ -5,17 +5,17 @@
 use crate::table::TableBuilder;
 use ax_core::{AxError, Column};
 
 #[derive(Debug, Default, Clone)]
 pub struct NdjsonParser;
 
 impl FormatParser for NdjsonParser {
     fn id(&self) -> &'static str {
-        "ndjson"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["ndjson", "jsonl"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         let trimmed = text.trim_start();
         if !trimmed.starts_with('{') {

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2557508) panicked at crates/ax-normalize/src/parser.rs:187:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "ndjson"

---- parser::tests::default_registry_lists_all_formats stdout ----

thread 'parser::tests::default_registry_lists_all_formats' (2557507) panicked at crates/ax-normalize/src/parser.rs:209:9:
assertion `left == right` failed
  left: ["parquet", "arrow", "xyzzy", "json", "tsv", "csv"]
 right: ["parquet", "arrow", "ndjson", "json", "tsv", "csv"]

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2557510) panicked at crates/ax-normalize/src/parser.rs:152:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "ndjson"

failures:
    parser::tests::default_registry_lists_all_formats
    parser::tests::extension_overrides_content_sniff
    parser::tests::sniff_used_without_a_known_extension
    tests::ndjson_end_to_end

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
