*** crates/ax-normalize/src/parsers/ndjson.rs:16:9: replace <impl FormatParser for NdjsonParser>::extensions -> &'static[&'static str] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/ax-normalize/src/parsers/ndjson.rs
+++ replace <impl FormatParser for NdjsonParser>::extensions -> &'static[&'static str] with Vec::leak(Vec::new())
@@ -8,17 +8,17 @@
 #[derive(Debug, Default, Clone)]
 pub struct NdjsonParser;
 
 impl FormatParser for NdjsonParser {
     fn id(&self) -> &'static str {
         "ndjson"
     }
     fn extensions(&self) -> &'static [&'static str] {
-        &["ndjson", "jsonl"]
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         let trimmed = text.trim_start();
         if !trimmed.starts_with('{') {
             return None;
         }
         // Two or more object-leading lines distinguishes NDJSON from a single

---- parser::tests::extension_overrides_content_sniff stdout ----

thread 'parser::tests::extension_overrides_content_sniff' (2558165) panicked at crates/ax-normalize/src/parser.rs:187:9:
assertion `left == right` failed
  left: "csv"
 right: "ndjson"

failures:
    parser::tests::extension_overrides_content_sniff

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
