*** crates/ax-normalize/src/parsers/ndjson.rs:21:12: delete ! in <impl FormatParser for NdjsonParser>::sniff

*** mutation diff:
--- crates/ax-normalize/src/parsers/ndjson.rs
+++ delete ! in <impl FormatParser for NdjsonParser>::sniff
@@ -13,17 +13,17 @@
         "ndjson"
     }
     fn extensions(&self) -> &'static [&'static str] {
         &["ndjson", "jsonl"]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         let trimmed = text.trim_start();
-        if !trimmed.starts_with('{') {
+        if  /* ~ changed by cargo-mutants ~ */trimmed.starts_with('{') {
             return None;
         }
         // Two or more object-leading lines distinguishes NDJSON from a single
         // JSON object; this outranks JsonParser's TEXT confidence.
         let object_lines = trimmed
             .lines()
             .filter(|l| !l.trim().is_empty())
             .take(3)

---- parser::tests::sniff_used_without_a_known_extension stdout ----

thread 'parser::tests::sniff_used_without_a_known_extension' (2561496) panicked at crates/ax-normalize/src/parser.rs:152:9:
assertion `left == right` failed
  left: "json"
 right: "ndjson"

---- parsers::ndjson::tests::sniff_needs_repeated_object_lines stdout ----

thread 'parsers::ndjson::tests::sniff_needs_repeated_object_lines' (2561517) panicked at crates/ax-normalize/src/parsers/ndjson.rs:79:9:
assertion `left == right` failed
  left: None
 right: Some(60)

---- tests::ndjson_end_to_end stdout ----

thread 'tests::ndjson_end_to_end' (2561522) panicked at crates/ax-normalize/src/lib.rs:55:68:
called `Result::unwrap()` on an `Err` value: Parse { format: "json", message: "trailing characters at line 2 column 1" }

failures:
    parser::tests::sniff_used_without_a_known_extension
    parsers::ndjson::tests::sniff_needs_repeated_object_lines
    tests::ndjson_end_to_end

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
