*** crates/ax-normalize/src/parsers/ndjson.rs:35:9: replace <impl FormatParser for NdjsonParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/parsers/ndjson.rs
+++ replace <impl FormatParser for NdjsonParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -27,33 +27,17 @@
             .lines()
             .filter(|l| !l.trim().is_empty())
             .take(3)
             .filter(|l| l.trim_start().starts_with('{'))
             .count();
         (object_lines >= 2).then_some(STRONG)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-        let text = std::str::from_utf8(bytes).map_err(|e| AxError::Parse {
-            format: self.id().to_string(),
-            message: e.to_string(),
-        })?;
-        let mut builder = TableBuilder::new();
-        for (lineno, line) in text.lines().enumerate() {
-            if line.trim().is_empty() {
-                continue;
-            }
-            let val: serde_json::Value =
-                serde_json::from_str(line).map_err(|e| AxError::Parse {
-                    format: self.id().to_string(),
-                    message: format!("line {}: {e}", lineno + 1),
-                })?;
-            builder.push_value(val);
-        }
-        Ok(builder.finish())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- parsers::ndjson::tests::key_union_pads_missing stdout ----

thread 'parsers::ndjson::tests::key_union_pads_missing' (2563855) panicked at crates/ax-normalize/src/parsers/ndjson.rs:48:56:
called `Option::unwrap()` on a `None` value

---- parsers::ndjson::tests::blank_lines_skipped stdout ----

thread 'parsers::ndjson::tests::blank_lines_skipped' (2563854) panicked at crates/ax-normalize/src/parsers/ndjson.rs:58:24:
index out of bounds: the len is 0 but the index is 0

---- parsers::ndjson::tests::malformed_line_errors_with_line_number stdout ----

thread 'parsers::ndjson::tests::malformed_line_errors_with_line_number' (2563856) panicked at crates/ax-normalize/src/parsers/ndjson.rs:70:66:
called `Result::unwrap_err()` on an `Ok` value: []

failures:
    parsers::ndjson::tests::blank_lines_skipped
    parsers::ndjson::tests::key_union_pads_missing
    parsers::ndjson::tests::malformed_line_errors_with_line_number
    tests::ndjson_end_to_end

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
