*** crates/ax-normalize/src/parsers/zeek.rs:20:5: replace decode_separator -> Option<char> with None

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace decode_separator -> Option<char> with None
@@ -12,20 +12,17 @@
 use ax_core::{AxError, Column, Value};
 
 #[derive(Debug, Default, Clone)]
 pub struct ZeekParser;
 
 /// Decodes a Zeek `#separator` value such as `\x09` into its character. A plain
 /// character (or unescaped byte) is returned as-is.
 fn decode_separator(token: &str) -> Option<char> {
-    match token.strip_prefix("\\x") {
-        Some(hex) => u8::from_str_radix(hex, 16).ok().map(|b| b as char),
-        None => token.chars().next(),
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 impl ZeekParser {
     fn err(&self, msg: impl std::fmt::Display) -> AxError {
         AxError::Parse {
             format: self.id().to_string(),
             message: msg.to_string(),
         }

---- parsers::zeek::tests::separator_directive_decodes stdout ----

thread 'parsers::zeek::tests::separator_directive_decodes' (2745292) panicked at crates/ax-normalize/src/parsers/zeek.rs:136:9:
assertion `left == right` failed
  left: None
 right: Some('\t')

failures:
    parsers::zeek::tests::separator_directive_decodes

test result: FAILED. 49 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
