*** crates/ax-normalize/src/parsers/zeek.rs:20:5: replace decode_separator -> Option<char> with Some(Default::default())

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace decode_separator -> Option<char> with Some(Default::default())
@@ -12,20 +12,17 @@
 use ax_core::{AxError, Column, Value};
 
 #[derive(Debug, Default, Clone)]
 pub struct ZeekParser;
 
 /// Decodes a Zeek `#separator` value such as `\x09` into its character. A plain
 /// character (or unescaped byte) is returned as-is.
 fn decode_separator(token: &str) -> Option<char> {
-    match token.strip_prefix("\\x") {
-        Some(hex) => u8::from_str_radix(hex, 16).ok().map(|b| b as char),
-        None => token.chars().next(),
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 impl ZeekParser {
     fn err(&self, msg: impl std::fmt::Display) -> AxError {
         AxError::Parse {
             format: self.id().to_string(),
             message: msg.to_string(),
         }

---- parsers::zeek::tests::respects_a_custom_empty_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_empty_field' (2746003) panicked at crates/ax-normalize/src/parsers/zeek.rs:180:56:
called `Result::unwrap()` on an `Err` value: Parse { format: "zeek", message: "data row before #fields header" }

---- parsers::zeek::tests::respects_a_custom_unset_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_unset_field' (2746004) panicked at crates/ax-normalize/src/parsers/zeek.rs:171:56:
called `Result::unwrap()` on an `Err` value: Parse { format: "zeek", message: "data row before #fields header" }

---- parsers::zeek::tests::parses_fields_and_typed_columns stdout ----

thread 'parsers::zeek::tests::parses_fields_and_typed_columns' (2746001) panicked at crates/ax-normalize/src/parsers/zeek.rs:131:52:
called `Result::unwrap()` on an `Err` value: Parse { format: "zeek", message: "data row before #fields header" }

failures:
    parsers::zeek::tests::parses_fields_and_typed_columns
    parsers::zeek::tests::respects_a_custom_empty_field
    parsers::zeek::tests::respects_a_custom_unset_field
    parsers::zeek::tests::separator_directive_decodes
    parsers::zeek::tests::unset_token_maps_to_null

test result: FAILED. 45 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
