*** crates/ax-normalize/src/parsers/zeek.rs:37:9: replace <impl FormatParser for ZeekParser>::id -> &'static str with ""

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace <impl FormatParser for ZeekParser>::id -> &'static str with ""
@@ -29,17 +29,17 @@
             format: self.id().to_string(),
             message: msg.to_string(),
         }
     }
 }
 
 impl FormatParser for ZeekParser {
     fn id(&self) -> &'static str {
-        "zeek"
+        "" /* ~ changed by cargo-mutants ~ */
     }
     fn extensions(&self) -> &'static [&'static str] {
         // No extension: Zeek logs are `*.log`, too generic to claim. Detection
         // is by the `#separator` header (see `sniff`).
         &[]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;

---- parser::tests::default_registry_lists_all_formats stdout ----

thread 'parser::tests::default_registry_lists_all_formats' (2746637) panicked at crates/ax-normalize/src/parser.rs:215:9:
assertion `left == right` failed
  left: ["parquet", "arrow", "ndjson", "", "json", "tsv", "csv"]
 right: ["parquet", "arrow", "ndjson", "zeek", "json", "tsv", "csv"]

---- parsers::zeek::tests::resolves_by_content_not_extension stdout ----

thread 'parsers::zeek::tests::resolves_by_content_not_extension' (2746666) panicked at crates/ax-normalize/src/parsers/zeek.rs:220:9:
assertion `left == right` failed
  left: ""
 right: "zeek"

failures:
    parser::tests::default_registry_lists_all_formats
    parsers::zeek::tests::resolves_by_content_not_extension

test result: FAILED. 48 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
