*** crates/ax-normalize/src/parsers/zeek.rs:42:9: replace <impl FormatParser for ZeekParser>::extensions -> &'static[&'static str] with Vec::leak(vec![""])

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace <impl FormatParser for ZeekParser>::extensions -> &'static[&'static str] with Vec::leak(vec![""])
@@ -34,17 +34,17 @@
 
 impl FormatParser for ZeekParser {
     fn id(&self) -> &'static str {
         "zeek"
     }
     fn extensions(&self) -> &'static [&'static str] {
         // No extension: Zeek logs are `*.log`, too generic to claim. Detection
         // is by the `#separator` header (see `sniff`).
-        &[]
+        Vec::leak(vec![""]) /* ~ changed by cargo-mutants ~ */
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         text.trim_start().starts_with("#separator").then_some(STRONG)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let text = std::str::from_utf8(bytes).map_err(|e| self.err(e))?;
         let mut sep = '\t';

---- parsers::zeek::tests::claims_no_extension stdout ----

thread 'parsers::zeek::tests::claims_no_extension' (2748020) panicked at crates/ax-normalize/src/parsers/zeek.rs:197:9:
assertion failed: ZeekParser.extensions().is_empty()

failures:
    parsers::zeek::tests::claims_no_extension

test result: FAILED. 49 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
