*** crates/ax-normalize/src/parsers/zeek.rs:45:9: replace <impl FormatParser for ZeekParser>::sniff -> Option<Confidence> with None

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace <impl FormatParser for ZeekParser>::sniff -> Option<Confidence> with None
@@ -37,18 +37,17 @@
         "zeek"
     }
     fn extensions(&self) -> &'static [&'static str] {
         // No extension: Zeek logs are `*.log`, too generic to claim. Detection
         // is by the `#separator` header (see `sniff`).
         &[]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
-        let text = std::str::from_utf8(bytes).ok()?;
-        text.trim_start().starts_with("#separator").then_some(STRONG)
+        None /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let text = std::str::from_utf8(bytes).map_err(|e| self.err(e))?;
         let mut sep = '\t';
         let mut unset = "-".to_string();
         let mut empty = "(empty)".to_string();
         let mut fields: Option<Vec<String>> = None;
         let mut cols: Vec<Vec<Value>> = Vec::new();

---- parsers::zeek::tests::resolves_by_content_not_extension stdout ----

thread 'parsers::zeek::tests::resolves_by_content_not_extension' (2749313) panicked at crates/ax-normalize/src/parsers/zeek.rs:219:9:
assertion `left == right` failed
  left: "csv"
 right: "zeek"

---- parsers::zeek::tests::sniff_recognizes_zeek_header_only stdout ----

thread 'parsers::zeek::tests::sniff_recognizes_zeek_header_only' (2749317) panicked at crates/ax-normalize/src/parsers/zeek.rs:189:9:
assertion `left == right` failed
  left: None
 right: Some(60)

failures:
    parsers::zeek::tests::resolves_by_content_not_extension
    parsers::zeek::tests::sniff_recognizes_zeek_header_only

test result: FAILED. 48 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
