*** crates/ax-normalize/src/parsers/zeek.rs:45:9: replace <impl FormatParser for ZeekParser>::sniff -> Option<Confidence> with Some(Default::default())

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace <impl FormatParser for ZeekParser>::sniff -> Option<Confidence> with Some(Default::default())
@@ -37,18 +37,17 @@
         "zeek"
     }
     fn extensions(&self) -> &'static [&'static str] {
         // No extension: Zeek logs are `*.log`, too generic to claim. Detection
         // is by the `#separator` header (see `sniff`).
         &[]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
-        let text = std::str::from_utf8(bytes).ok()?;
-        text.trim_start().starts_with("#separator").then_some(STRONG)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
         let text = std::str::from_utf8(bytes).map_err(|e| self.err(e))?;
         let mut sep = '\t';
         let mut unset = "-".to_string();
         let mut empty = "(empty)".to_string();
         let mut fields: Option<Vec<String>> = None;
         let mut cols: Vec<Vec<Value>> = Vec::new();

---- parser::tests::unrecognized_stream_errors stdout ----

thread 'parser::tests::unrecognized_stream_errors' (2750002) panicked at crates/ax-normalize/src/parser.rs:179:9:
assertion failed: matches!(reg().resolve("-", &[0x00, 0x01, 0x02, 0xff]),
    Err(AxError::UnknownFormat(_)))

---- parsers::zeek::tests::resolves_by_content_not_extension stdout ----

thread 'parsers::zeek::tests::resolves_by_content_not_extension' (2750027) panicked at crates/ax-normalize/src/parsers/zeek.rs:219:9:
assertion `left == right` failed
  left: "csv"
 right: "zeek"

---- parsers::zeek::tests::sniff_recognizes_zeek_header_only stdout ----

thread 'parsers::zeek::tests::sniff_recognizes_zeek_header_only' (2750031) panicked at crates/ax-normalize/src/parsers/zeek.rs:189:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(60)

failures:
    parser::tests::unrecognized_stream_errors
    parsers::zeek::tests::resolves_by_content_not_extension
    parsers::zeek::tests::sniff_recognizes_zeek_header_only
    tests::unknown_format_errors

test result: FAILED. 46 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
