*** crates/ax-normalize/src/parsers/zeek.rs:49:9: replace <impl FormatParser for ZeekParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace <impl FormatParser for ZeekParser>::parse -> Result<Vec<Column>, AxError> with Ok(vec![])
@@ -41,79 +41,17 @@
         // is by the `#separator` header (see `sniff`).
         &[]
     }
     fn sniff(&self, bytes: &[u8]) -> Option<Confidence> {
         let text = std::str::from_utf8(bytes).ok()?;
         text.trim_start().starts_with("#separator").then_some(STRONG)
     }
     fn parse(&self, _source: &str, bytes: &[u8]) -> Result<Vec<Column>, AxError> {
-        let text = std::str::from_utf8(bytes).map_err(|e| self.err(e))?;
-        let mut sep = '\t';
-        let mut unset = "-".to_string();
-        let mut empty = "(empty)".to_string();
-        let mut fields: Option<Vec<String>> = None;
-        let mut cols: Vec<Vec<Value>> = Vec::new();
-
-        for line in text.lines() {
-            if line.is_empty() {
-                continue;
-            }
-            if let Some(rest) = line.strip_prefix('#') {
-                // `#separator` is space-delimited and comes first; it sets the
-                // separator the rest of the header and the data rows use.
-                if let Some(val) = rest.strip_prefix("separator") {
-                    if let Some(c) = decode_separator(val.trim()) {
-                        sep = c;
-                    }
-                    continue;
-                }
-                let mut parts = rest.split(sep);
-                match parts.next().unwrap_or("") {
-                    "fields" => {
-                        let names: Vec<String> = parts.map(str::to_string).collect();
-                        cols = vec![Vec::new(); names.len()];
-                        fields = Some(names);
-                    }
-                    "unset_field" => {
-                        if let Some(v) = parts.next() {
-                            unset = v.to_string();
-                        }
-                    }
-                    "empty_field" => {
-                        if let Some(v) = parts.next() {
-                            empty = v.to_string();
-                        }
-                    }
-                    _ => {} // set_separator, types, path, open, close — ignored
-                }
-                continue;
-            }
-
-            // A data row. It must come after the `#fields` header.
-            if fields.is_none() {
-                return Err(self.err("data row before #fields header"));
-            }
-            let mut values = line.split(sep);
-            for col in cols.iter_mut() {
-                col.push(match values.next() {
-                    Some(v) if v == unset => Value::Null,
-                    Some(v) if v == empty => Value::Str(String::new()),
-                    Some(v) => infer::infer_scalar(v),
-                    None => Value::Null,
-                });
-            }
-        }
-
-        let names = fields.ok_or_else(|| self.err("missing #fields header"))?;
-        Ok(names
-            .into_iter()
-            .zip(cols)
-            .map(|(name, cells)| Column::new(name, cells))
-            .collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use ax_core::ColType;

---- parsers::zeek::tests::data_before_fields_errors stdout ----

thread 'parsers::zeek::tests::data_before_fields_errors' (2750676) panicked at crates/ax-normalize/src/parsers/zeek.rs:140:9:
assertion failed: matches!(ZeekParser.parse("-", b"1\t2\t3\n"), Err(AxError::Parse { .. }))

---- parsers::zeek::tests::header_without_fields_errors stdout ----

thread 'parsers::zeek::tests::header_without_fields_errors' (2750677) panicked at crates/ax-normalize/src/parsers/zeek.rs:148:9:
assertion failed: matches!(ZeekParser.parse("-", b"#separator \\x09\n#path\tconn\n"),
    Err(AxError::Parse { .. }))

---- parsers::zeek::tests::parses_fields_and_typed_columns stdout ----

thread 'parsers::zeek::tests::parses_fields_and_typed_columns' (2750678) panicked at crates/ax-normalize/src/parsers/zeek.rs:87:9:
assertion `left == right` failed
  left: []
 right: ["ts", "uid", "id.orig_h", "id.orig_p", "proto", "service", "duration", "orig_bytes"]

failures:
    parsers::zeek::tests::data_before_fields_errors
    parsers::zeek::tests::header_without_fields_errors
    parsers::zeek::tests::parses_fields_and_typed_columns
    parsers::zeek::tests::respects_a_custom_empty_field
    parsers::zeek::tests::respects_a_custom_unset_field
    parsers::zeek::tests::unset_token_maps_to_null

test result: FAILED. 44 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
