*** crates/ax-normalize/src/parsers/zeek.rs:71:21: delete match arm "fields" in <impl FormatParser for ZeekParser>::parse

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ delete match arm "fields" in <impl FormatParser for ZeekParser>::parse
@@ -63,21 +63,17 @@
                 if let Some(val) = rest.strip_prefix("separator") {
                     if let Some(c) = decode_separator(val.trim()) {
                         sep = c;
                     }
                     continue;
                 }
                 let mut parts = rest.split(sep);
                 match parts.next().unwrap_or("") {
-                    "fields" => {
-                        let names: Vec<String> = parts.map(str::to_string).collect();
-                        cols = vec![Vec::new(); names.len()];
-                        fields = Some(names);
-                    }
+                     /* ~ changed by cargo-mutants ~ */
                     "unset_field" => {
                         if let Some(v) = parts.next() {
                             unset = v.to_string();
                         }
                     }
                     "empty_field" => {
                         if let Some(v) = parts.next() {
                             empty = v.to_string();

---- parsers::zeek::tests::respects_a_custom_empty_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_empty_field' (2751349) panicked at crates/ax-normalize/src/parsers/zeek.rs:179:56:
called `Result::unwrap()` on an `Err` value: Parse { format: "zeek", message: "data row before #fields header" }

---- parsers::zeek::tests::parses_fields_and_typed_columns stdout ----

thread 'parsers::zeek::tests::parses_fields_and_typed_columns' (2751347) panicked at crates/ax-normalize/src/parsers/zeek.rs:130:52:
called `Result::unwrap()` on an `Err` value: Parse { format: "zeek", message: "data row before #fields header" }

---- parsers::zeek::tests::respects_a_custom_unset_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_unset_field' (2751350) panicked at crates/ax-normalize/src/parsers/zeek.rs:170:56:
called `Result::unwrap()` on an `Err` value: Parse { format: "zeek", message: "data row before #fields header" }

failures:
    parsers::zeek::tests::parses_fields_and_typed_columns
    parsers::zeek::tests::respects_a_custom_empty_field
    parsers::zeek::tests::respects_a_custom_unset_field
    parsers::zeek::tests::unset_token_maps_to_null

test result: FAILED. 46 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
