*** crates/ax-normalize/src/parsers/zeek.rs:76:21: delete match arm "unset_field" in <impl FormatParser for ZeekParser>::parse

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ delete match arm "unset_field" in <impl FormatParser for ZeekParser>::parse
@@ -68,21 +68,17 @@
                 }
                 let mut parts = rest.split(sep);
                 match parts.next().unwrap_or("") {
                     "fields" => {
                         let names: Vec<String> = parts.map(str::to_string).collect();
                         cols = vec![Vec::new(); names.len()];
                         fields = Some(names);
                     }
-                    "unset_field" => {
-                        if let Some(v) = parts.next() {
-                            unset = v.to_string();
-                        }
-                    }
+                     /* ~ changed by cargo-mutants ~ */
                     "empty_field" => {
                         if let Some(v) = parts.next() {
                             empty = v.to_string();
                         }
                     }
                     _ => {} // set_separator, types, path, open, close — ignored
                 }
                 continue;

---- parsers::zeek::tests::respects_a_custom_unset_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_unset_field' (2752100) panicked at crates/ax-normalize/src/parsers/zeek.rs:171:9:
assertion `left == right` failed
  left: Str("NULL")
 right: Null

failures:
    parsers::zeek::tests::respects_a_custom_unset_field

test result: FAILED. 49 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
