*** crates/ax-normalize/src/parsers/zeek.rs:81:21: delete match arm "empty_field" in <impl FormatParser for ZeekParser>::parse

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ delete match arm "empty_field" in <impl FormatParser for ZeekParser>::parse
@@ -73,21 +73,17 @@
                         cols = vec![Vec::new(); names.len()];
                         fields = Some(names);
                     }
                     "unset_field" => {
                         if let Some(v) = parts.next() {
                             unset = v.to_string();
                         }
                     }
-                    "empty_field" => {
-                        if let Some(v) = parts.next() {
-                            empty = v.to_string();
-                        }
-                    }
+                     /* ~ changed by cargo-mutants ~ */
                     _ => {} // set_separator, types, path, open, close — ignored
                 }
                 continue;
             }
 
             // A data row. It must come after the `#fields` header.
             if fields.is_none() {
                 return Err(self.err("data row before #fields header"));

---- parsers::zeek::tests::respects_a_custom_empty_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_empty_field' (2752749) panicked at crates/ax-normalize/src/parsers/zeek.rs:180:9:
assertion `left == right` failed: empty token → empty string
  left: Str("EMPTY")
 right: Str("")

failures:
    parsers::zeek::tests::respects_a_custom_empty_field

test result: FAILED. 49 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
