*** crates/ax-normalize/src/parsers/zeek.rs:98:32: replace match guard v == unset with false in <impl FormatParser for ZeekParser>::parse

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace match guard v == unset with false in <impl FormatParser for ZeekParser>::parse
@@ -90,17 +90,17 @@
 
             // A data row. It must come after the `#fields` header.
             if fields.is_none() {
                 return Err(self.err("data row before #fields header"));
             }
             let mut values = line.split(sep);
             for col in cols.iter_mut() {
                 col.push(match values.next() {
-                    Some(v) if v == unset => Value::Null,
+                    Some(v) if false /* ~ changed by cargo-mutants ~ */ => Value::Null,
                     Some(v) if v == empty => Value::Str(String::new()),
                     Some(v) => infer::infer_scalar(v),
                     None => Value::Null,
                 });
             }
         }
 
         let names = fields.ok_or_else(|| self.err("missing #fields header"))?;

---- parsers::zeek::tests::respects_a_custom_empty_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_empty_field' (2754111) panicked at crates/ax-normalize/src/parsers/zeek.rs:185:9:
assertion `left == right` failed: unset token → null
  left: Str("-")
 right: Null

---- parsers::zeek::tests::respects_a_custom_unset_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_unset_field' (2754112) panicked at crates/ax-normalize/src/parsers/zeek.rs:175:9:
assertion `left == right` failed
  left: Str("NULL")
 right: Null

---- parsers::zeek::tests::unset_token_maps_to_null stdout ----

thread 'parsers::zeek::tests::unset_token_maps_to_null' (2754115) panicked at crates/ax-normalize/src/parsers/zeek.rs:164:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    parsers::zeek::tests::respects_a_custom_empty_field
    parsers::zeek::tests::respects_a_custom_unset_field
    parsers::zeek::tests::unset_token_maps_to_null

test result: FAILED. 47 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
