*** crates/ax-normalize/src/parsers/zeek.rs:98:34: replace == with != in <impl FormatParser for ZeekParser>::parse

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace == with != in <impl FormatParser for ZeekParser>::parse
@@ -90,17 +90,17 @@
 
             // A data row. It must come after the `#fields` header.
             if fields.is_none() {
                 return Err(self.err("data row before #fields header"));
             }
             let mut values = line.split(sep);
             for col in cols.iter_mut() {
                 col.push(match values.next() {
-                    Some(v) if v == unset => Value::Null,
+                    Some(v) if v != /* ~ changed by cargo-mutants ~ */ unset => Value::Null,
                     Some(v) if v == empty => Value::Str(String::new()),
                     Some(v) => infer::infer_scalar(v),
                     None => Value::Null,
                 });
             }
         }
 
         let names = fields.ok_or_else(|| self.err("missing #fields header"))?;

---- parsers::zeek::tests::parses_fields_and_typed_columns stdout ----

thread 'parsers::zeek::tests::parses_fields_and_typed_columns' (2756072) panicked at crates/ax-normalize/src/parsers/zeek.rs:154:9:
assertion `left == right` failed: ts is epoch float
  left: Unknown
 right: Float

---- parsers::zeek::tests::respects_a_custom_empty_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_empty_field' (2756074) panicked at crates/ax-normalize/src/parsers/zeek.rs:184:9:
assertion `left == right` failed: empty token → empty string
  left: Null
 right: Str("")

---- parsers::zeek::tests::respects_a_custom_unset_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_unset_field' (2756075) panicked at crates/ax-normalize/src/parsers/zeek.rs:175:9:
assertion `left == right` failed
  left: Str("NULL")
 right: Null

failures:
    parsers::zeek::tests::parses_fields_and_typed_columns
    parsers::zeek::tests::respects_a_custom_empty_field
    parsers::zeek::tests::respects_a_custom_unset_field
    parsers::zeek::tests::unset_token_maps_to_null

test result: FAILED. 46 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
