*** crates/ax-normalize/src/parsers/zeek.rs:99:32: replace match guard v == empty with true in <impl FormatParser for ZeekParser>::parse

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace match guard v == empty with true in <impl FormatParser for ZeekParser>::parse
@@ -91,17 +91,17 @@
             // A data row. It must come after the `#fields` header.
             if fields.is_none() {
                 return Err(self.err("data row before #fields header"));
             }
             let mut values = line.split(sep);
             for col in cols.iter_mut() {
                 col.push(match values.next() {
                     Some(v) if v == unset => Value::Null,
-                    Some(v) if v == empty => Value::Str(String::new()),
+                    Some(v) if true /* ~ changed by cargo-mutants ~ */ => Value::Str(String::new()),
                     Some(v) => infer::infer_scalar(v),
                     None => Value::Null,
                 });
             }
         }
 
         let names = fields.ok_or_else(|| self.err("missing #fields header"))?;
         Ok(names

---- parsers::zeek::tests::parses_fields_and_typed_columns stdout ----

thread 'parsers::zeek::tests::parses_fields_and_typed_columns' (2754778) panicked at crates/ax-normalize/src/parsers/zeek.rs:154:9:
assertion `left == right` failed: ts is epoch float
  left: Str
 right: Float

---- parsers::zeek::tests::unset_token_maps_to_null stdout ----

thread 'parsers::zeek::tests::unset_token_maps_to_null' (2754784) panicked at crates/ax-normalize/src/parsers/zeek.rs:165:9:
assertion `left == right` failed
  left: Str("")
 right: Str("http")

failures:
    parsers::zeek::tests::parses_fields_and_typed_columns
    parsers::zeek::tests::unset_token_maps_to_null

test result: FAILED. 48 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
