*** crates/ax-normalize/src/parsers/zeek.rs:99:32: replace match guard v == empty with false in <impl FormatParser for ZeekParser>::parse

*** mutation diff:
--- crates/ax-normalize/src/parsers/zeek.rs
+++ replace match guard v == empty with false in <impl FormatParser for ZeekParser>::parse
@@ -91,17 +91,17 @@
             // A data row. It must come after the `#fields` header.
             if fields.is_none() {
                 return Err(self.err("data row before #fields header"));
             }
             let mut values = line.split(sep);
             for col in cols.iter_mut() {
                 col.push(match values.next() {
                     Some(v) if v == unset => Value::Null,
-                    Some(v) if v == empty => Value::Str(String::new()),
+                    Some(v) if false /* ~ changed by cargo-mutants ~ */ => Value::Str(String::new()),
                     Some(v) => infer::infer_scalar(v),
                     None => Value::Null,
                 });
             }
         }
 
         let names = fields.ok_or_else(|| self.err("missing #fields header"))?;
         Ok(names

---- parsers::zeek::tests::respects_a_custom_empty_field stdout ----

thread 'parsers::zeek::tests::respects_a_custom_empty_field' (2755428) panicked at crates/ax-normalize/src/parsers/zeek.rs:184:9:
assertion `left == right` failed: empty token → empty string
  left: Str("EMPTY")
 right: Str("")

failures:
    parsers::zeek::tests::respects_a_custom_empty_field

test result: FAILED. 49 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
