*** crates/ax-normalize/src/table.rs:30:9: replace TableBuilder::ensure -> usize with 1

*** mutation diff:
--- crates/ax-normalize/src/table.rs
+++ replace TableBuilder::ensure -> usize with 1
@@ -22,24 +22,17 @@
 
 impl TableBuilder {
     pub fn new() -> Self {
         TableBuilder::default()
     }
 
     /// Ensures a column exists, back-filling it with `Null` for prior rows.
     fn ensure(&mut self, name: &str) -> usize {
-        if let Some(&i) = self.index.get(name) {
-            return i;
-        }
-        let i = self.order.len();
-        self.order.push(name.to_string());
-        self.index.insert(name.to_string(), i);
-        self.cols.push(vec![Value::Null; self.rows]);
-        i
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Adds one record. Objects contribute their fields; anything else goes to
     /// the synthetic [`VALUE_COL`] column.
     pub fn push_value(&mut self, val: serde_json::Value) {
         let mut row: BTreeMap<String, Value> = BTreeMap::new();
         match val {
             serde_json::Value::Object(map) => {

---- parsers::json::tests::array_of_objects stdout ----

thread 'parsers::json::tests::array_of_objects' (2526790) panicked at crates/ax-normalize/src/parsers/json.rs:53:9:
assertion `left == right` failed
  left: 0
 right: 1

---- parsers::json::tests::scalar_array_goes_to_value_column stdout ----

thread 'parsers::json::tests::scalar_array_goes_to_value_column' (2526792) panicked at crates/ax-normalize/src/parsers/json.rs:62:24:
index out of bounds: the len is 0 but the index is 0

---- parsers::ndjson::tests::blank_lines_skipped stdout ----

thread 'parsers::ndjson::tests::blank_lines_skipped' (2526794) panicked at crates/ax-normalize/src/parsers/ndjson.rs:74:24:
index out of bounds: the len is 0 but the index is 0

failures:
    parsers::json::tests::array_of_objects
    parsers::json::tests::scalar_array_goes_to_value_column
    parsers::ndjson::tests::blank_lines_skipped
    parsers::ndjson::tests::key_union_pads_missing
    table::tests::key_union_pads_missing_with_null
    table::tests::non_object_goes_to_value_column
    tests::json_end_to_end
    tests::ndjson_end_to_end

test result: FAILED. 32 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
