*** crates/ax-normalize/src/table.rs:43:9: replace TableBuilder::push_value with ()

*** mutation diff:
--- crates/ax-normalize/src/table.rs
+++ replace TableBuilder::push_value with ()
@@ -35,35 +35,17 @@
         self.index.insert(name.to_string(), i);
         self.cols.push(vec![Value::Null; self.rows]);
         i
     }
 
     /// Adds one record. Objects contribute their fields; anything else goes to
     /// the synthetic [`VALUE_COL`] column.
     pub fn push_value(&mut self, val: serde_json::Value) {
-        let mut row: BTreeMap<String, Value> = BTreeMap::new();
-        match val {
-            serde_json::Value::Object(map) => {
-                for (k, v) in map {
-                    row.insert(k, infer::json_to_value(&v));
-                }
-            }
-            other => {
-                row.insert(VALUE_COL.to_string(), infer::json_to_value(&other));
-            }
-        }
-        for k in row.keys() {
-            self.ensure(k);
-        }
-        for (name, &i) in &self.index {
-            let cell = row.remove(name).unwrap_or(Value::Null);
-            self.cols[i].push(cell);
-        }
-        self.rows += 1;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn finish(self) -> Vec<Column> {
         self.order
             .into_iter()
             .zip(self.cols)
             .map(|(name, cells)| Column::new(name, cells))
             .collect()

---- parsers::json::tests::array_of_objects stdout ----

thread 'parsers::json::tests::array_of_objects' (2527484) panicked at crates/ax-normalize/src/parsers/json.rs:53:9:
assertion `left == right` failed
  left: 0
 right: 1

---- parsers::json::tests::scalar_array_goes_to_value_column stdout ----

thread 'parsers::json::tests::scalar_array_goes_to_value_column' (2527486) panicked at crates/ax-normalize/src/parsers/json.rs:62:24:
index out of bounds: the len is 0 but the index is 0

---- parsers::ndjson::tests::blank_lines_skipped stdout ----

thread 'parsers::ndjson::tests::blank_lines_skipped' (2527488) panicked at crates/ax-normalize/src/parsers/ndjson.rs:74:24:
index out of bounds: the len is 0 but the index is 0

failures:
    parsers::json::tests::array_of_objects
    parsers::json::tests::scalar_array_goes_to_value_column
    parsers::ndjson::tests::blank_lines_skipped
    parsers::ndjson::tests::key_union_pads_missing
    table::tests::key_union_pads_missing_with_null
    table::tests::non_object_goes_to_value_column
    tests::json_end_to_end
    tests::ndjson_end_to_end

test result: FAILED. 32 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
