*** crates/ax-normalize/src/table.rs:65:9: replace TableBuilder::finish -> Vec<Column> with vec![]

*** mutation diff:
--- crates/ax-normalize/src/table.rs
+++ replace TableBuilder::finish -> Vec<Column> with vec![]
@@ -57,21 +57,17 @@
         for (name, &i) in &self.index {
             let cell = row.remove(name).unwrap_or(Value::Null);
             self.cols[i].push(cell);
         }
         self.rows += 1;
     }
 
     pub fn finish(self) -> Vec<Column> {
-        self.order
-            .into_iter()
-            .zip(self.cols)
-            .map(|(name, cells)| Column::new(name, cells))
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- parsers::json::tests::array_of_objects stdout ----

thread 'parsers::json::tests::array_of_objects' (2529433) panicked at crates/ax-normalize/src/parsers/json.rs:53:9:
assertion `left == right` failed
  left: 0
 right: 1

---- parsers::ndjson::tests::blank_lines_skipped stdout ----

thread 'parsers::ndjson::tests::blank_lines_skipped' (2529437) panicked at crates/ax-normalize/src/parsers/ndjson.rs:74:24:
index out of bounds: the len is 0 but the index is 0

---- parsers::json::tests::scalar_array_goes_to_value_column stdout ----

thread 'parsers::json::tests::scalar_array_goes_to_value_column' (2529435) panicked at crates/ax-normalize/src/parsers/json.rs:62:24:
index out of bounds: the len is 0 but the index is 0

failures:
    parsers::json::tests::array_of_objects
    parsers::json::tests::scalar_array_goes_to_value_column
    parsers::ndjson::tests::blank_lines_skipped
    parsers::ndjson::tests::key_union_pads_missing
    table::tests::key_union_pads_missing_with_null
    table::tests::non_object_goes_to_value_column
    tests::json_end_to_end
    tests::ndjson_end_to_end

test result: FAILED. 32 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
