*** crates/ax-validate/src/lib.rs:135:9: delete - in correct_digits

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ delete - in correct_digits
@@ -127,17 +127,17 @@
     let rel = if certified != 0.0 {
         ((computed - certified) / certified).abs()
     } else {
         computed.abs()
     };
     if rel == 0.0 {
         f64::INFINITY
     } else {
-        -rel.log10()
+         /* ~ changed by cargo-mutants ~ */rel.log10()
     }
 }
 
 /// The textbook one-pass ("sum of squares") variance, kept here precisely to
 /// demonstrate what anomalyx deliberately does *not* do: on data with a large
 /// mean and small spread it suffers catastrophic cancellation. Contrast with
 /// [`ax_core::det::variance`], which is two-pass and compensated.
 pub fn naive_one_pass_variance(xs: &[f64]) -> f64 {

---- tests::correct_digits_behaves stdout ----

thread 'tests::correct_digits_behaves' (1986100) panicked at crates/ax-validate/src/lib.rs:166:9:
assertion failed: (correct_digits(1.001, 1.0) - 3.0).abs() < 0.01

failures:
    tests::correct_digits_behaves

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
