*** crates/ax-validate/src/lib.rs:68:21: replace >= with < in parse

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace >= with < in parse
@@ -60,17 +60,17 @@
     let autocorr = certified("Autocorrelation");
     let nobs = certified("Number of Observations") as usize;
 
     // Data starts after the all-dashes separator line.
     let sep = lines
         .iter()
         .position(|l| {
             let t = l.trim();
-            t.len() >= 3 && t.bytes().all(|b| b == b'-')
+            t.len() < /* ~ changed by cargo-mutants ~ */ 3 && t.bytes().all(|b| b == b'-')
         })
         .unwrap_or_else(|| panic!("{name}: no dashed separator before data"));
     // Strict parse: every non-blank line after the separator must be numeric.
     // (A lenient `filter_map(...ok())` would mask a mis-detected separator.)
     let data: Vec<f64> = lines[sep + 1..]
         .iter()
         .map(|l| l.trim())
         .filter(|l| !l.is_empty())

---- tests::every_dataset_parses_with_the_certified_count stdout ----

thread 'tests::every_dataset_parses_with_the_certified_count' (1981402) panicked at crates/ax-validate/src/lib.rs:79:37:
PiDigits: non-numeric data line "File Format:   ASCII"

failures:
    tests::every_dataset_parses_with_the_certified_count

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
