*** crates/ax-validate/src/lib.rs:73:36: replace + with * in parse

*** mutation diff:
--- crates/ax-validate/src/lib.rs
+++ replace + with * in parse
@@ -65,17 +65,17 @@
         .iter()
         .position(|l| {
             let t = l.trim();
             t.len() >= 3 && t.bytes().all(|b| b == b'-')
         })
         .unwrap_or_else(|| panic!("{name}: no dashed separator before data"));
     // Strict parse: every non-blank line after the separator must be numeric.
     // (A lenient `filter_map(...ok())` would mask a mis-detected separator.)
-    let data: Vec<f64> = lines[sep + 1..]
+    let data: Vec<f64> = lines[sep * /* ~ changed by cargo-mutants ~ */ 1..]
         .iter()
         .map(|l| l.trim())
         .filter(|l| !l.is_empty())
         .map(|l| {
             l.parse::<f64>()
                 .unwrap_or_else(|_| panic!("{name}: non-numeric data line {l:?}"))
         })
         .collect();

---- tests::every_dataset_parses_with_the_certified_count stdout ----

thread 'tests::every_dataset_parses_with_the_certified_count' (1982275) panicked at crates/ax-validate/src/lib.rs:79:37:
PiDigits: non-numeric data line "---------"

failures:
    tests::every_dataset_parses_with_the_certified_count

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
